{"Lesson(s) Learned":"Personal equipment used by repair personnel in elevated positions must be tethered to them to prevent damage from dropping.","Lesson ID":58}
{"Lesson(s) Learned":"If optics destined for spaceborne or space-related instruments are not tested, or are improperly tested, then the consequences could be the ultimate failure of the mission in-whole or in-part. The Hubble Space Telescope primary mirror is a case in point.","Lesson ID":717}
{"Lesson(s) Learned":"Failure to adhere to the guidance provided in this preferred reliability practice could result in: (1) prolonged investigations yielding either marginal or no fruitful results; (2) expenditure of the valuable time and efforts of engineering personnel with less than optimum performance; and (3) failure to pinpoint problem causes and corrective actions with precision. Overall results could be slippage of the schedule, increased costs, unidentified hazards to the crew and other personnel, and nonperformance of the mission.","Lesson ID":757}
{"Lesson(s) Learned":"During engagement, electrical connectors that are improperly aligned may mate inadvertently with an incorrect connector half. Technicians attempting to mate connectors in areas of restricted visibility can mismate connectors. Kapton wire insulation can breakdown and sustain an electrical arc, igniting the insulation and causing damage to associated harnesses and connectors.","Lesson ID":53}
{"Lesson(s) Learned":"Tape position error accumulation on an onboard spacecraft tape recorder can require arduous workarounds to reset the position indicator.","Lesson ID":380}
{"Lesson(s) Learned":"The IDC was not designed or fabricated in accordance with the following NASA design requirements: NSTS 07700, Volume X; SW-E-0002; KSC-STD-E-0002E; and KSC-E-165E. The IDC purge components were not designed to prevent overpressurization, which caused system failure. Instead of a Bepco enclosure pressure control valve, a Bepco control panel rapid-exchange valve was used to control GN2 system purge. This allowed the rapid release of overpressure, which in turn caused the system to fail. The IDC single-stage regulator was found to have vibrated open, causing the inlet pressure to increase (creep) to 50 psi. The nominal operational pressure setting is 10 psi. This increase in the inlet pressure setting allowed the system to become overpressurized and caused the system to fail. The IDC camera head enclosure lid was not sealed properly because of ground wire interference, which caused a differential in system pressure between enclosures. The bottom clip on the IDC camera battery, power supply, and power supply enclosure were seated but did not catch the enclosure door, which contributed to system purge leakage. NASA lab personnel completed measurement testing before the ICD was put into operational use. However, purge system operation and functional checkout were not performed, which prevented detection of system overpressurization before operational use. The current operational procedure, MDA Prototype Ice Detection Camera User Manual Rev 4.0, was not followed. Use of that operational procedure might have prevented the system overpressurization. A new local procedure for field use will be developed containing all operational steps, notes, cautions, and warnings. The procedure will include a section requiring that such equipment undergo purge and functional checkout in a NASA lab before use in the field. All operators will be trained on the use of the new procedure and the IDC. At the time of this close call, KSC did not have a process to certify prototype equipment used on the Center.","Lesson ID":4456}
{"Lesson(s) Learned":"Providing redundant power to critical LRUs is important to the Orbiter’s redundancy management system. However, the need to manually drop busses affects the serial turnaround flow since no other testing can take place when the power has been dropped. Ideally, the equipment’s redundant power should be verified automatically upon power-on. Because the Orbiter does not have this capability, special bus drop tests must be run to verify the bus redundancy.","Lesson ID":3761}
{"Lesson(s) Learned":"Repairing a failed component (GPC IOP Soldered Pin) before investigating the cause of a failure can destroy evidence important to the investigation. This reduces the probability of implementing effective recurrence controls.","Lesson ID":10}
{"Lesson(s) Learned":"Extreme care must be given to unplanned disconnection of previously connected electrical contactors to ensure that a good connection is restored","Lesson ID":1229}
{"Lesson(s) Learned":"A worst case analysis could have predicted potential performance anomalies of equipment susceptible to tolerance build-up. During critical spaceflight events it proved to be extremely valuable to have the original development engineers committed and available to assist in any in-flight anomaly analysis and correction.","Lesson ID":395}
{"Lesson(s) Learned":"Hazardous corona events can be induced by both flight and ground environments. Examples include: Passage of a spacecraft through a critical pressure region of the atmosphere following launch. Partial pressurization of a spacecraft in space due to gas leaks from propulsion systems, batteries, etc. Engine firings in vacuum or near vacuum which cause plume wrapping. Changes in vacuum chamber test facility pressurization which expose powered flight hardware to the critical pressure region. Electric fields from low voltage circuitry, such as pyrotechnic device firing circuits.","Lesson ID":598}
{"Lesson(s) Learned":"Standard circuit designs or parts which operate well at atmospheric pressure need to be verified for vacuum. Circuit changes to solve other problems may induce their own problems. The original problem was an instability in the TWTA power supply caused because the TWT reacted as a negative impedance load, and the power supply helix output voltage was fed back to control the voltage regulator. This problem was corrected by special focusing of the TWT's to minimize their negative load impedance characteristics and by adding a voltage doubler circuit to reduce the power supply's helix voltage output impedance. The changes that corrected the instability problem produced the large AC component on the high-voltage capacitors.","Lesson ID":417}
{"Lesson(s) Learned":"The KSC work control documentation system is inadequate and may result in a shuttle processing mishap.","Lesson ID":189}
{"Lesson(s) Learned":"As the system design evolves, emerging interface incompatibilities between the cabling and the spacecraft may not be captured in the cable design documentation that drives cable fabrication. Updating of cable wiring diagrams and drawings tends to lag the updating of circuit schematics, although maintaining accurate ICD and cable documentation is just as important.","Lesson ID":1336}
{"Lesson(s) Learned":"Heat transfer by means other than the heat pipe can have the following impacts: a price paid with respect to weight and size of the heat transfer equipment, significant heat lost in transfer over considerable distances, electromotive devices, such as liquid pumps, required to move the heat, and possible problems presented by operation in zero gravity. Nonadherence to the implementation methods presented above could result in the following possible impacts: improper cleaning and processing of the aluminum container could result in contaminants reacting with the ammonia to form NCG, which will interfere with the flow of vapor and reduce the heat transfer effectiveness. Contaminants reacting with ammonia normally produce hydrogen, and the gas collects in the condenser region. As more and more of the condenser is blocked, the surface area available for heat rejection decreases, reducing the heat transfer effectiveness; ultimately, the heat pipe may cease to function. Failure to certify welds at the end caps and the fill tube could result in improper or defective welds permitting leaks or catastrophic failure of the pressure vessel. For long-term space missions, working fluids in the appropriate temperature range, such as methanol and water, exhibit an incompatibility with aluminum, and should not be used.","Lesson ID":698}
{"Lesson(s) Learned":"Pressurized containers that use quick-release V-bands need to have an additional lid restraining element or pressure interlock. A lid restrain needs to capture the lid in the case the V-band is released when the chamber is pressurized. A pressure interlock would maintain the lid seal integrity whenever the chamber pressure is above the external atmosphere.","Lesson ID":1069}
{"Lesson(s) Learned":"Past analyses of electronic, mechanical, and optical hardware performance have sometimes focused on steady state characteristics to the exclusion of known transients. As indicated in the WIRE scenario, spacecraft venting configurations designed for steady state flow rates may experience large unexpected blow-down impulses, or even nominal cryogen flows sufficient to cause mission loss or degradation. The inability of the WIRE spacecraft to counteract accelerated venting rates suggests a marginal attitude control system authority. The unavailability of definitive cryostat temperature data during the anomalous venting period hampered early, real-time identification of the root problem (premature cover deployment).","Lesson ID":640}
{"Lesson(s) Learned":"Circuits can behave in an unexpected and unacceptable manner when applied power is removed and the stored energy decays.","Lesson ID":282}
{"Lesson(s) Learned":"Failure of one or more components (1S8-4S8) in the closed position would prevent the limit switches from stopping downward travel of the buckets.","Lesson ID":170}
{"Lesson(s) Learned":"The mechanism by which this inadvertent destruct action occurred is subtle and not readily apparent at first glance. As implemented, the KLC to P3 hand over procedure for FTS responsibility resulted in simultaneous transmission of all three command tones that are necessary to execute a command destruct action, if they are modulated on the carrier in proper sequence. The ground site at KLC was modulating the \"OPTIONAL\" command on the FTS carrier signal, while the P3 aircraft was modulating the \"ARM\" command. Note that the \"DESTRUCT\" command can be executed any time after the \"ARM\" command is latched. The root cause of the accident was found to be the modulation of all three command tones from two different transmitters during the transfer of FTS control by the Range Safety Officer (RSO), combined with the effects of plume attenuation, caused the onboard receiver to interpret the radiated signals as a \"DESTRUCT\" sequence.","Lesson ID":1254}
{"Lesson(s) Learned":"It is obvious that skipping the qualification of the vehicle to in areas involving the natural environment will present reoccurring problems. In the case of failing to perform lightning certification, the potential to induce voltages and currents has resulted in many uncertain situations where each design center has to decide from the available evidence whether or not the vehicle is flight worthy. This has been time consuming and has resulted in un-necessary testing and discussions. Many times the decision had to be made using data that was lacking completeness or was inconclusive.","Lesson ID":4416}
{"Lesson(s) Learned":"Errors in a distributors materials conformance certification resulted in use of incompatible material used to assemble quick disconnect.","Lesson ID":451}
{"Lesson(s) Learned":"The ice team failed to report discrepancies when analyzing flight hardware temperatures using instruments without understanding of operational limits.","Lesson ID":202}
{"Lesson(s) Learned":"OMS\/RCS Systems program control logic does not reset each time the program is activated, allowing inadvertent over-pressurization of the system.","Lesson ID":77}
{"Lesson(s) Learned":"Annual proof load testing could be replaced with nondestructive evaluation (NDE) inspection of the critical welds. Proof load of GSE can be replaced with visual\/NDE inspections and rated load tests. KNPR 8715.3 provides a section for the nonload test of slings and lifting fixtures. In the case of the OMS pod handling fixture, it is 200% of rated load. In most other cases, it is 150%.","Lesson ID":3197}
{"Lesson(s) Learned":"Lack of a preventative maintenance program for the OMS engine nozzle covers resulted in a \"close call\" when the covers' holding clamps failed.","Lesson ID":105}
{"Lesson(s) Learned":"Space weather has come to people's attention with the loss of the AT&T Telstar 401 satellite in January, and this seemed a reprise of that event, but with greater media play. The public noticed space weather reports. The media did not listen to the qualifiers that NASA interviewees attempted to put into their interviews. \"This is the first time we have flown a telescope capable of seeing the phenomenon\" got changed to \"We have never seen anything like this before\", allowing the inference that this would be the biggest event of all time.","Lesson ID":556}
{"Lesson(s) Learned":"Foreign Object Debris, once allowed into flight hardware, becomes almost impossible to eradicate without heroic measures","Lesson ID":1275}
{"Lesson(s) Learned":"Programs should provide an audit plan that clearly defines the audits and verifications that are expected. Projects should identify to the Program early on when a requirement will not be satisfied by Project Configuration and Data Management (CDM).","Lesson ID":4582}
{"Lesson(s) Learned":"There is no formal requirement that dependent Space Shuttle I-loads be recalculated or checked when an I-load patch is to be uplinked.","Lesson ID":1125}
{"Lesson(s) Learned":"The pneumatic and fliud quick disconnects are the same size and located close enough to easily allow misconnection within APU carrier plates.","Lesson ID":154}
{"Lesson(s) Learned":"The need to identify quantity, cost, types of spares, and related servicing techniques required to sustain a space system mission capability is a prime driver in developing maintainability requirements for a space system at the onset of its design. A system maintenance concept should be developed to define the basis for establishing maintainability requirements and to support design in the system conceptual phase. The maintenance concept provides the practical basis for design, layout, and packaging of the system and its equipment. The number of problems associated with product support and maintenance of space systems can be reduced, if not eliminated, by applying the principles prescribed in the system's maintenance concept.","Lesson ID":724}
{"Lesson(s) Learned":"If someone had reported the first close call, the second one may not have happened. Promptly reporting close calls and taking corrective action prevents injuries.","Lesson ID":531}
{"Lesson(s) Learned":"Wiring harness connectors of critical components must be capable of withstanding vibration induced stresses. Failure to protect wiring harnesses from abrasive surfaces and sharp edges of structural members will lead to wire damage caused by flight vibration.","Lesson ID":50}
{"Lesson(s) Learned":"Components may have anomalies that are within specification and which later become the source of other problems.","Lesson ID":447}
{"Lesson(s) Learned":"Failure to fully staff requirements development teams before beginning requirements development efforts can result in incomplete requirements and\/or requirements that need later changes. Approval & review Info: Approval Date: April 2, 2004 Approval Name: S. Forrester Approval Organization: UP30 Approval Phone: 256-544-4281","Lesson ID":10001}
{"Lesson(s) Learned":"As counterfeiting of aerospace parts and materials has become increasingly commonplace (Reference (3), flight system and instrument developers must exercise a high level of vigilance and institute screening processes that are sufficiently rigorous to counter the risk. Certain distributors have delivered final Ti product forms as plate material that has been cut from intermediate product forms without the necessary additional thermo-mechanical working. This substandard practice is referred to as “cut down billet.” The certification data associated with these final product forms were incomplete, contained some omissions and irregularities, or were derived from test coupons drawn from prime locations within the intermediate products that may not be representative of the cross section from which the final products were obtained. Non-conforming Ti material was confirmed from at least two commercial distributors. There has been no indication of improper Ti alloy processing by mills or conversion houses. (Material “distributors” typically do not have the thermal-mechanical processing equipment necessary to perform forging or hot rolling operations. Mills and conversion houses typically have such equipment.) Fifty JPL spacecraft and instrument projects were assessed and ultimately cleared of the possibility of having used non-conforming Ti by a combination of refined margin analysis, component testing, and\/or redesign. Although the tested material property non-conformance was relatively small, measures have been implemented by JPL to prevent non-conforming Ti material from entering its supply chain. (The non-conformance involved approximately a 5 percent reduction in ultimate tensile strength and a 10 percent reduction in tensile yield strength that in most cases was covered by the factor of safety employed by JPL.)","Lesson ID":12901}
{"Lesson(s) Learned":"Failure to consider expected releases of fluids into the external environment as part of an integrated materials compatibility assessment led to leakage from system tubing.","Lesson ID":203}
{"Lesson(s) Learned":"All other factors being equal, the elimination of redundancy in the system described in this practice would result in a considerably higher probability of failure, the identification of additional critical items and increased probability of loss of life.","Lesson ID":659}
{"Lesson(s) Learned":"Although the tin whisker phenomenon has been documented for decades and is reasonably well understood, it remains a reliability hazard that warrants continuous attention to vendor and in-house tin plating processes. Tin whiskers may grow spontaneously to more than 4 mm in length. The filaments can typically carry 25-50 mA of current, or 1 amp for a short period. (Reference #1)","Lesson ID":924}
{"Lesson(s) Learned":"Insufficient sealing of hydrogen liquid or hydrogen gasses in the fuel turbopump could cause improper operation and\/or loss of hydrogen to the environment, causing a potential catastrophic fire or explosion. Failure of bearings or turbine blades could cause loss of power and turbopump in operation. Failure to operate could result in mission abort, and an explosion could cause loss of life as well as the mission hardware.","Lesson ID":750}
{"Lesson(s) Learned":"There is no such thing as a low risk heritage detector. Each detector is one-of-a-kind and should be treated as a high risk item with an appropriate amount of contingency and a good risk mitigation plan. In addition, the XTE detector problem clearly showed the value of flight spare detectors (even if degraded) which can remain on the Observatory to maintain the Mission schedule while other detectors are reworked and qualified in parallel.","Lesson ID":479}
{"Lesson(s) Learned":"Reliance on heritage hardware\/software in spacecraft design, without a thorough analysis of compatibility with mission requirements and required changes, can result in the use of design and components which are inappropriate for the mission.","Lesson ID":346}
{"Lesson(s) Learned":"According to Reference (2), recovery from the “MSL Sol-200 Anomaly” was only possible because: The flight computer design included a capability to provide the telemetry data needed to assess spacecraft status under faulted operations. The fault history associated with the computer’s operation was stored in a location that could easily be read without the involvement of the ‘isolated’ computer’s FSW. Hardware commands existed that could swap prime strings independent of FSW. Communications across redundant strings and hardware-assisted ‘autopsy’ capabilities enabled diagnosis of the problem and recovery of the RCE-A string to a ‘science-worthy’ state. The NAND flash data store was architected with plenty of margin, with data that spanned multiple physical devices. Designers were available during the Operations phase to evaluate diagnostic evidence and develop recovery solutions.","Lesson ID":11201}
{"Lesson(s) Learned":"The process for tracking and managing landing and recovery GSE product requirements and development decisions needs to be enhanced. There were often disconnects between various GSE lists, delivery schedules, and expected quantities. Thoroughness of NASA participation and review may have been reduced due to the informal nature of the process. Identification of quantities for required GSE and who was responsible for their care and storage was often unclear.","Lesson ID":5044}
{"Lesson(s) Learned":"Poor packaging design and an inadequate insulation scheme allows numerous places for electrical shorts. Poor processing and insufficient inspection were major contributors to the failure. In-flight temperature extremes experienced by NOAA-13, due to increased power requirements imposed by flying additional instruments, were greater than experienced by previous NOAA satellites of this series and were near qualification temperature limits.","Lesson ID":387}
{"Lesson(s) Learned":"\"Programs should periodically review hardware components to ensure that they are operating within qualification and certification limits. Where hardware exceeds those limits, testing or analysis should be performed to properly envelop the actual operating environment.\"","Lesson ID":1478}
{"Lesson(s) Learned":"The Ares I-X test flight showed how important it is to track connector mate, demate, and retest verification for ground processing of space launch vehicles. Although Ares I-X was a one-time test flight and implementation of the SCAN system would have been too much effort for one flight, future manned space flight programs would benefit from a SCAN-type system if the same launch vehicle were used for a significant number of flights.","Lesson ID":3757}
{"Lesson(s) Learned":"The Super Light Weight Tank (SLWT) has completed its design certification review, and proof tests on the first tank have been satisfactorily passed. The only remaining test to complete certification on the SLWT is the cryogenic loading test that will be run on the first production tank on the launch pad. The diligent attention that has been given to quality control, particularly to material inspection and weld integrity, has made this program successful.","Lesson ID":1048}
{"Lesson(s) Learned":"Nozzle aging experience indicates nozzles can have age related problems.","Lesson ID":466}
{"Lesson(s) Learned":"Accurate drawings are essential for ensuring the fit, form, and function of the thermal blankets on the RMS. Manufacturing from inaccurate drawings caused a shortage of thermal blankets and forced KSC Engineering to repair old blankets and have them approved by a material review board instead of using the new blankets.","Lesson ID":3656}
{"Lesson(s) Learned":"WRIs are notoriously non-linear in stiffness, and their properties and responses change with input load level. Isolator testing done at LaRC by the Project found the stiffness values quoted in the vendor data were not accurate, particularly for the load levels for which they would be used on the CMP. Compared to 2% critical damping used in normal dynamic analysis, the damping with the WRIs was found to be much higher and vary considerably, with as much as 15% damping at low frequencies (0-250 Hz) and around 8% at higher frequencies (250-2000 Hz). When the variable damping schedule and corrected stiffnesses were used in the analysis models, the model results more closely matched the system test results (CMP on isolators). The results of this testing and analysis is published in “Three-Dimensional Vibration Isolator for Suppressing High-Frequency Responses for Sage III Contamination Monitoring Package (CMP)”, Yingyong Li, et al., NAFEMS World Congress 2015; 21-24 Jun. 2015; San Diego, CA (Accession Number N160006289 on https:\/\/ntrl.ntis.gov\/NTRL\/). See the Uploaded Attachment for related presentation, “Three-Dimensional Vibration Isolator for Suppressing High-Frequency Responses for SAGE III Contamination Monitoring Package (CMP) (Updated)”, Robert Wagner and Yingyong Li, et al., an invited presentation at the 2016 NAFEMS Americas Conference “Engineering Analysis & Simulation in the Aerospace Industry” on October 4th in Montreal, QC, Canada. There is large variation in size, mechanical properties, and response characteristics of WRIs. When deciding to use WRI’s to reduce vibration response in a system, the WRI properties must be fully characterized, often requiring project-specific or load-specific testing beyond vendor published data.","Lesson ID":19101}
{"Lesson(s) Learned":"Hydrogen vent umbilical deceleration unit latch failure could result in the vent line rebounding during liftoff and striking the vehicle.","Lesson ID":187}
{"Lesson(s) Learned":"Outmoded Design of Space Shuttle General Purpose Computer (GPC) Limit Software and Hardware Upgrades","Lesson ID":1124}
{"Lesson(s) Learned":"During launch ice may be dislodged by vibroacoustic or aerodynamic forces and impact the orbiter's windows or TPS with enough force to cause damage.","Lesson ID":89}
{"Lesson(s) Learned":"Although, the likely proximate cause of the Aquarius EGSE transportation mishap was operator error by the contracted van driver operating the lift gate, the root cause was inadequate planning and coordination of the transportation task.","Lesson ID":2456}
{"Lesson(s) Learned":"Some common lessons learned deduced from the various root causes of the studied incidents are shown in the following list. If these items were properly addressed prior to the incidents, prevention may have been possible (in hindsight) or the ramifications of the incident could have been reduced. Improper configuration control and internal or external human performance shaping factors can lead to a false comfort level . Vent systems are often neglected and treated as non-hazardous even though they can capture and contain condensed hypergolic liquids (especially in low points) . Aging support hardware should be routinely inspected to reduce the risk of a failure during critical operations. Communication breakdown can escalate an incident to a level where injuries occur or hardware is damaged Communication protocols should be pre-coordinated prior to an operation Improper propulsion system and ground support system designs can destine a system for failure Every effort should be made to design out low points in GSE Unknown incompatibilities (from lack of training or research) with propellants can cause surprising failures Improper training of technicians, engineers, and safety personnel can put lives in danger Inadequate knowledge of potential electrostatic discharge hazards while working fuel operations can lead to a fire or explosion Knowledge of instrumentation error and\/or offsets are very important for system oversight Improper personal protective equipment, spill protection, and staging of fire extinguishing equipment can result in unnecessary injuries or hardware damage if an incident occurs Improper procedural oversight (along with the development of and adherence to the procedure) can be detrimental and quickly lead to an incident Improper emergency procedures can increase the risk of injuries or hardware damage Improper local cleanliness or housekeeping (for example iron oxide or rust) can result in fires or explosions A thorough hypergol system evacuation should be completed (wherever a vacuum is tolerable by the system) prior to the removal or disconnection of any hypergolic propellant fittings A pulse purge using an inert gas has proven to be inadequate for residual propellant removal Advance warning of an incident appears approximately 50% of the time (according to the data presented); therefore, personnel supporting a hypergol operation should be cognizant of any system fluctuations and be prepared to execute safing procedures if the need arises A heightened amount of situational awareness of technicians and engineers working operations can reduce the risk of an incident and decrease the possibility of injuries or damage if an incident does occur After the occurrence of an incident (or if an advance warning is observed), the system should immediately be placed into a stable configuration; following this, the procedure should be stopped to assess the problem and its possible ramifications","Lesson ID":2196}
{"Lesson(s) Learned":"Clean room certified adhesive tape 5413 looks just the same as clean room certified adhesive tape 1205, but 5413 contains a silicone-based adhesive that is not compatible with vacuum work. 1205 has an acrylic adhesive that can be baked to reduce outgassing.","Lesson ID":536}
{"Lesson(s) Learned":"The TSS-1R Mission Failure Investigation Board made several observations in the course of the investigation. Among these are that: the tether failure is not indicative of any fundamental problem in using electrodynamic tethers; there was a significant amount of scientific data secured from the flight, before the tether separated; the science, engineering and support teams were highly competent, motivated, and committed to the experiment; electrostatic charge build-up could be an issue in the future; the documentation provided by the project to the Board was appropriate; the tether configuration was affected by the winding loads on the reel; the load paths of the composite tether are complex; closed areas with a favorable pressure-distance combination (Paschen's Law) can cause arcing if not vented. The TSS-1R Mission Failure Investigation Board finally observed that the long time span between the fabrication of the hardware and the flight missions increased the exposure of the hardware to contamination and damage.","Lesson ID":566}
{"Lesson(s) Learned":"If the guidelines recommended are not followed, greater numbers of fastener types, sizes, materials, and finishes may be specified or procured resulting in excessive cost. Mission performance may be also degraded due to incompatibility of materials and finishes, or due to substandard hardware that lacks sufficient screening and testing.","Lesson ID":675}
{"Lesson(s) Learned":"The problem of communicating design details and changes across interfaces--mechanical, electrical, and informational--is a pervasive common thread across JPL projects and throughout industry. Assignment of full responsibility for interface control coordination to a single engineer, in conjunction with weekly Project Engineering Team reviews, results in an acceptable and cost effective engineering change control process. Mechanical Interface Control Drawings (MICDs) at all levels require periodic verification of accuracy and compatability, especially prior to any hardware fabrication.","Lesson ID":569}
{"Lesson(s) Learned":"Manual methods for management of software requirements are ineffective and inefficient, contributing to excessive costs as well as schedule delays. Aspects of the management of software requirements include the elicitation\/specification, analysis, development, tracking, and changing of software requirements used during the implementation and sustaining phases of the software life cycle. Management and traceability of software requirements are critical to the success of producing reliable, high-quality, and safe software products that meet end-users requirements and needs in a cost-effective and timely fashion. Cost and schedule impacts that result from incomplete, incorrect, or changing software requirements increase the later they occur in the software life cycle. Current software technology, processes, and tools provide innovative automated methods to facilitate optimum management of software requirements (e.g., IBM Rational DOORS, IBM Rational RequisitePro, Cradle requirements management software). Additionally, a collaborative relationship between the customer using the software and the developer providing the software is paramount to the success of the software project. More specifically, the users\/customers must effectively define and accurately communicate their requirements to the developer. For example, the user’s defined requirements should be clearly stated and unambiguous, concise, complete, autonomous, able to be implemented, and testable.","Lesson ID":3377}
{"Lesson(s) Learned":"EED I&T tests can appear to be successful while concurrently damaging the fusing element so that subsequent EED firing is impossible. If fusing resistor damage is not found, the result could be a launch with one or more dead EED channels.","Lesson ID":448}
{"Lesson(s) Learned":"Failure of ECLSS servicing console regulator could introduce gaseous nitrogen into astronaut's breathing supply.","Lesson ID":27}
{"Lesson(s) Learned":"Even in normally dry, temperate environments, humidity\/temperature conditions at flight altitude can be such as to result in icing of the Pitot-static probe if a heater is not provided.","Lesson ID":359}
{"Lesson(s) Learned":"It is hard to get complete attendance at the weekly construction meetings.","Lesson ID":749}
{"Lesson(s) Learned":"The criticality of understanding unique PTFE properties that derive from subtle resin differences can not be underestimated. Additional tests must be performed to distinguish between candidate resins, and to ensure that required properties not covered by available specifications are met. Materials selection criteria must be constantly re-evaluated to ensure that all key properties are addressed in new applications. Proper resin selection also was found to partially compensate for an unoptimized seal design. Given the nature of the hot-forming assembly process used, the material with the highest resistance to compressive fracturing should have been chosen initially. Switching from a free-flowing extrusion grade to a nonfree-flowing compression-molding grade of PTFE allowed fabrication of viable seals suitable for valve level testing.","Lesson ID":1039}
{"Lesson(s) Learned":"The torque limiters of the External Tank door actuators were redesigned in the early 1990s because of unacceptable degradation of the disk friction surfaces. The new design was a multidisk ball-ramp setup. When the torque reached a certain value, the ball-ramp design reduced the compression load on the disk stack and allowed the disks to rotate relative to each other (slip). The disks in this particular actuator were made of steel and Vespel. After several years of service with the new torque limiter design, most of the actuators exhibited reduced torque output. Investigation determined that the torque limiter degradation was due to grease contamination of the disk surfaces. Inspection confirmed that excess grease was applied to some of the torque limiter components (bearings) during assembly and eventually migrated to the disk surfaces. However, even after the actuators were refurbished, excess grease was removed, and the grease was cleaned from the disks, the actuators often continued to exhibit torque degradation and show evidence of grease contamination of the disks. Another problem was the amount of effort required to set the torque limiter to slip in the required range when the actuator was being serviced. The value at which the torque limiter slips depends somewhat on the temperature, and the actuator is required to operate with a specified torque output through a large temperature range (over 300 °F). Several rounds of adjustments were needed, each followed by days of testing. In addition, there was degradation of the motor clutch\/brake assemblies in these actuators. Each actuator has two AC motors, each of which interfaces with the gear box differential through a clutch\/brake assembly. For redundancy, the actuator will operate on only one motor. When a motor is not operating, the clutch\/brake assembly is in the brake mode. A friction disk is spring-loaded against a stator, which locks the input to the differential and disconnects it from the motor. This is necessary so that during single-motor operation, the nonoperating motor input is not back-driven through the differential. When the motor starts up, the assembly switches to clutch mode. A solenoid pulls the disk away from the stator, separating the brake surfaces and engaging the clutch surface of the disk to the motor output. The motor then drives the differential input through the clutch. During tests of the actuators on the vehicle, the torque output varied significantly by motor mode. Since there is a single torque limiter, the point at which it slips should be the same regardless of which motor is operating. This indicated that the clutch\/brake assembly was slipping prematurely. Disassembly and inspection confirmed that both the clutch and brake surfaces were worn. There was evidence of scoring on the interfacing surfaces and metallic debris in the assembly.","Lesson ID":2839}
{"Lesson(s) Learned":"Lifting portable purge units (PPU) has caused cracks and damage to operating components which result in damage to an orbiter system.","Lesson ID":85}
{"Lesson(s) Learned":"When tests were performed to determine why newly installed chiller coils were corroding, there were signs that the copper coils had not been cleaned properly before being coated. The coating itself was fine, but there was flaking because the coating did not stick. Because of the environmental restrictions at VAFB, the parties involved decided to ship the coils back to the coating factory in Bakersfield, CA, where they would be cleaned and coated again without being completely removed from the chiller unit. The cleaning process proved to be too acidic and was halted. The unit was sent back to the site and reinstalled until further investigation could be done on the coils. The manufacturer of the chiller units investigated its coil supplier and found that they had begun using a new supplier who used a silicone release agent that was not properly removed by the acid bath. This was the reason the coating did not adhere properly. New coils were manufactured, and the proper release agent was used. The new coils were cleaned and coated in accordance with the specifications. The original coils were removed, and the new coils installed onsite. The chiller was tested again, and to date, there are no signs of corrosion on the new coils.","Lesson ID":2356}
{"Lesson(s) Learned":"The OPF Firex deluge remote manual arming and firing valves do not conform to industry norms, allowing for misinterpretation of their configuration.","Lesson ID":49}
{"Lesson(s) Learned":"If the data product relies on inputs from two or more sensors, then you need to determine up front what absolute co-registration requirements the project is willing to fund. At a minimum, the Ground Segment should be capable of determining the co-registration by performing on-orbit operations and processing the data from the sensors. If the project has the funding, establish co-registration requirements for the space segment (i.e., the instrument) and the ground segment. Make sure you have co-registration from the beginning, it was not a requirement, but it should have been.","Lesson ID":1530}
{"Lesson(s) Learned":"Because requirements drive design and implementation, it is critical that pertinent requirements be identified in a clear and concise manner. When a prime contractor has not previously dealt with flowing requirements to subcontractors, they may not appreciate the importance of this activity. The government should exercise a higher level of oversight with new prime contractors, especially small businesses.","Lesson ID":6756}
{"Lesson(s) Learned":"1. Foam is not simple; it is not easily modeled, and predictions regarding the size, location, and trajectory of foam liberation from such a cryogenic tank are not computationally calculable. 2. Hardware that appears to be simple – a tank of propellant – can entail complications not anticipated before observance in flight 3. Flight hardware inspection reveals evidence of requirements violations that should be taken seriously regarding the potential impact to both components and elements 4. Flying on risk is common and requires other controls to mitigate hazards other than mathematical predictions and analytical models 5. Obsolescence of materials introduces potential hazards to a long-operating system that need to be thoroughly evaluated when catastrophic consequences of loss of life and loss of mission are concerned","Lesson ID":17903}
{"Lesson(s) Learned":"These design solutions, while suitable for pinned joint configurations in large segmented SRM Systems, are not universally suitable for all SRM systems. Failure to adhere to the design principles described in this practice could result in leakage of hot combustion gasses past one or more sealing surfaces or seals during start-up or operation of solid propellant rocket motors. The result could be an anomalous trajectory, premature mission termination, or loss of life.","Lesson ID":759}
{"Lesson(s) Learned":"Surface waviness at the FADS pressure port location will change the local wall static pressure, resulting in additional apparent flow angles at transonic speeds.","Lesson ID":1599}
{"Lesson(s) Learned":"Latent design errors found during system test or on-orbit are too costly to correct. The time to find and correct them is during a rigorous peer review process, utilizing experts outside of the project.","Lesson ID":1276}
{"Lesson(s) Learned":"Hazard analyses should consider critical interfaces and clearly identify any assumptions not subject to analysis.","Lesson ID":1367}
{"Lesson(s) Learned":"• Fully understand the spectral, spatial, temporal, radiometric, control, and stability requirements of the interferometer before committing to the FPA and ROIC designs. Ensure that the FPA, ROICs, and their interactions will not compromise system performance. • Measured ROIC noise is currently predicted to be the largest contributor to total system noise for the Geosynchronous Imaging Fourier Transform Spectrometer (GIFTS) sensor. Make all attempts to limit the ROIC noise to values close to the theoretically predicted limits. • ROICs are not off-the-shelf devices and additional runs may be needed to refine the designs to meet the customized FPA-to-ROIC requirements of the interferometer. Project funding and scheduling should take ROICs reworks into account.","Lesson ID":1595}
{"Lesson(s) Learned":"The NASA personnel who are involved in finding solutions for the problems of radiation in space have developed an excellent long-range plan to define approaches for crew protection.","Lesson ID":1142}
{"Lesson(s) Learned":"Determining the center of gravity of spent booster segments prior to a lift operation is very difficult, often allowing dangerous conditions to exist.","Lesson ID":92}
{"Lesson(s) Learned":"• Vendors should understand the technical aspects of their processes and the impacts those processes have on the final product. Require evidence that they are knowledgeable about their field and their own products and processes. o Assess if the vendor has done a rigorous brazing development program investigating a variety of brazing alloys, time and temperature profiles, and metallurgical cross sectioning. § A vendor needs to have the personnel, experience\/expertise, and\/or facilities required to conduct extensive development. If the facility is primarily a manufacturing facility and not a research and development facility, they may lack an awareness of the technology they use and the characteristics of the resulting product. • Actions a brazing vendor should take to ensure technical competence include: o Knowledge of the literature in their field regarding different types of furnaces and brazing alloys used to perform successful brazes o Complete audits of their current brazing processes § If needed, start with the basic audit steps that include brazing test specimens, metallurgical evaluation of the as-brazed specimens, and evaluation of the specimens subjected to thermal fatigue testing. o Brazing processes other than vacuum furnace brazing should be considered o Alternative filler metals may be more appropriate for brazing microtubes and other space-application hardware configurations • Be aware of contractual limitations that preclude or limit requirements for process development or assurance before product manufacturing o Contractually, the SBIR\/STTR process is not conducive to accommodate process development, which is considered secondary to or an unstated expectation of the task of producing an agreed-to product. § Basic development may be necessary to achieve primary product success, but a vendor may not assume or interpret a contract as requiring a demonstration or validation of their manufacturing processes prior to attempting to produce the product using their existing processes and methods. o NASA needs to be continually aware of the fact that when they buy the services of a vendor, unless clearly stated otherwise, NASA is not purchasing development, refinement, quality assurance, or validation of a fabrication process. § The expectation of a final piece of hardware in the configuration specified by the customer (NASA) is the only agreed-to deliverable unless otherwise stated. § If terms and conditions are not stated clearly up front, the vendor is not responsible for product conditions outside of the specification. These conditions may include metallurgical properties or residual stresses induced by thermal processes, process reliability and control, or collateral damage. • Many of the companies fabricating NASA technology hardware do not have the capacity or resources available to conduct the necessary research and development to validate that their processes are adequate for NASA quality requirements. o The team recommends that NASA partner with appropriate vendors to provide the required brazing process development, including using the vendor personnel and facilities for both process development and material characterization.","Lesson ID":14001}
{"Lesson(s) Learned":"Hardware that interfaces to flight hardware, critical ground support equipment (GSE), can cause inadvertent damage to the flight hardware if not properly constructed. The government should exercise a higher level of inspection for conformance to design intent when critical GSE is received at the contractor.","Lesson ID":6757}
{"Lesson(s) Learned":"The implications of an instrument design modification were not recognized by the JPL or contractor system engineers, and the follow-on (OCO-2) project repeated the predecessor project’s build and test activities without performing a critical review or validation of the requirements and design. Intensive penetration of a design by experts and reviewers is no substitute for, where possible, performing an independent check against a known standard and for verifying the design against the requirements at the system level.","Lesson ID":17001}
{"Lesson(s) Learned":"This technique is included in the Space Shuttle Ground Support Equipment General Design Requirements. Utilization of this technique can help prevent failures to other equipment and unnecessary downtime.","Lesson ID":879}
{"Lesson(s) Learned":"The first lesson learned is that equipment rooms require better markings on valves and fluid lines, as well as diagrams showing location of critical equipment, which would allow the lines to be isolated more quickly. The second lesson learned is that incident control is needed, particularly during off-hours when normal incident control personnel are not available. Access to flooded areas should be restricted until it is determined that no electrocution hazard exists. The third lesson learned is that it would be wise to do advanced planning for significant hazards or threats. Current Goddard policy is to allow a specially-trained team to respond at the time of a crisis. Unfortunately, not all crises occur during normal work hours. Even during normal working hours, this team is likely to be in the midst of dealing with the crisis as it unfolds.","Lesson ID":1192}
{"Lesson(s) Learned":"Avoidance of the material selection considerations can result in a fiber composite part or component that 1) does not satisfy design properties, 2) is unnecessarily difficult to fabricate, and 3) adds substantial program. Item 1 may lead to an expensive redesign. Item 2 can impact cost and program schedule. Item 3 can jeopardize the entire project.","Lesson ID":689}
{"Lesson(s) Learned":"Reviews of each build for the stand-alone instruments, as well as for the integrated satellite are necessary, in order to ensure proper function and interface control.","Lesson ID":1294}
{"Lesson(s) Learned":"Design analyses should include (a) Failure Modes and Effects Criticality Analysis (FMECA) and sneak circuit evaluation for potential electrical issues, and (b) Fault Tree Analysis (FTA) for potential mechanical issues. These analyses must be conducted in an integrated manner at the system level to ensure that the electrical implications of mechanical\/packaging design decisions are understood. System design planning and processes must address hardware performance during assembly and test as well as during flight (the DS2 electronic switch design was almost impossible to assemble without an anomaly). Where the use of safing devices is required, the system design and assembly\/test procedures must accommodate their use throughout assembly and test operations.","Lesson ID":626}
{"Lesson(s) Learned":"Knowledge of the 1-g physics of large bubbles in the condenser legs would have allowed the limits of ground testing to be better understood.","Lesson ID":26703}
{"Lesson(s) Learned":"Hydraulic fluid, dripped by hydraulic pumping units onto floor insulation may be ignited by hot particles propelled into the area during air-arcing.","Lesson ID":118}
{"Lesson(s) Learned":"The science of Human Spaceflight is a very non-forgiving process. In this case, a dislodged screw jammed a gear assembly thus preventing a hatch from opening during a space mission. This impacted the mission by preventing the EVAs from occurring. Something as simple as a small screw provided a major impact to the mission objectives. Attention to the details of installing the screws in the actuator gearbox and not noticing that there was no running torque provided the conditions where the screw fell out and jammed the actuator gear. Additionally, there was no simple way to screen for this failure. This hatch had successfully flown on a number of previous missions and had successfully passed the pre-flight functional check-out and closed nominally prior to launch, but then failed to operate properly during the mission. STS-80 Actuator Gear Box Assembly with embedded screw in gears STS-80 Actuator Gear Box Assembly showing missing and loose screws","Lesson ID":4417}
{"Lesson(s) Learned":"Active leveling is the safest way to lift\/mate components.","Lesson ID":4999}
{"Lesson(s) Learned":"When explosive hardware is configured outside its intended design after a test program has finished, provide procedures and policies that will return it to its original configuration, fire it as part of the test plan or send it to Explosives Ordnance Disposal (EOD). If temporary storage is required, ensure that a policy or procedure is in existence that requires the commodity to be properly marked, segregated and stored. Also, the ammo can or storage container in which it is stored has to be properly labeled. Include a First Article Review before the test starts.","Lesson ID":1582}
{"Lesson(s) Learned":"Inadvertent closure of the vent doors during environmental control system (ECS) purge of orbiter compartments will result in over-pressurization.","Lesson ID":84}
{"Lesson(s) Learned":"Delays in accomplishing failure analysis causes excessively slow turnaround times for many repairable components.","Lesson ID":221}
{"Lesson(s) Learned":"The interface between TCS blankets and their associated hardware needs to be clearly and unambiguously documented on the installation drawings so that blankets perform as designed without unintended interferences or blockages particularly related to cutouts and openings. System operators need to understand how all the pieces fit together so that each team member appreciates how their contribution affects the integrated system. FRC3 Blanket as installed at HMF prior to incident. LH FRC3 Blanket in relationship to FRCS Cavity Bulkhead PVD vent post STS-121 RH FRC3 Blanket in relationship to FRCS Cavity Bulkhead PVD vent post STS-121 Click the icon to view a brief video of this lesson","Lesson ID":2716}
{"Lesson(s) Learned":"The lessons learned from the Project's unsuccessful transition from a small informal academic type of team into a project-oriented team are: 1. Project management should be included in the proposal stage of a project's life cycle since the lack of front-end PM support increases the difficulty to introduce a project environment later. 2. Inserting a PM into a project for a \"recovery\" or \"rescue\" mission may be an unwelcome and unsuccessful venture if the project does not recognize its potential value and\/or does not identify with the incoming PM. 3. Do not expect a team to \"abandon\" their loyalty to the PI in favor of an outside PM. 4. Do not expect an academic team to buy into formal PM processes immediately. 5. Abrupt and frequent PM changes create\/increase the rift between the science\/engineering team and the management team. This also gives the appearance that Senior Management does not view or appreciate the critical role which project management plays in a project's success or that the project is not valued. 6. In addition to each project lifecycle phase, lifecycle transitions also require management and planning, especially those that deal with major changes in control\/authority, business practices, and culture.","Lesson ID":1345}
{"Lesson(s) Learned":"Cryogenics are capable of displacing air, resulting in unbreathable, Oxygen-deficient atmospheres.","Lesson ID":550}
{"Lesson(s) Learned":"Telemetry feedthrough from the uplink and saturation of signal-to-noise indicators may cause apparent non-critical downlink signal degradation during initial acquisition of the downlink signal. As the spacecraft moves farther from Earth, the reported signal levels tend to move closer to predicted values.","Lesson ID":1531}
{"Lesson(s) Learned":"During ground testing, a SUBSA Ground Unit Thermal Chamber temperature of about 820 C with qualification Sample Ampoule assemblies (SUBSA-GD1, SUBSA-Q3, and SUBSA-Q4) was sufficient to melt all of the sample charge (approx. 37mm) + about 4mm of the sample's seed. This met the SUBSA Principal Investigator's desire to melt about 2mm into the seed. However, during SUBSA's on-orbit experiment, the flight heater unit temperature of 820 C did not melt into the seed. To melt further into the seed, SUBSA tried to issue a setpoint change command to increase the Thermal Chamber's temperature. The Eurotherm 2408 Controller that controls the Thermal Chamber's temperature would not accept any setpoint change commands above 825 C. Therefore, the SUBSA Thermal Chamber hot zone temperature did not reach the commanded setpoint that is required to achieve the desired science result of melting 2mm into the sample material seed. Overall, the problems experienced with the SUBSA flight hardware and flight software can be directly attributed to programmatic budget and schedule constraints which resulted in inadequate run-time using flight software with flight hardware end items as well as last minute software loads and\/or changes to flight software after shipment to KSC for pre-launch processing.","Lesson ID":1319}
{"Lesson(s) Learned":"Failure to adhere to proven battery selection practices could cause shortened mission life, premature cessation of component or experiment operation, mission failure, and in extreme cases, loss of mission or life. All phases of battery use, from battery selection to installation in the launch vehicle or orbiting spacecraft, must adhere to the proven design and safe battery practice.","Lesson ID":714}
{"Lesson(s) Learned":"Do not work on a pressurized pipeline. Reduce pipeline pressure before attempting to locate leak in the pipeline. Personal protective equipment (PPE) does save lives. The accident could have caused more serious injury had the worker not been wearing PPE. Pay extra attention to construction safety procedures during the last working day before a weekend or holiday. Construction workers tend to rush the last working before a weekend or holiday. Preparatory inspection is very important. Make sure specified materials are being used. Silver solder was specified for the 3\" copper underground compressed air line. The Contractor used 95-5 solder instead. Silver solder grarantees a much higher strength of the joint.","Lesson ID":1096}
{"Lesson(s) Learned":"Transfer of heat from brakes to the MLG tires after maximum braking could increase tire pressure and result in rupture\/blowout. Excessive tire wear due to maximum braking or FOD may reduce strength of tire structure and cause rise in tire pressure, resulting in rupture. Hydraulic fluid leakage in the hot wheel well area may ignite and cause orbiter damage and\/or personnel injury.","Lesson ID":128}
{"Lesson(s) Learned":"Vinyl tape may act as a lubricant, preventing the secure clamping of an object to a workstation, possibly resulting in damage to the object.","Lesson ID":43}
{"Lesson(s) Learned":"Failure to implement a Safety First type of philosophy amongst employees may lead to safety incidents. Without proper contract surveillance, incompliance with critical contractual and safety regulations (Occupational Safety and Health Act, OSHA) may not be identified and lead to safety incidents. Failure to thoroughly assess the hazards of a job\/task prior to performing the task may lead to safety incidents. Failure to clearly identify alternative means of performing work on energized systems results in hazardous work that is avoidable. Failure to verify proper training and apply thorough supervision may lead to safety incidents. Failure of all parties to clearly communicate the impacts of an outage will result in the misconception that the outage cannot be scheduled and planned appropriately and result in pressures to perform work on energized systems that is avoidable.","Lesson ID":2696}
{"Lesson(s) Learned":"An EMI filter may not perform as well when it is not matched with the power converter it is meant to operate with.","Lesson ID":543}
{"Lesson(s) Learned":"Mishaps involving NASA assets are typically classified only by the actual dollar losses or injury severity caused by the event.","Lesson ID":1237}
{"Lesson(s) Learned":"Use of a proven design system in a new application does not ensure success and does not relieve the design activity from carrying out (independent) technical peer reviews and comprehensive assurance processes and validation.","Lesson ID":595}
{"Lesson(s) Learned":"Use of models must be refined as design matures to ensure fidelity of analyses of the final design","Lesson ID":1223}
{"Lesson(s) Learned":"The location of check valve should have been designed to provide leak testing of the supply hose using the ground pumping unit. Eventually (per MCR 19092) the check valve was relocated to the \"other\" end of the supply hose at the main pump outlet.","Lesson ID":3221}
{"Lesson(s) Learned":"Match COTS tools to project requirements. Deciding to use a COTS product as the basis of system software design is potentially risky, but the potential benefits include quicker delivery, less cost, and more reliability in the final product. The following lessons were learned in the definition phase of the SAFS\/CSAFS development. Use COTS products and re-use previously developed internal products. Create a prioritized list of desired COTS features. Talk with local experts having experience in similar areas. Conduct frequent peer and design reviews. Obtain demonstration versions of COTS products. Obtain customer references from vendors. Select a product appropriately sized for your application. Choose a product closely aligned with your project's requirements. Select a vendor whose size will permit a working relationship. Use vendor tutorials, documentation, and vendor contacts during COTS evaluation period. Test and prototype COTS products in the lab. The prototyping and test phase of the COTS evaluation allows problems to be identified as the system design to matures. These problems can be mitigated (often with the help and cooperation of the COTS vendor) well before the field-testing phase at which time it may be too costly or impossible to retrofit a solution. The following lessons were learned in the prototyping and test phase of the SAFS\/CSAFS development. Prototype your systems hardware and software in a lab setting as similar to the field environment as possible; simulate how the product will work on various customer platforms; model the field operations; develop in stages with ongoing integration and testing Pass pertinent information on to your customers Accommodate your customers, where possible, by building in alternative options Don't approve all requests for additional options by customers or new projects that come on line. Select the best COTS components for product performance even if they are from multiple vendors. Consider the expansion capability of any COTS product Determine if the vendors support is adequate for your requirements Install, operate and maintain the COTS field and lab components. The following lessons were learned in the installation and operation phase of the SAFS\/CSAFS development. Personally perform on-site installations whenever possible. Have support\/maintenance contracts for hardware and software through development, deployment, and first year of operation Create visual representations of system interactions where possible. Obtain feedback from end users Maintain the prototype system after deployment. Select COTS products with the ability to do internal logging","Lesson ID":1346}
{"Lesson(s) Learned":"When flight system testing is begun or resumed on projects under great time pressure, the test operator may be unaware of changes to the testbed configuration, resulting in delays to the test schedule and an increased risk of flight hardware damage.","Lesson ID":1520}
{"Lesson(s) Learned":"Improper torquing of the Waste Collection System (WCS) vent valve knob retention screw caused the knob to work its way off the shaft.","Lesson ID":454}
{"Lesson(s) Learned":"In many situations, new circuit designs may not adequately incorporate all the relevant past history from a wide data base of previous experience, and hence will not achieve the best possible performance and reliability.","Lesson ID":680}
{"Lesson(s) Learned":"Incompatibilities between SKYLAB system design and cleanliness levels caused particulate contamination, resulting in repeated water pump failures.","Lesson ID":244}
{"Lesson(s) Learned":"Voltage potentials on surfaces can result in uncontrolled electrostatic discharge (ESD). The results of ESD can cause ignition of solid propellants, explosives and flammable\/combustible materials, cause damage to or inadvertent actuation of electronic devices\/systems, and more familiar shock experienced by personnel. Shock to personnel could cause (depending on the magnitude of the charge and the health of the individual) involuntary muscle reaction which can result in injury or flight hardware\/equipment damage.","Lesson ID":685}
{"Lesson(s) Learned":"Greater compression of the primary \"O\" ring is required to achieve reliable operation of a case-to-nozzle joint.","Lesson ID":951}
{"Lesson(s) Learned":"All systems need to be properly maintained and inspected to make sure that everything functions properly so that mishaps such as this can be prevented.","Lesson ID":5936}
{"Lesson(s) Learned":"Accurate measurement of the grip length is critical to blind installation of fasteners. Many conditions, such as tolerance stack-up, washer configuration, and countersinks, can lead to a false or inaccurate determination of proper grip length.","Lesson ID":3260}
{"Lesson(s) Learned":"Porous materials, such as wood, when in contact with solid propellants may absorb\/acquire the hazardous properties exhibited by the solid propellant.","Lesson ID":344}
{"Lesson(s) Learned":"Flight Operations supervision should continuously monitor qualifications, currency, and assignment of aircrew in order to ensure before release of each flight operation that it can be completed safely. All local Flight Operations guidance should be reviewed annually to ensure that it complies with and properly implements applicable law, regulation, and headquarters guidance. Best practices of similar industry and other government activities should also be evaluated periodically for adoption as appropriate. The Aviation Safety program should continuously review flight operations to ensure that hazardous conditions are identified as soon as they appear and are promptly corrected. Initial and periodic training should be provided to all personnel who may in the course of their official duties be involved in mishap response or mishap investigation, including aircrew and public relations personnel.","Lesson ID":1377}
{"Lesson(s) Learned":"Pyro electronics design must appropriately consider transient effects known to occur upon powering of the pyro electronics. Pyro inhibits should be considered for mission critical events, particularly if all pyro functions can be simultaneously armed and enabled. Activation should require two separate and independent actions-one to override the inhibit (referred to as quotARMquot or quotSAFE\/ENABLE-ENABLEquot), and another to fire the pyros. Detailed, independent technical peer reviews are essential to assess the integrity of the system design, including an evaluation of the system and mission consequences of the detailed design and implementation: Technical peer reviews for all design elements should be encouraged by project management. Peer reviews should consider the capability and limitations of the support equipment to be used for testing the flight design. Peer review board members should consistently penetrate the system and subsystem functional design and implementation to expose risk areas, particularly where multiple or complex interfaces exist. Ensure adequate fidelity of test and simulation equipment to detect subtle transient events where appropriate. Perform electronics power turn-on characterization tests, particularly for applications involving irreversible events, that include testing for anomalous behavior. Testing of power turn-off characteristics may also be important in some applications.","Lesson ID":634}
{"Lesson(s) Learned":"The take down team should have waited for supervisor's assistance as instructed prior to disassembling the scaffolding. Pointing out the high hazard of this task should have been stressed at the start of this undertaking. Do not remove the safety straps until the out rigger section has been removed. Explain to workers that the scaffolding could topple over if the straps are removed prematurely.","Lesson ID":1318}
{"Lesson(s) Learned":"Modification of IRT fan blades can result in more accurate data or higher test section airspeeds.","Lesson ID":477}
{"Lesson(s) Learned":"Although the Dawn IPS design concept was fundamentally sound and flight worthy (Reference (2), p. 141), JPL experienced significant cost escalation (Figures 3 and 4) and technical difficulties in implementing the design. .................... Figure 3. Cost growth by major Dawn IPS activity. Figure 4. Cumulative Dawn IPS workforce.","Lesson ID":3396}
{"Lesson(s) Learned":"All spacecraft related launch operation procedures should be demonstrated multiple times prior to shipment.","Lesson ID":609}
{"Lesson(s) Learned":"Failure to detect cracks, flaws, and voids in aerospace materials through the proper use of ultrasonic testing and other approved nondestructive evaluation methods could result in the use of weakened structures, unbonded propellants and insulation layers, and potential pressure vessel failures or burnthroughs due to increased propellant surface area, resulting in potential mission failure.","Lesson ID":765}
{"Lesson(s) Learned":"Electrostatic Discharge (ESD) wrist straps can shed conductive metallic fibers into electronic hardware.","Lesson ID":301}
{"Lesson(s) Learned":"In bi-propellant systems there is a risk that high oxidizer vapor content may create vapor FORP at the fuel check valve, resulting in a sticking propulsion check valve during an in-flight maneuver and anomalous engine operation, which could lead to loss of mission. The current method used by Juno and other spaceflight missions to limit propulsion system contact with propellant vapor to benign concentrations relies largely on quad-redundant check valves, and pyrolitic isolation valves in the oxidizer side. The Juno anomaly exemplifies the risk that high oxidizer vapor content may cause a sticking check valve during a maneuver that will result in the engine operating well outside of the qualified mixture ratio; this may lead to loss of the mission. However, the Juno mission is on track to achieve its mission objectives due largely to the availability of sufficient downlinked propulsion system health data to accurately characterize the system state.","Lesson ID":28105}
{"Lesson(s) Learned":"The Block II engine will be certified for operation at 109% power level only for abort situations. Accordingly, the test program provides only limited cumulative test time at this thrust level.","Lesson ID":1006}
{"Lesson(s) Learned":"When external areas of spacecraft flight hardware are not designed with regard for assembly and test operations, protective guards and other procedural safeguards can be inadequate to prevent damage to delicate hardware.","Lesson ID":355}
{"Lesson(s) Learned":"Normal purge air applied to the orbiter compartment while the vent doors are closed may cause major orbiter damage.","Lesson ID":125}
{"Lesson(s) Learned":"It is preferable to use a numbering system that has enough capacity to evolve with the need for additional body points as the system is utilized and operated. This system needs to be carefully described early in a program life cycle. Users of the system must exercise discipline to “stick with” this system, even when the expedient path might tempt them to do otherwise.","Lesson ID":6357}
{"Lesson(s) Learned":"The most likely cause of the incomplete deployment of the VRA was inadequate service loops in the wire harness across the hinge of the antenna boom mechanism. Similarly, the most likely cause of the incomplete deployment of the -Y deployable sunshade was an inadequate service loop in the wire harness between the Instrument Mounting Platform (IMP) and the potentiometer in the deployable sunshade hinge assembly.","Lesson ID":909}
{"Lesson(s) Learned":"Further analysis of NASA's planned agency-wide computer security system is needed to understand its vulnerabilities and the programs and activities to which the system should be applicable.","Lesson ID":1150}
{"Lesson(s) Learned":"Shocks\/vibrations induced into a magnetic liquid level gauge may affect the position of individual flag indicators and lead to erroneous readings. Fluid contamination may cause a restriction of the float assembly movement within the chamber, leading to an inaccurate reading. Fluid in the LT having a SG which is less than the float assembly is weighted for, indicates a fluid level lower than actual, and may lead to a tank overfill.","Lesson ID":120}
{"Lesson(s) Learned":"The primary cause of the mishap was failure to follow the procedural instructions in PR number PV-6-140247, in which: (1) facility water technicians added a flow test on the Zone 3 system after valve diaphragm repair, and (2) in not fully closing or in improperly reopening the manual riser isolation valve, water was allowed to flow into Zone 3 of the OPF Bay 2 water deluge system. Contributing causes included the following: The OPF GSE technicians, who are members of the \"Contingency Team,\" had not been adequately trained in the operation of the OPF water deluge system. This led to the OPF GSE \"Contingency Team\" technicians activating Zones 1, 2, 3, 4, and 5 of the Bay 2 deluge system, while thinking they were turning the system off. A thorough pre-task briefing (PTB) was not held for the water deluge system valve repair task, which could have prevented deviation from the repair procedure by the facility water technicians. The labeling on the remote manual arming and firing valve activation station of the OPF water deluge system was misinterpreted. This contributed to the OPF GSE technicians activating Zones 1, 2, 3, 4, and 5 of the Bay 2 deluge system when they believed they were turning the system off. The remote manual arming and firing valves are in the \"on\" position when perpendicular to the water lines, which is not the industry norm for hydraulic systems. This contributed to the OPF GSE technicians believing they were closing the valves by positioning them perpendicular to the water line when, in fact, they were opening the valves. This human factor problem was not addressed in the System Assurance Analysis for the Water System at the OPF, SAA09FY09-007, Revision B, dated July 1987. The manual arming and firing valves behind the OPF are easily accessed by simply opening the individual valve box doors, which destroys the paper integrity seals. Essentially, there was no physical barrier to the valves. Even though redundancy exists for the Viking valves in the deluge system, these valves are open when no dome pressure is applied. Failures which remove dome pressure could result in the flow of water. There are significant configuration differences between the OPF Bay 1 and 2 water deluge systems. The OPF Bay 1 configuration does not include the manual riser isolation valve. Engineering Order E084-79KO5423, which installs the manual riser isolation valve for both bay configurations, has not yet been accomplished for Bay 1. This should be implemented for Bay 1 after OV-103 rollout for STS-33 and prior to another Orbiter occupying Bay 1. There are only 6 boxes for the manual arming and firing valves in the Bay 1 configuration, with the arming and firing valves for a particular zone in the same box. The Bay 2 configuration has 12 boxes, one for each valve. Signs on the boxes are not uniform between OPF Bays 1 and 2. The NASA Test Director (NTD) evacuated OPF Bay 2 via a public address announcement. He could not use the area warning system because OPF Bay 1 would have also been evacuated, which was not required. As a result of the inadvertent activation of the firex deluge system, Orbiter GSE was damaged (i.e., the Mechanical Control Interface Unit for the Remote Manipulating Arm and the Cargo Verification Unit). No redundancy is available for the Mechanical Control Interface Unit. The OPF Bay 2 evacuation during this incident was in accordance with established procedures. Security control of Bay 2 was properly maintained. All personnel and emergency service actions were professional and properly carried out.","Lesson ID":1183}
{"Lesson(s) Learned":"Poor mechanical design and the use of unapproved workmanship practices in the manufacture of electronic systems, where components may be subjected to vibration-induced movement, will result in work fatigue of the leads to the point of fracture and separation.","Lesson ID":1202}
{"Lesson(s) Learned":"When preparing test procedures, protect flight hardware by specifying all voltage limitations. Test procedures must be approved by the cognizant subsystem engineer. This approval indicates completion of a careful, detailed review both for functionality and to preclude injury to personnel or damage to the hardware.","Lesson ID":1300}
{"Lesson(s) Learned":"Premature depletion of one propellant can occur in bipropellant systems if engine and component acceptance test data are not properly considered when determining the flight propellant loads. The level of dissolved gases in the oxidizer should also be considered. For nitrogen tetroxide\/hydrazine engines similar to those intended for use in future planetary missions, oxidizer depletion may be difficult to detect from accelerometer readings because of (a) the residual thrust of the hydrazine operating in monopropellant mode and (b) random slugs of oxidizer which may continue to be ingested by the engine for tens of seconds after the first bubbles are ingested.","Lesson ID":572}
{"Lesson(s) Learned":"The Board has concluded that there were no anomalies on-board the SOHO spacecraft but that a number of ground errors led to the major loss of attitude experienced by the spacecraft. The Board finds that the loss of the SOHO spacecraft was a direct result of operational errors, a failure to adequately monitor spacecraft status, and an erroneous decision which disabled part of the on-board autonomous failure detection. Further, following the occurrence of the emergency situation, the Board finds that insufficient time was taken by the operations team to fully assess the spacecraft status prior to initiating recovery operations. The Board discovered that a number of factors contributed to the circumstances that allowed the direct causes to occur. FACTORS DIRECTLY CONTRIBUTING TO THE LOSS The Board has concluded that there were no anomalies on-board the SOHO spacecraft but that a number of ground errors led to the major loss of attitude experienced by the spacecraft. The first two errors were contained in predefined command sequences executed from the Ground System, while the last error was a decision to send a command to the spacecraft in response to unexpected telemetry. The sequence of these errors and their relationship to the triggered-ESRs are graphically depicted in Diagram 1. [D] Diagram 1. Failure Event Tree - Top Level (Click image for a larger view) This series of events was preceded by a routine calibration of the spacecraft's three roll gyros. As stated earlier, the gyros are not required during most of the mission. They are used for thruster-based activities such as momentum management, ISA, and ESR. Since the gyro calibration in the compressed timeline is immediately followed by the execution of momentum management, the previously employed procedure to despin the gyros at the end of the gyro calibration and to re-enable the on-board software gyro control function was not required. Following gyro calibration, Gyro A was specifically deactivated (despun) in order to conserve its life, while Gyros B and C remained fully active. Due to an omission in the modified predefined command sequence actually used, the onboard software function that activates the gyro needed by ESR was not enabled. This omission resulted in the removal of the functionality of the normal safe mode and ultimately caused the catastrophic sequence of events. Following the momentum management maneuver, Gyro B, which is used for fault detection, was erroneously left in its high gain setting, resulting in an indicated roll rate of 20 times greater than actual. The incorrect gain was due to an error in another predefined command sequence; this error resulted in an on-board fault detection output that triggered an ESR. This ESR, the 5th since launch, occurred at 7:16 PM EDT (23:16 UT), June 24, 1998. During ESR-5, the control Gyro A was not active because of the first error referenced above; however, there is no evidence or belief that any anomalous spacecraft behavior had occurred. As per design, the ESR event resulted in a reconfiguration of the gyros. Gyro A replaced Gyro C as the roll gyro used for the ESR thruster-based control mode, while Gyro B remained configured as the fault detection gyro. The error in Gyro B's gain was discovered and corrected, but the Gyro A despun status was not identified. After transitioning to the ISA mode as part of the normal ESR recovery sequence, the attitude control system began integrating the gyro drift rate bias associated with the still despun Gyro A. After 15 minutes, this resulted in roll thruster firings intended to null the apparent (but non-existent) roll attitude error. In less than one minute, the roll rate was sufficiently high to trigger the Gyro B based fault detection once again, resulting in ESR-6 at 10:35 PM EDT (02:35 UT), June 24, 1998. Although the spacecraft remained Sun-pointing within nominal limits and was therefore in a power-positive and thermally-safe attitude, the state of the spacecraft was precarious at this point in time. It had an anomalous roll rate and was depending on a deactivated gyro for roll control in both ESR and ISA modes. The personnel on the ground were not aware of either of these facts at that time. Gyro C was correctly configured to the ACU since the reconfiguration at ESR-5. Gyro B was active and on-line for fault detection, and it was correctly measuring the anomalous roll rate. A rapid decision was made that Gyro B was faulty because its output disagreed with the rate indicated by Gyro A. This decision led to the commanding off of Gyro B. During ESR-6 recovery, Ground Operations commanded the spacecraft to ISA mode. In ISA, the attitude control system resumed firing roll thrusters in an attempt to null the attitude error associated with the electrical rate bias term of the despun Gyro A. Gyro B and the associated fault detection were now inactive. The increasing roll rate eventually resulted in pitch and yaw Sun-pointing errors that exceeded a prescribed limit of five degrees, resulting in ESR-7 at 12:38 AM EDT (04:38 UT), June 25, 1998. Due to the gyroscopic cross-coupling torques caused by pitch and yaw thruster firings, and the absence of true roll rate indications, the ESR controller was no longer stable, and the spacecraft attitude diverged. The incorrect diagnosis of a Gyro B fault and the subsequent ground response to this diagnosis ultimately resulted in loss of attitude control, subsequent loss of telemetry, and loss of power and thermal control. Loss of telemetry occurred at 12:43:56 AM EDT (04:43:56 UT), June 25, 1998. It can not be determined whether this loss was a consequence of insufficient power or a loss of communication link caused by spacecraft attitude. At any time during the over five hour emergency situation, the verification of the spinning status of Gyro A would have precluded the mishap. For further information, a more detailed timeline summarizing the sequence of events leading up to the mishap is provided in Appendix C. A detailed fault tree analysis supporting the above scenario and the Board's conclusions has been performed by MMS and is on file. FACTORS INDIRECTLY CONTRIBUTING TO THE FAILURE: Ground Procedures (failure to control change; failure to perform risk analysis of a modified procedure set; Failure to comunicate change). Procedure Implementation (failure to properly respect autonomous Safe Mode triggers; Failure to follow the operations script; failure to evaluate primary and ancillary data; failure to question telemetry discrepancies) Management Structure and Process (Failure to recognize risk caused by operations team overload; failure to recognize shortcomings in implementation of ESA\/NASA agreements; emphasis on science return at expense of spacecraft safety; Over-reliance of flight operations teams on ESA and MMS representatives; dilution of observatory engineering support) Ground Systems (Failure to resolve a critical deficiency report in a timely manner; failure to validate the planned sequence of events in advance)","Lesson ID":664}
{"Lesson(s) Learned":"Torque is not a sufficient measure to assure that joints are assembled with the proper preload.","Lesson ID":500}
{"Lesson(s) Learned":"Loss of access platform control while raising\/lowering from service position may cause platform to fall on orbiter, resulting in major damage.","Lesson ID":29}
{"Lesson(s) Learned":"Testing sealing surface diameters revealed diameter growth after hydroproof, which introduced unrecognized error in o-ring squeeze calculations.","Lesson ID":224}
{"Lesson(s) Learned":"With the actuator coupling component left out, the actuator movement did not translate into actual Chamber Coolant Valve movement. This resulted in additional fuel flow to the MCC and Nozzle coolant circuit and reduced fuel flow to the preburners. The increased MCC coolant flow resulted in an increased LPFP turbine flow which increased its speed and its discharge pressure which in turn exceeded the LPFP discharge pressure sensor qualification limit and resulted in an MCF. The lack of sufficient fuel to the preburners caused the high turbine discharge temperatures which approached the redlines. The shutdown due to the MCF occurred via the standard hydraulic sequence and it was a safe shutdown. For additional lessons learned please also see the findings listed under the \"recommendation\" section below.","Lesson ID":1340}
{"Lesson(s) Learned":"Not having high fidelity hardware simulations and procedures to train the crew will result in deficient human factors and in-operable equipment on-orbit. On-orbit is not a good time to expose the crew to a system for the first time.","Lesson ID":1613}
{"Lesson(s) Learned":"Unprotected steel pipes in below ground trenches, when under pressure, are subject to catastrophic failure due to corrosion.","Lesson ID":241}
{"Lesson(s) Learned":"See attached PDF.","Lesson ID":26803}
{"Lesson(s) Learned":"For mechanical ground support equipment (MGSE), never assume that visual inspections alone will assure both flight equipment and personnel safety. Additional Key Words: Nondestructive Inspection, NDI, Crane, Lift Procedure, Quality Assurance, Test Procedures, Mechanical Integration, System Integration and Test, System Safety, Industrial Safety","Lesson ID":914}
{"Lesson(s) Learned":"Understand the physical characteristics of any chemical mixture and implement appropriate safety measures to preclude undesirable events.","Lesson ID":945}
{"Lesson(s) Learned":"The design requirements for the SLWT include operating with a maximum Space Shuttle Main Engine (SSME) power of only 106%, even at abort conditions. The Space Shuttle program has approved a baseline plan to examine the possibility of certifying the Space Shuttle for intact aborts at a 109% SSME power setting.","Lesson ID":1078}
{"Lesson(s) Learned":"Orbit determination complexity is increased significantly when translational accelerations from the attitude control system must be accounted for.","Lesson ID":424}
{"Lesson(s) Learned":"Blow-by from pyrovalves can interact violently with propellants in propulsion systems.","Lesson ID":591}
{"Lesson(s) Learned":"Performing data sanitation and verification can be done many ways. Using the DBAN software directly has several issues and requires workarounds. The DBAN.iso image would not run without errors. Searching forums online located several workarounds. We received a 'No drives found' message which required us to edit the script called Main, search for SD_FOUND and modify the \/dev section to say \/dev\/cciss. Then, modify the sd[a-z] to say c0d[0-9]. At this point, the Main script would run on some servers. Some servers would fail with the message \/dev\/cciss\/c0d0 (process crash). We researched several workarounds and found that the best solution was to load the shareware software Parted Magic before running DBAN. This combination ran without problems and the disks were validated to have been sanitized.","Lesson ID":7016}
{"Lesson(s) Learned":"Improper jumper procedures during testing cause shorts or cross connection of live 120 volt and 28 volt electrical lines, damaging orbiter interfaces.","Lesson ID":87}
{"Lesson(s) Learned":"On Saturday, March 31, the mid-body mechanical supervisor and the lead mechanical technician both had the day off. Supervision was delegated to the lead electrical technician for that shift. He was not familiar with the work to be accomplished or with the capabilities and experience levels of the individuals assigned from the mechanical group. Two individuals were assigned to a task they had not previously performed or observed. The quality inspector was a check and balance that might have caught the error had he been assigned based on his experience with the task or his knowledge of the system. Quality inspectors are not given inspection work based upon their knowledge or previous inspection assignments. They respond to a call-board that lists tasks calling for an inspector; consequently, an inspector appears in a somewhat indiscriminate fashion to perform the inspection task. On second shift, Saturday, March 31, three people unfamiliar with the task came together on platform 4 west to perform and verify Operations and Maintenance Instruction (OMI) V1093 Post Operations Instruction #3. The lead mechanical technician from first shift stayed over to take the assigned technician to platform 4 west to review the task. He failed to mention that the purge vent port should not be capped after removal of the flex hose. There was no precautionary note in the OMI addressing the need to keep the purge vent port clear and open and no placard on the Orbiter. One of the significant shop practices stressed to all technicians working around the Orbiter is to cap disconnected lines or openings to avoid contamination. Personnel are therefore naturally conditioned to cap lines and openings. The fuel cell had to be vented to ambient pressure prior to its removal. The first attempt to vent the fuel cell by a fuel cell system engineer occurred on Wednesday, April 4, at approximately 2 a.m. EDT. The fuel cell was not damaged at this point because the 02 reactant valve did not close. The fact that there was no H2 flow was observed but no Interim Problem Report (IPR) was initiated. A disconnected ground wire from the 02 reactant valve prevented the valve from closing and consequently protected the fuel cell from any damage. A walkdown was not accomplished by engineering. Had such a procedure been implemented, the damage might have been avoided as the fuel cell system engineer might have been alerted to the disconnected ground wire and the capped purge vent port. One thread that runs through the series of events leading up to the mishap is the lack of system training for technicians and quality inspectors. Technicians and quality inspectors are trained and certified in their basic skills, i.e, lockwiring, torquing, etc.; however, they are given no Orbiter systems training. Another factor that contributed to this mishap is the lack of communication between engineering, technicians, and quality. All OMI's are reviewed and approved in detail by several engineering organizations. Some portions of these approved OMI's are then handed over to shop personnel (technicians) to be performed without requiring additional engineering involvement. This same situation exists with the quality inspector who must approve the technicians' work. The personnel are highly motivated and want very much to do a good job. It is essential that they be given the knowledge they need to do that job. The importance of keeping the purge vent port clear and open was not communicated by anyone in the process. The capping of the Orbiter H2 purge vent port during the performance of OMI V1093 Post Operations Instruction #3 was not an isolated incident. On March 19, the same port was capped on the Orbiter Columbia, OV-102, during performance of the same OMI. In this case, an experienced technician checking the work caught the error and had the cap removed. The supervisor was notified but no subsequent action was taken. Had this near-miss been properly communicated to all technicians, engineering, and quality, perhaps the mishap two weeks later could have been avoided. The significance of effective communications cannot be overemphasized in the very complex world of Orbiter processing and test operations. Communications and identification of precautions in the OMI and a good working relationship between the technicians, the engineers, and quality personnel is essential to successful operations. The geography of KSC facilities does not lend itself to ease of overview or development of team unity. The Launch Control Center (LCC) control rooms, from which systems engineers conduct tests, are a considerable distance from the OPF where technicians perform work on the vehicle. The remoteness of the two facilities impedes communications between engineers and technicians. As the program plans new control rooms and equipment, these new rooms could be located in the OPF between the two bays. Many benefits would be derived from the control rooms being in such a location. Having the engineers in close proximity to technicians and the vehicle would improve the overall efficiency of orbiter processing as well as communications among all parties. A key factor in achieving a higher flight rate is reducing OPF flow time. This change could substantially enhance KSC's capability to achieve shorter processing flows. The ability of engineers to perform walkdowns prior to implementing test operations would be greatly facilitated by their proximity and involvement with the work. Operations and Maintenance Instructions are obviously the key documents in ensuring work is done properly at KSC. A review to ensure they are correct and adequate is essential. Following the Challenger accident, direction was given to the design centers to review and concur in all OMI's that affected Criticality 1 or 1R equipment as well as changes to those OMI's. A commitment was also made to the Congress that this would be implemented. In the case of the orbiter, this does not now occur. The Johnson Space Center did review and concur in all OMI's after the Challenger accident and, until the summer of 1989, the JSC Resident Office at KSC concurred in all changes. The apparent lack of discipline in utilizing the paper system resulted in a communication breakdown and confusion that may have contributed to the mishap. There should be a coordinated and documented plan of action between work shifts for accomplishing processing and testing. First and second shifts utilized two different work authorization documents (WAD's) to perform the same task. An IPR was not prepared when anomalous conditions were observed. Constraints were not identified when performing electrical work, i.e., removal of ground wires. A deviation was not logged in a timely fashion. The technicians, engineers, and inspectors at KSC are a highly motivated and dedicated team. Processing and testing of Orbiters is a very complex and demanding task. These personnel are indeed on the firing line three shifts a day, seven days a week. Problems and difficulties are always present. With so much depending upon their ability to perform their work, it behooves us to provide them with all the skills and talents they require. Training, knowledge, and communications are all essential to the task. The cost for repair of this fuel cell is significant, but considering Space Shuttle Operations will continue for as long as 20 more years, it could be an inexpensive lesson if we can learn from this accident and truly apply the lessons learned.","Lesson ID":1182}
{"Lesson(s) Learned":"The adequacy of o-ring processing, quality control and material delivery-to-processing is questionable.","Lesson ID":177}
{"Lesson(s) Learned":"Teflon cloth wrapped around the suspension lines to expedite extraction of the folded lines, jammed closed the canopy compartment lockoff flaps and caused failure of the recovery system.","Lesson ID":517}
{"Lesson(s) Learned":"The Orbiter Engine ICD (13M15000) made no mention of Helium in the LH2 other than quantities allowed per the controlling document SE-S-0073, SPACE SHUTTLE SPECIFICATION, FLUID PROCUREMENT AND CONTROL (27 MAY 1999). This specification established the procurement requirements and the chemical and particulate limitations for fluids used in fluid systems of the Space Shuttle Solid Rocket Booster (SRB), External Tank (ET), Space Shuttle Main Engine (SSME), and Orbiter. This specification applied to payloads that have fluid interfaces with the Orbiter or Space Shuttle Ground Support Equipment (GSE). This specification applied throughout all program levels for commonality and to ensure that fluid requirements used for design concepts will be used in verification and operation. The intent and requirements of this specification applied equally to influents and to effluents to the extent specified herein. No testing of GHe ingestion into the LH2 system was ever performed on a Space Shuttle Main Engine (SSME) because the condition of ingesting helium into the system was not addressed. In addition, at the time of the STS-128 launch attempt the SSME test program was over and there was no way to test an engine in the test stands. The rule of thumb on the Shuttle Program is Fly as you test and Test as you fly. Simulated tanking system testing was performed at Marshall Space Flight Center (MSFC) in an attempt to quantify how much Helium, if any, could be trapped in the Fill and Drain line. The combination of test results and the paucity of data regarding the capability of the SSME to tolerate GHe injestion resulted in the conclusion that if any Ghe (greater than zero GHe) is present in the system, no flight rationale is possible.","Lesson ID":6146}
{"Lesson(s) Learned":"You can’t anticipate every problem you will see in extended mission operations. This type of battery anomaly had been seen in the laboratory, but never before on-orbit. Design tradeoffs and choices made in the development phases may have implications for the operations phase (Phase E). Though they would have facilitated anomaly recovery, the cost-constrained CloudSat project eliminated gyros from the flight system design during Phase B. Due to unanticipated launch delays, CloudSat launched with a battery that had aged after its activation. The CloudSat spacecraft battery design did not permit the independent switching (off) of cells, so the spare cells could not be used due to the risk of overcharge during sunlight. Robust spacecraft fault protection (i.e., load shedding during under-voltage events) and redundancy (i.e., the receiver and Power Distribution Unit (PDU)) were critical to spacecraft survival. Instead of being used for redundancy, one PDU was reassigned to control charging and the other to control UV limits, thereby enabling lower UV fault settings. A failure in one system can cause other failures: the battery UV condition caused the loss of Receiver #1. Following the anomaly, JPL project management, the system subcontractor, and the U.S. Air Force quickly drew in experienced personnel to assist in anomaly resolution. This included veteran CloudSat project design engineers thoroughly acquainted with the spacecraft systems and experienced operations personnel familiar with CloudSat on-orbit operations. It’s always about the people Experience – we had the best people with real experience Imagination – out-of-the-box thinkers Teamwork Determination Luck is sometimes part of the solution: CloudSat has just enough (~5A) current available during eclipse to make DOOp work. The NASA program manager was very supportive in providing the funding needed for CloudSat mission recovery.","Lesson ID":22502}
{"Lesson(s) Learned":"Data collection during a number of Orbiter processing flows was necessary to determine which facility contamination control OMRSD requirements were truly warranted to achieve and\/or maintain the required flight hardware cleanliness level. Those OMRSD requirements that were not warranted were deleted in accordance with RCN KV9009M2.","Lesson ID":3336}
{"Lesson(s) Learned":"Impact of Nonpractice: The absence of power line filters frequently results in cross interference, which disrupts the proper operation of hardware and can obliterate science data. These problems usually can be identified in ground testing; however, correcting them by retrofitting flight hardware is very difficult and expensive. Therefore, it is important that power line filters be included in the early design of hardware. Significant interference problems can occur on orbit that were not found in ground testing due to unexpected ground loops or to hardware interface situations that could not be duplicated exactly during ground testing. Also, deterioration or partial failure of components and parts can result in increased levels of noise on power and ground buses. Hardware that is susceptible to conducted emissions can exhibit such problems as microprocessor resets, false or inaccurate engineering data readouts, unintentional mode changes, and lost or noisy scientific data. Power line filters minimize these interference problems by isolating hardware from conducted noise on power lines.","Lesson ID":646}
{"Lesson(s) Learned":"The reuse of a residual lifting fixture from previous programs is encouraged, but requires analysis by the current planned user for its application. Lifting activities and other critical operations may involve unanticipated risks to spacecraft.","Lesson ID":267}
{"Lesson(s) Learned":"Mercoid pressure switches are overly sensitive to system pressure fluctuations and may cause inadvertent activation (switch bouncing). Water deluge systems are unable to adequately absorb water line transients, thus jeopardizing the integrity of the valves & pump controller switches.","Lesson ID":47}
{"Lesson(s) Learned":"Contractor quality assurance programs and process controls may not be adequate for providing flight components capable of meeting mission requirements. Potential partial failure modes during the mission operations phase require contingency planning.","Lesson ID":373}
{"Lesson(s) Learned":"Particular problem areas related to the particle size of the propellant and the screw pump indicate that the facility may not be directly scaleable.","Lesson ID":201}
{"Lesson(s) Learned":"Using an unprotected external high-intensity lamp for illumination above sensitive flight hardware resulted in damage when the lamp exploded.","Lesson ID":68}
{"Lesson(s) Learned":"NASA has established an Avionics Upgrade Architecture Team (AUAT) charged with studying Space Shuttle avionics systems and recommending upgrades. The AUAT has conducted a thorough study and developed an excellent Block I upgrade plan that addresses the most serious needs, but as yet it is unfunded.","Lesson ID":1151}
{"Lesson(s) Learned":"From this experience we learned that: Ensuring tight connections between load cell string components is critical to high quality force measurements. When assembling a load cell string it is difficult to detect a problem in the string tightness. The connections may feel tight, but may be due to the small size of the gap. This problem can be diagnosed by examining the screws and the corresponding holes in the mounting blocks for indications of wear consistent with the screw bottoming out. Dial indicators or linear differential variable transformers (LDVTs) can be used to detect the very small motions associated with this problem in situ. If this problem is found, it can usually be remedied using a thin washer between the screw head and the shoulder of the counterbore.","Lesson ID":18701}
{"Lesson(s) Learned":"Lessons Learned\/Recommendations: While environmental testing has demonstrated considerable value to spaceflight projects, such testing always carries inherent risks. Test facilities must be maintained, and over time replaced as necessary, such that the test equipment is in good working order. Metrics must be developed and tracked that assess the mechanical health of the systems. \"Canned\" tests should be developed and periodically utilized to provide a trended database for the test facility system response. Any deviations in the system response should be investigated. Critical control system response data, such as the transfer function or inverse transfer functions and calculated drive voltage, must be evaluated real-time during vibration testing, but before application of the sine-burst to ensure that they are reasonable and do not indicate system maladies. A vibration facility validation test should be done for each planned test series that is representative of the actual test conditions before flight or critical hardware is mounted. Use of a simulated mass consistent with that of the test article is always recommended for spacecraft system level testing. Other flight equipment validation testing should be considered based on mass and criticality. Self-checks should be done that provide a representative response for the forcing range of the planned test. For higher force shock tests, shaker systems and test fixtures often do not respond in a linear fashion. It is also foolhardy to assume that test facilities are always in perfect working order. All test requirements should be defined in the test plan for a particular test. The test operators must have adequate data and training to ensure complete verification testing before testing critical hardware.","Lesson ID":903}
{"Lesson(s) Learned":"Oversized mounting screws can damage capped inserts.","Lesson ID":437}
{"Lesson(s) Learned":"Undocumented drawing changes to hazardous systems (480 volts AC), coupled with failure to follow required verification of system deenergization as part of lockout\/tagout procedure, can lead to potentially serious injuries to electrical workers.","Lesson ID":19}
{"Lesson(s) Learned":"Hot parts increase failure rate and reduce life. High part failure rates lower the reliability of flight hardware. Low reliability can cause early mission failures that can be very expensive and lower agency prestige.","Lesson ID":809}
{"Lesson(s) Learned":"Failure of the OMS engine trickle purge system lasting more than 96 hours will result in corrosion of the injector ball valves.","Lesson ID":147}
{"Lesson(s) Learned":"Wax thermal actuators have failure modes that can cause collateral damage.","Lesson ID":612}
{"Lesson(s) Learned":"Nonpractice of deterministic fracture mechanics analysis (or test) in a spacecraft or launch vehicle program would result in the failure to meet NASA design requirements for fracture control [references 11 and 12]. Failure to adequately consider fatigue in the design of structural and mechanical components subject to fluctuating loads may, at best, result in recurring costs for repair or replacement of components before their intended design life. At worst, a catastrophic failure, in terms of economic loss and loss of life, may result. It is standard JSC engineering practice to specify fracture control requirements on structural and mechanical components that are classified as fracture critical. As a part of these requirements, it is required that a component be shown by analysis or test to be able to survive a deterministic minimum number of service lifetimes (usually 4) without the largest possible undetectable flaw growing to failure [references 11 and 12]. While this process has proven to be adequate to ensure against failure, design practices which do not take advantage of stochastic methods for fracture analysis may produce over-conservative and uneconomical structures and mechanisms. In mechanical or structural system reliability analyses, failure to use a stochastic fatigue or fracture mechanics approach to the estimation of reliability will result in life estimates that are incompatible and inconsistent with the results of the standard NASA deterministic safe-life analyses required by the Space Shuttle and Space Station Programs [references 11 and 12].","Lesson ID":700}
{"Lesson(s) Learned":"Due to the rapid pace of ISS assembly launches and the many and varied resulting configurations, Multi-Element Integration Testing (MEIT) with operational loads of Portable Computer System (PCS) software is limited and, in some cases, may only be accomplished in the brief time allocated for regression testing.","Lesson ID":1165}
{"Lesson(s) Learned":"The Board found that the loss of the Lewis Spacecraft was the direct result of an implementation of a technically flawed Safe Mode in the Attitude Control System. This error was made fatal to the spacecraft by the reliance on that unproven Safe Mode by the on orbit operations team and by the failure to adequately monitor spacecraft health and safety during the critical initial mission phase. The Board also discovered numerous other factors that contributed to the environment that allowed the direct causes to occur. While the direct causes were the most visible reasons for the failure, the Board believes that the indirect causes were also very significant contributors. Many of these factors can be attributed to a lack of a mutual understanding between the contractor and the Government as to what is meant by Faster, Better, Cheaper. These indirect contributors are to be taken in the context of implementing a program in the Faster, Better, Cheaper mode: Requirement changes without adequate resource adjustment Cost and schedule pressures Program Office move Inadequate ground station availability for initial operations Frequent key personnel changes Inadequate engineering discipline Inadequate management discipline The Board strongly endorses the concept of \"Faster, Better, Cheaper\" in space programs and believes that this paradigm can be successfully implemented with sound engineering, and attentive, and effective management. However the role changes for Government and Industry are significant and must be acknowledged, planned for and maintained throughout the program.Since these roles are fundamental changes in how business is conducted, they must be recognized by all team members and behaviors adjusted at all levels. The Board observed an attempt during the early phase of the Lewis Program to work in a Faster, Better, Cheaper culture, but as the Program progressed the philosophy changed to business as usual with dedicated engineers working long hours using standard processes to meet a short schedule and skipping the typical Government oversight functions.","Lesson ID":625}
{"Lesson(s) Learned":"Improper choice of lifting slings can occur if only intuition obtained by experience is used.","Lesson ID":239}
{"Lesson(s) Learned":"Ensure that design and acceptance criteria are adequately developed and implemented to route conductors in panel enclosures away from fasteners and sharp edges.","Lesson ID":1716}
{"Lesson(s) Learned":"Unless precluded by solar system obstacles, a spacecraft should be configured to allow real time telemetry during critical events. Such telemetry may provide crucial spacecraft health and safety data for other spacecraft missions with similar systems or activities as well as for the current mission.","Lesson ID":432}
{"Lesson(s) Learned":"The use of encapsulant in samples processed in microgravity can result in non-directional solidification and supercooling of the sample.","Lesson ID":1919}
{"Lesson(s) Learned":"An increased potential would exist for a critical crane failure which could result in damage to flight hardware or serious injury\/death to personnel.","Lesson ID":673}
{"Lesson(s) Learned":"The recent availability of high-temperature optical fibers makes the intensity- modulated fiber optic microphone a promising instrument for obtaining measurements of pressure fluctuations in hypersonic flow fields.","Lesson ID":514}
{"Lesson(s) Learned":"Failure to adhere to these guidelines for ground processing operations could create operational delays, increase operational costs, decrease the effectiveness of failure management, and could ultimately lead to a system failure which could result in loss of life\/vehicle or damage to a vehicle system.","Lesson ID":649}
{"Lesson(s) Learned":"The potential exists for contamination on rocket motor case walls, which can interfere with bonding of insulation.","Lesson ID":329}
{"Lesson(s) Learned":"Low fluid level in the shock absorber could cause failure of the deceleration unit damaging the QD and result in a hydrogen fire.","Lesson ID":157}
{"Lesson(s) Learned":"OSP took many proactive management steps to increase our emphasis on safety. However, just below the surface significant flaws existed in our implementation approach resulting in a misunderstanding of the S&MA organizational authority. With the program acceleration, the quality of the safety products was further compromised by abandoning established requirements, processes, tools, and standards of performance. The intent was to catch up on the safety products at SDR and beyond; however, safety is most effective when woven into the fabric of all organizational elements from the start of a program. Additionally: a. S&MA Leadership. Throughout the life of the program, it appeared that OSP S&MA inclusion in management decisions and leadership was ineffective. A misunderstanding in S&MA leadership was created by the presence of a senior S&MA expert (former S&MA employee) on the Program staff, reporting to the Program Manager. His role was to ensure internal Program implementation of and compliance with S&MA requirements and provide a working level interface with the assigned independent S&MA representatives. It now appears that this arrangement somehow gave the impression of diminishing the role of the separately assigned, independent S&MA representatives. b. De-emphasizing S&MA Products. At the Systems Requirements Review (SRR), S&MA products were de-emphasized as a contract deliverable due to acceleration. These same products were not part of the formal review at the SDR for baselining (only comments were allowed); therefore, these S&MA documents did not go through a thorough review and feedback process. The “catch-up” desired never materialized, and as a result, the normal safety products expected at SDR were deficient. c. S&MA Requirements. Adequate S&MA requirements were not contained in the Level 2 requirements document, and insufficient attention was paid to S&MA data requirements in the contracts. The Program placed so much emphasis on the HRR that we overlooked many, equally important S&MA requirements. d. Level 3 and Level 4 S&MA Requirements Development. Given the inadequate Level 2 S&MA requirements, the Contractors' were unable to develop appropriate Level 3 and 4 S&MA requirements. e. Incomplete Understanding. NASA should not assume the Contractor workforce understands the Government's human space flight expectations. Discipline working groups were needed to provide a forum to assure mutual understanding\/interpretation of the S&MA requirements and processes between participating NASA centers, contractors, and related stake holders. Without functioning working groups, the contractors' interpretation and implementation of S&MA requirements were questioned and debated at each program review.","Lesson ID":1511}
{"Lesson(s) Learned":"If this practice is not followed, thermal control may not be maintained and spacecraft and their instruments and equipments may be damaged and fail due to exposure to temperature ranges beyond operating and failure limits. Also, ESD could occur which can cause damage and failures to hardware.","Lesson ID":727}
{"Lesson(s) Learned":"Considerations when installing fiber optics in spacecraft: Vibration in the Launch environment can cause cracks and spalls on fiber endfaces to propagate. Sharp edges or corners could damage fiber cable jacket. Movement of improperly secured fiber optic harnesses. Contamination on fiber endfaces will migrate more readily in microgravity when demating and mating connectors. At KSC, we developed expertise in: pre-installation testing, handling, routing and securing, inspection, cleaning and acceptance. Pre-Installation Testing - Fiber endfaces should be inspected post-fabrication to verify proper polishing. - Fiber links should be tested to verify acceptable optical performance Handling - Care must be taken to prevent damage to fiber optic cable assemblies during the installation process. - Use Caution when handling to avoid violating the minimum bend radius of the fiber. - Fiber optic cables should only be handled and installed by trained and certified fiber optic personnel. Routing and Securing - Fiber optic cable assemblies should not be combined in the same wiring bundle as wire or coaxial cable assemblies. - The minimum bend radius shall not be less than 10 times the cable diameter unless specified on the engineering documentation. - For installation, fiber optic cable assemblies shall be tied at least once every 20cm (8 in), or per the engineering documentation. - The minimum bend radius shall not be violated at connector backshells. - Tie downs shall be tight enough to capture the fiber optic cable but shall not deform the cable outer jacket. The ties shall not pinch, deform, kink, or otherwise stress the cable assembly. - Fiber optic cable assemblies shall not be routed over sharp edges or corners unless appropriate protection is provided.","Lesson ID":1876}
{"Lesson(s) Learned":"Foundational documents, critical for the initial planning and subsequent control of project activities, should be developed and widely distributed, published and advertised to the team early in the process. For projects limited in manpower and financial resources, these foundational documents will be equally limited in their complexity, but they should exist from the beginning of the project to provide guidance to the entire team. A clear flight certification process is needed for COTS hardware. Qualification requirements for all disciplines need to be clearly and explicitly stated up front. The approval process for changes can burden the flow of work with unnecessary steps if it is not tailored to the size, scope, and complexity of the project. Approval process for changes should be agreed to at the beginning of the project in line with configuration management for the size and scope of the project. Wise use of analyses and evaluation of interfaces at all stages of the life cycle can save time and resource expenditures during build, test, and milestone reviews. During any design, development, integration and test project that has a compressed schedule, it is essential for the team to communicate to avoid having the hardware wait for the next step in the process. Coordination is needed between MSFC and JSC Export Control offices. Seek out local (MSFC) help with database inputs before going to JSC for help. A payload with a normal schedule, would not have the issues with parts lists, Interface Control Document (ICD), manifest requests, and LRODS that we had on ISERV. Parallel development of the products is very difficult and fraught with potential mistakes. Check internally to see if another project, such as Microgravity Science Glovebox (MSG), might have experience with the system\/database. Using COTS equipment, while faster to procure, requires extra testing and communication to ensure it meets standards, which must be factored into the schedule. To meet implied requirements, minimum NASA standards must be met, which implies additional quality engineering support, specific test requirements, and part traceability. It is a good idea to get S&MA involved up front, even if only to understand the qualification requirements that may be encountered when the hardware needs to be integrated into the higher class system. If too many assumptions about the plug-and-play nature of the equipment and supporting hardware are made up front, the team will spend more hours reiterating design and testing activities. Assuming that COTS is faster and cheaper without understanding the implied requirements unnecessarily increases the risk of not meeting schedule, budget, and delivery agreements.","Lesson ID":7217}
{"Lesson(s) Learned":"Careful consideration must be given to material choices and system designs in spaceflight hardware.","Lesson ID":438}
{"Lesson(s) Learned":"Stability analyses for all geometries are an important part of attitude control hardware and software development and testing.","Lesson ID":358}
{"Lesson(s) Learned":"The three available sizes of Extravehicular Mobility Unit (EMU) planar Hard Upper Torso (HUT) units will accommodate crewmembers from the 40th percentile female to the 95th percentile male. Assumptions were made regarding the ability of crewmembers to upsize or down-size to fit the three available HUT sizes and operate safely and effectively in them.","Lesson ID":1114}
{"Lesson(s) Learned":"Experience since JPL began tracking command file error trends in 2000 suggests: Command file error rates increase during launch and early cruise operations, along with times of increased operations tempo (encounters, orbital operations) and execution of first time events. Each project needs to proactively balance the risk of command file errors, as compared with other project risks and project resource constraints, in evaluating the recommendations listed below.","Lesson ID":8302}
{"Lesson(s) Learned":"• Data compression is poor when the interferometer is approaching ZPD. • Detailed modeling and analysis are needed to establish the data buffer management and compression criteria.","Lesson ID":1594}
{"Lesson(s) Learned":"It was found that a combination of noise, back-feeding through the outputs of a logic device, and ground bounce were able to produce sufficient voltage below the components' manufacturer specified limit of -0.5 volts that resulted in the FET-based device “latch-up”. The outputs then went into a tri-state condition, allowing the output voltage to gradually rise to the rail voltage. This produced a destructive condition for the H-bridge output transistors. Also, the component manufacturer determined that once the logic device was exposed to this “latch-up” condition, it became more susceptible to future latch-ups","Lesson ID":1603}
{"Lesson(s) Learned":"Lack of redundant high temperature cut-off switches allowed 3 RCS thrusters to be over heated during insulation baking process.","Lesson ID":78}
{"Lesson(s) Learned":"Failure to perform long term mission simulations will result in inadequate knowledge of long duration performance characteristics and could result in the retention of undesirable battery characteristics or failure modes that would result in mission failure.","Lesson ID":802}
{"Lesson(s) Learned":"Using neither WCA nor VTMT to simulate circuit functional performance, a unit is subject to functional peril from changes in uncontrolled circuit parameters due to part variations. Inadequate margins can result in sudden failure to operate, or the condition can lead to functional degradation of the circuit with a high probability of catastrophic failure due to drift outside the operational limits of the unit. Lacking insight from test or analysis, the project is likely to lack provisions for detection of these problematic areas in the failure intervention plan. Without the VTMT or WCA parameter change matrix as a readily available diagnostic tool, failure causes and remedies must be determined under post-failure constraints, where time and hardware limitations may inhibit adequate corrective action.","Lesson ID":771}
{"Lesson(s) Learned":"An on-line, well-maintained risk management database is critical to identifying, tracking and retiring project risks. It enables the program\/project manager to \"stay on top\" of all issues.","Lesson ID":1296}
{"Lesson(s) Learned":"Clean up technicians were unaware of the contaminated hypergolic flex hose and were not the correct personnel to be performing the pickup.","Lesson ID":8016}
{"Lesson(s) Learned":"Recurrence controls to prevent an original manufacturing defect should be expanded to address any items already deployed in field including those to be reprocessed or reworked.","Lesson ID":1}
{"Lesson(s) Learned":"Velocities of acoustic emission signals induced by means of lead breaks in a thin-walled graphite\/epoxy tube were found to be in agreement with classical plate theory.","Lesson ID":509}
{"Lesson(s) Learned":"Instrumented \"safety checks\" at critical points in the startup and operational procedures ensure proper engine system priming.","Lesson ID":967}
{"Lesson(s) Learned":"Lack of systems engineering involvement early in the project formulation increases the risks later in the development and operations phases of the project.","Lesson ID":2297}
{"Lesson(s) Learned":"The SSME telemetry system provides only approximate time correlation between multiple data systems, resulting in timing uncertainties.","Lesson ID":209}
{"Lesson(s) Learned":"Excessive noise levels during GOX vent arm air receivers bleed manifold venting operations may damage personnel hearing.","Lesson ID":138}
{"Lesson(s) Learned":"Choose attitude determining sensors carefully, giving careful consideration to command and data interfaces.","Lesson ID":1593}
{"Lesson(s) Learned":"Testing of flight critical hardware without approved test procedures, and without the presence of quality assurance, can lead to serious problems. Test instrumentation, used improperly, can induce voltages and currents in components, resulting in degradation or failures.","Lesson ID":287}
{"Lesson(s) Learned":"Use of dilution purges when venting explosive gases such as hydrogen is not necessarily desirable. Mixtures of hydrogen\/helium do not become non-flammable until the mixture is 91% He. For quotfuel richquot hydrogen\/helium mixtures in air, the flammability limit increases with increasing He content, until 85% He mixture is obtained.","Lesson ID":851}
{"Lesson(s) Learned":"When dealing with a component in a semi-closed cavity a very accurate leak check can be performed by purging the cavity with air or nitrogen at a known flow rate, establishing a stable background, pressurizing the component with helium and using a mass spectrometer to measure the change in the helium concentration within the purged cavity. The change in helium concentration can be used in conjunction with the purge effluent flow rate to derive a very accurate leak rate down to the 1 standard cubic inches per minute (SCIM) range. The accuracy of this type of leak check can be verified by introducing helium into the purged cavity at known flow rates close to the component spec requirement level and verifying the concentrations delta measured by the mass spectrometer corresponds correctly with the value expected for the injected helium.","Lesson ID":4218}
{"Lesson(s) Learned":"A post-environmental systems test of the final satellite flight configuration must be planned and executed","Lesson ID":1268}
{"Lesson(s) Learned":"The use of third party (independent) courier services for the shipment of critical hardware should be discouraged or at least considered a risk that should be addressed on a case-by-case basis. (Government bill-of-lading (GBL) regulations presently prohibit hand carrying of international shipments.) Because of the unknown extent to which critical items are controlled between the point of departure and destination, it is imperative that strict procedures and controls be utilized in the packaging and oversight of the shipment if a courier service is to be used.","Lesson ID":1849}
{"Lesson(s) Learned":"Contaminants created by the interaction of stainless steel lines and components with nitrogen tetroxide oxidizer can result in the blockage of small oxidizer flow passages and filters.","Lesson ID":305}
{"Lesson(s) Learned":"A successful flight project manager must assiduously and proactively manage performance, budget and schedule. In particular, use of proven tools for effective management of project reserves is essential in an era of cost-capped missions.","Lesson ID":1780}
{"Lesson(s) Learned":"While other Government Agencies may have specific operating requirements and environments, not all may be applicable to your project. Unless the Project has a thorough understanding of how these other entities operate, it may expend more resources than necessary to complete agreements and meet requirements.","Lesson ID":1094}
{"Lesson(s) Learned":"Shipment of SRM segments in horizontal position may cause cases to assume undesirable out-of-round conditions and contribute to mating difficulties.","Lesson ID":183}
{"Lesson(s) Learned":"Failure of the bridge operator to follow the approved procedure, which requires verification that the Zero-G System is not hooked up prior to bridge movement and assignment of an observer, was the major contributing cause of this mishap. The second contributing cause involved multiple deficient control systems to preclude bridge operation while connected to the Zero-G Simulator. Supervisory control of the bridge power key was nonexistent, allowing technicians free access to bridge keys. Procedural steps included in Operations and Maintenance Instruction (OMI) V3575 to tag the bridge\/bucket system out of service and secure the key during Zero-G operations were not referenced in the OMI V9023 that configured the PLBD and Zero-G System for PLBD operations. Shift tie-in from the third shift Mechanical\/Electrical\/TCS Supervisor to the first shift Electrical\/TCS Supervisor did not occur. In addition, the first shift Electrical\/TCS Supervisor was not aware of the scheduled PLBD operations status nor did he perform a complete walkdown. Therefore, the supervisor assigning work requiring bridge operations was not aware the Zero-G System was connected. The work assigned to the bridge operator involved in this mishap did not appear either on the Orbiter Processing Facility (OPF) shop schedule or the KSC Integrated Contractor Schedule (KICS). Had this work been properly integrated into the KICS schedule, work involving bridge movement would have been scheduled to occur after use of the Zero-G Simulator was complete. The third contributing cause is attributed to this lack of integrated scheduling. Improper raising of the right PLBD prompted a detailed inspection of the door structure but no damage was found that could be directly attributed to this mishap.","Lesson ID":1200}
{"Lesson(s) Learned":"The loss of air data from a single-string Pitot-static source due to icing or foreign object damage, can result in a departure from controlled flight (and possible catastrophic loss of aircraft) in aircraft which are inherently unstable and dependent on air data for dynamic stability.","Lesson ID":360}
{"Lesson(s) Learned":"Without full assessment of capability of vehicle and facility to withstand adverse environmental conditions, a potential for unexpected problems exists.","Lesson ID":198}
{"Lesson(s) Learned":"It is impossible to predict torque value on screws after repeated applications of \"a thread-locking compound\".","Lesson ID":524}
{"Lesson(s) Learned":"Methods of evaluating critical system parameters must be verified as sufficiently reliable to support risk assessment","Lesson ID":1391}
{"Lesson(s) Learned":"When selecting a design verification method, the group responsible for implementing the design should weigh in on the practicality of the proposed method. The likelihood of success will be slim if the wrong method is forced upon the implementing organization. All stakeholders should have a vote in determining the verification method used. This can be done by allowing the stakeholders to participate throughout the design life cycle (at design reviews, etc.).","Lesson ID":5203}
{"Lesson(s) Learned":"In the magneto-optic imaging instrument, a distribution of strong magnetic field exists in between two conducting sheets, while no measurable field strength exists above the magnetic current sheet.","Lesson ID":526}
{"Lesson(s) Learned":"The rotator's screw shaft will bend if the rotator is overdriven. The rotator's screw shaft will also bend if the jack screws of the lifting-fixture pivot shaft are overdriven. The operating personnel used several different indicators to determine when the rotator was unloaded; however, all of the methods depended on feel or sight. Less experienced operating personnel were not always able to make the right call.","Lesson ID":3116}
{"Lesson(s) Learned":"\"Heritage\" hardware designs, previously flown on prior missions, can still contain design errors. Consideration of electrical shorts as a potential failure mode during FMECA of the power system is of critical importance.","Lesson ID":371}
{"Lesson(s) Learned":"Load banks must be evaluated during development and test for reliable performance at coupling lengths equal to or greater than intended in the final test or operational configuration.","Lesson ID":581}
{"Lesson(s) Learned":"The principal impact of nonpractice is unacceptable joint leakage of cryogenic and\/or gaseous propellants from propulsion systems and stages. These leakages, if entrapped in specific areas of launch vehicles in the presence of ignition or heating sources, sparks, or rocket system exhausts could result in catastrophic loss of the vehicle and of lives of astronauts or ground crew. These catastrophic events, or location of leaks at critical times in the schedule can also cause program delays and can result in excessive program costs. Table 1 is a generic listing of selected typical conditions which could result in excessive leakage rates. [D]","Lesson ID":701}
{"Lesson(s) Learned":"The Review Committee concluded that the primary cause for this incident was that the Range Safety abort was rescinded without on net authority and range awareness. The principal contributing factors to this incident were the off net communications; and confusion that resulted from having two separate operational nets, the lack of sufficiently detailed and attended prelaunch briefings, and the lengthy process of communicating with the B-52. The Review Committee during its investigation has compiled a list of findings and conclusions. They have been grouped in the following categories: Abort Process Mission Rules Communications Launch Day Roles and Responsibilities Mission Planning and Preparation ABORT PROCESS FINDINGS An abort was initiated by the WFF\/RSO, the abort was rescinded by the contractor TC without on net authority and range awareness. The B-52 was required to reduce altitude just prior to the CDR dropout abort call. WFF, Eastern Range (ER), Merritt Island Tracking Station (MILA) and Bermuda Tracking Station (BDA) responded in a manner which allowed continued flight of the Pegasus after launch There was no procedure in the WFF\/OSD or the Contractor Launch Checklist (LC) that detailed the procedure for rescinding an abort. CONCLUSIONS From the above findings, the Committee reached the following conclusions: The contractor TC method of rescinding the abort was inadequate. Fin battery actuation was a consideration in the decision to rescind the abort. The altitude problem may have contributed to the confusion concerning the abort. Capability to destruct the Pegasus was maintained throughout the flight. Quick positive reaction by all supporting personnel allowed this flight to continue to a successful conclusion. MISSION RULES FINDINGS An apparent dropout of a Flight Termination System (FTS) CDR occurred. This apparent dropout required an abort of the launch according to the mission rules. Not all key personnel were aware of all mission rules. Additionally, in some cases, key personnel had different interpretations of mission rules. CONCLUSIONS There were misunderstandings among key personnel concerning the mission rules. Lack of awareness and misinterpretation of mission rules may have contributed to this incident. The FTS CDR dropout mission rule produced a high risk of mission abort. The complex routing of the data stream (vehicle\/aircraft to ground, ground to Time Division Multiple Access (TDMA) satellite, satellite to ground) and the amount of support equipment necessary to provide this data (decoms, bit syncs, cabling) produced a high probability of data loss not related to CDR health. COMMUNICATIONS FINDINGS No single Intercom Channel (IC) was understood by all key participants as the primary launch net. The WFF\/RSO chain of communication to the B-52 required 3 intermediaries. The configuration of communication equipment used by NASA 1 and the contractor TC was operationally awkward. Formal intercom net protocol was not consistently used. CONCLUSIONS The lack of a single IC for all critical calls that was monitored by all key personnel contributed to confusion and to the range's lack of knowledge of impending launch. The chain of communication between the WFF\/RSO and the B-52 contained too many elements. Improved intercom net discipline may have prevented misunderstandings leading to the unplanned launch. The contractor TC had expected to receive Range abort calls from the WFF\/RCO on IC 4. The fact that the abort was only transmitted on IC 1 by the WFF\/TD and heard off net by the contractor TC caused the contractor TC to question the abort call and delayed the passing of the abort to the B-52. LAUNCH DAY ROLES AND RESPONSIBILITIES FINDINGS There were no clear lines of authority and responsibility for launch decisions. The OSC\/TC rescinded the abort command without proper on net authority and range awareness. CONCLUSIONS The primary cause of this incident was that the OSC\/TC rescinded the abort without on net authority and range awareness. The lack of clear lines of authority and responsibility contributed to his\/her actions. The limited abort scenarios exercised during the dress rehearsal were not sufficient to identify all authority and responsibility conflicts. MISSION PLANNING AND PREPARATION FINDINGS No pre-launch briefing was held at which all key participants reviewed mission rules, constraints, and procedures. The WFF\/Operations and Safety Directive (OSD) and the Contractor's Launch Operations and Mission Constraints (LOMC) document contained conflicting information that was not completely integrated in the mission planning process. A complete dress rehearsal was not conducted for this mission. CONCLUSIONS The pre-mission planning and preparation process was inadequate for a mission of the scope and complexity of the Pegasus \/ SCD-1 launch. Conflicting Information in the various organizations' documentation may have contributed to this incident. The lack of a pre-mission briefing attended by all organizations that reviewed roles, responsibilities, mission rules\/constraints, IC assignments, and the launch decision process contributed to this incident.","Lesson ID":1090}
{"Lesson(s) Learned":"NASA project organizations responsible for project planning and control of scheduling, budgeting, and implementing approved work scope must define documentation templates so that project data can be integrated among multiple organizations and users. One template within this documentation set should define specific instructions for code field usage and WBS nomenclature to be entered into the project’s schedule management tool. This will enable all tasks within the IMS to be uniquely and consistently mapped to the project’s approved WBS numbering scheme as established by the NASA Structure Management (NSM) system and reflected within the Agency’s Meta Data Manager (MdM) and the Financial Accounting System. The NSM numbering scheme is described and illustrated in the NASA Work Breakdown Structure (WBS) Handbook.","Lesson ID":5862}
{"Lesson(s) Learned":"The Space Shuttle is about to receive two major avionics upgrades--a triple redundant Global Positioning System (GPS) installation and the Multi-Function Electronic Display System (MEDS)-both of which require significant changes to the Primary Flight Software (PFS) and Backup Flight Software (BFS) systems.","Lesson ID":1002}
{"Lesson(s) Learned":"The problem was caused by using a commercial piece of equipment without looking into its internal nature and considering what a failure in an internal part might do to the flight equipment. Previously, the SAR Transmitter had been tested at the contractor's facility, using the same set-up, with no problem.","Lesson ID":435}
{"Lesson(s) Learned":"Lack of a preventative maintenance program for the vertical installer resulted in failure of the installer to maintain control over the SSME.","Lesson ID":113}
{"Lesson(s) Learned":"Conducting pre-start job safety analyses and job hazard assessments ensures success in emergency situations","Lesson ID":1721}
{"Lesson(s) Learned":"An ignition source (spark, heat, or flame) present during a PCT diesel fueling operation could possibly ignite the diesel fuel.","Lesson ID":136}
{"Lesson(s) Learned":"Project attention to the configuration control of flight scripts is likely to prevent the generation of unnecessary software iterations, improve the rigor of mission system engineering processes, and ensure consistency in the test and operations environments.","Lesson ID":2476}
{"Lesson(s) Learned":"Most polymeric and elastomeric materials are permeable and are subject to swelling and solvent-stress-cracking when exposed to some fluids.","Lesson ID":430}
{"Lesson(s) Learned":"See quotRecommendationsquot","Lesson ID":2419}
{"Lesson(s) Learned":"Assume that a dormant lithium chemistry spacecraft battery will develop a passivation layer and that the effects on the spacecraft circuitry may be significant: Lithium-based spacecraft batteries should be characterized and depassivation measures planned, as required A standard Department of Defense practice is to characterize and depassivate each spacecraft battery lot-- both on the ground and in flight.","Lesson ID":1410}
{"Lesson(s) Learned":"Warnings must be place before any procedural step to ensure the reader \/ operator is aware of any issues prior to implementation.","Lesson ID":1204}
{"Lesson(s) Learned":"UPS batteries require periodic discharge\/recharge cycles for proper operation in the event of a power outage. Procedures to perform the necessary periodic maintenance will be corrected for the CADS computers and any other SSME GSE systems using UPSs.","Lesson ID":3762}
{"Lesson(s) Learned":"Because of the innovative processes used, there is some possibility that all of the design knowledge related to safety issues that has been acquired by the NASA X-38 team may not be transferred to the contractor selected to build the operational CRV.","Lesson ID":1167}
{"Lesson(s) Learned":"A possibility exists for personnel injury while removing blast covers after each launch due to the lack of an access platform to stand on.","Lesson ID":166}
{"Lesson(s) Learned":"Platforms 11A-1 and 11A-6 cause an interference problem when the PBD's are opened\/closed during aft propulsion system (APS) servicing.","Lesson ID":158}
{"Lesson(s) Learned":"The potential for getting out of step and unnecessarily losing data due to use of relative positioning exclusively is quite high.","Lesson ID":279}
{"Lesson(s) Learned":"RCM is the best approach to developing the preventive maintenance program for a new system. It provides a step-by-step approach, prioritizes preventive maintenance tasks, and optimizes the repair cost.","Lesson ID":891}
{"Lesson(s) Learned":"Demonstrated design adequacy and its implications to long term reliability are affected. For example, testing at 50°C instead of 75°C and for about 20 hours instead of 144 hours reduces test demonstrated reliability by a factor on the order of 50.","Lesson ID":783}
{"Lesson(s) Learned":"Shaping \/bending of tubes must take into consideration the oval-shaped deformations that result when planning for subsequent welds","Lesson ID":1230}
