{"do_lower_case": true, "bos_token": "<s>", "eos_token": "</s>", "sep_token": "</s>", "cls_token": "<s>", "unk_token": "[UNK]", "pad_token": "<pad>", "mask_token": "<mask>", "tokenize_chinese_chars": true, "strip_accents": null, "model_max_length": 512, "special_tokens_map_file": null, "name_or_path": "/home/hswalsh/.cache/torch/sentence_transformers/sentence-transformers_multi-qa-mpnet-base-cos-v1/", "tokenizer_class": "MPNetTokenizer"}