{
  "cls_token": "[CLS]",
  "do_lower_case": true,
  "mask_token": "[MASK]",
  "model_max_length": 512,
  "name_or_path": "bert-base-uncased",
  "pad_token": "[PAD]",
  "padding": "max_length",
  "return_special_tokens_mask": true,
  "sep_token": "[SEP]",
  "special_tokens_map_file": null,
  "strip_accents": null,
  "tokenize_chinese_chars": true,
  "tokenizer_class": "BertTokenizer",
  "truncation": true,
  "unk_token": "[UNK]"
}
