{"Recommendation(s)":"Incorporate specific instructions in work authorization documents to tether or otherwise restrain all equipment used in elevated positions.","Lesson ID":58}
{"Recommendation(s)":"The Fizeau interferometer is the most commonly used interferometer for testing optical components and systems used aboard spaceborne or space-related instrumentation. This guideline provides information on the proper use of this instrument.","Lesson ID":717}
{"Recommendation(s)":"Use a multi-disciplinary approach to investigations using fault-tree analysis for complex systems to derive maximum benefit from fault-tree methodology. Adhere to proven principles in the scheduling, generation, and recording of fault-tree analysis results.","Lesson ID":757}
{"Recommendation(s)":"Issue an alert describing the possibility of inadvertent electrical mating of differently keyed connector halves that are out of alignment. Revise connector procedures to permit greater visibility or redesign connectors to preclude inadvertent connections. Designers of future wiring harnesses should avoid using Kapton insulated wires.","Lesson ID":53}
{"Recommendation(s)":"The capability to both observe and control movable elements to an appropriate precision (e.g. tape position, platform position, boom position, etc.) Without the possibility of significant error buildup through normal use should be incorporated into the basic spacecraft system design. Specifically, up\/down counters should be used in all bidirectional divide by stages whenever accurate position information is needed.","Lesson ID":380}
{"Recommendation(s)":"Valves that do not perform a NASA-required valve function should be physically disabled. Valves that do not perform a NASA-required valve function should not be incorporated into larger designs and should not be included in procurement specifications. KSC project teams should review procurement specifications for prototypes more closely to ensure that KSC requirements, including those for hazardproofing and electrical design, are part of the procurement specification. Engineering Review Boards reviewing requests to use prototypes should assign a single, dedicated point of contact to be responsible for verifying the prototype's compliance with design requirements (mechanical, electrical, pneumatic, reliability, etc.) for use at KSC and to request any warranted waivers. A formal approved procedure should be in place for the operation of a prototype after design verification. An approved user training course should be in place for prototype operation procedures after design verification. All hardware, whether COTS or prototype, used in proximity of a space vehicle requires the performance of all design, operation, and training verification procedures.","Lesson ID":4456}
{"Recommendation(s)":"For any new space vehicle program, where redundant power is provided to the space vehicle’s critical LRUs, the capability to automatically detect and verify the bus redundancy should be designed into the system. A system similar to the Orbiter’s “Caution and Warning” panel could be used to monitor the bus redundancy status of all critical functions. This would allow for automatically verifying bus redundancy whenever power is applied to the space vehicle and for monitoring the status throughout launch processing and mission operations.","Lesson ID":3761}
{"Recommendation(s)":"Rework procedures were changed to provide an inspection of failed parts before attempting repairs.","Lesson ID":10}
{"Recommendation(s)":"After applying final assembly torque, consider applying to all critical connections \"Torque Stripe\" paint that spans the joint between the nut and the adjacent connector surfaces. Then visual inspection of the \"Torque Paint\" will verify final assembly of the critical joints. Subsequent loosening or removal of the nut will be detectable due to the crack in the paint that will result at the joint. If joint is loosened, tag the loosened joint and perhaps remove \"Torque Paint\". Apply new \"Torque Paint\" when joint is fully reassembled. All high-power connections must be thoroughly checked before initially applying power. The Power\/Control Drawer was given a visual inspection before use, however the loose connections were not visible beneath the contactor cover. It should not be assumed that a company experienced with electrical assembly has properly checked all connections.","Lesson ID":1229}
{"Recommendation(s)":"Any equipment suspected to be sensitive to assembly practices of tolerance build-up should have a worst case analysis to reveal any potential performance anomalies. Consideration should be given to planning for original development engineers to participate as members of the in-flight anomaly recovery team.","Lesson ID":395}
{"Recommendation(s)":"Spacecraft hardware susceptibility to corona-induced damage should be addressed in subsystem design and in test and operational procedures. Ensure that ventable products will be vented overboard in spaceflight instead of venting within any enclosures, including blankets. The following design measures for corona avoidance on high voltage circuits, summarized from Reference (1), were recently used in the Multi-Angle Imaging Spectroradiometer (MISR) instrument program (Reference (2)): Avoid venting into regions of intense electric fields, such as the vicinity of power supplies and power wiring. Ensure that all critical voltage regions are properly vented. Use insulation materials of high dielectric strength. Insulating materials with strength greater than 300 volts\/mil and a relative dielectric constant less than 5 are preferred. For high voltages, use only connectors that have been tested to work in the critical pressure region. Also, use only soldering terminals rated for high voltage. Physically isolate the high and low voltage circuits. Test the circuits that may be subject to voltage breakdown and\/or corona discharge. Where the above design measures cannot be accommodated, take protective actions (e.g., power such circuitry off prior to encountering critical pressure regions) during testing and flight to avoid damage.","Lesson ID":598}
{"Recommendation(s)":"The space environment is a vital consideration in circuit design. Voids will slowly bleed down to critical pressure, thus allowing corona inception, which occurs at lower AC voltages than DC voltages. The possibility of critical pressure must be eliminated from all circuit parts having DC or AC potentials capable of causing corona or arcing. Many design weaknesses can be discovered through testing; however, testing should not be relied on to catch all. Independent analytical review of the circuit design and parts application benefitted the Voyager TWTA voltage doubler design.","Lesson ID":417}
{"Recommendation(s)":"Revise system documentation, making it easier to comprhend, and include personnel training to ensure complete compliance.","Lesson ID":189}
{"Recommendation(s)":"Perform regular updates of cable wiring diagrams to reflect changes in the electrical configuration of units, the spacecraft bus, and GSE. Check unit and system cable wiring diagrams for interface incompatibilities with the current spacecraft configuration immediately prior to the first combined use of flight and GSE cables. If the as-built cables cannot be clearly traced back to the current spacecraft and GSE interface requirements, it may also be necessary to perform continuity checks on the cables.","Lesson ID":1336}
{"Recommendation(s)":"Use heat pipes, preferably aluminum heat pipes charged with anhydrous ammonia, in spacecraft and instrument thermal control applications. This practice enhances the control and flow of heat generated within the spacecraft.","Lesson ID":698}
{"Recommendation(s)":"Chamber and lid were modified to provide a mechanical obstruction that would capture the lid if the V-band was released when the chamber was pressurized. The obstruction permitted the lid to break the seal and relief the pressure but limited its travel \/ separation to prevent any safety issue. The procedures were also modified to make the chamber relieving steps more obvious.","Lesson ID":1069}
{"Recommendation(s)":"Consider all venting mission sequences, plus the possibility of unplanned worst-case venting scenarios, in the spacecraft system design. The thrust neutralizing capability of the attitude control system should be designed to encompass transient venting-induced torque. Ensure that the electronics monitoring spacecraft health supply data during critical operational sequences.","Lesson ID":640}
{"Recommendation(s)":"In the design of circuits, all operating modes must be taken into consideration. Relay circuits should be designed so that the circuit can still apply energy to activate relay coils, even if the relay hangs up between contacts.","Lesson ID":282}
{"Recommendation(s)":"Design a fail safe control system that will stop all movement of the bucket if a critical component fails or fails to perform properly.","Lesson ID":170}
{"Recommendation(s)":"Recommendations from the accident investigation team include both procedural and hardware modifications. Specifically for future STARS missions (and should be implemented for NASA missions), manual FTS control hand over procedures will be modified to avoid the possibility of this happening again. This can be facilitated by the implementation of an automatic sequencer that rapidly performs the mechanics of the hand over and minimizes (or eliminates) the overlap of multiple carriers and thereby prevents adverse receiver outputs from interfering sources. On the missile, the receiver \"MONITOR\" output will be incorporated into the telemetry data stream so that the RSO can check the state-of-health and function of the receiver tone decoders and command logic during the flight without having to use the \"ARM\" command for that purpose. In addition, the team recommends conversion of the existing system to transmit safety commands in a digital format, as opposed to the current analog format, whereby secure provisions may be made to ensure safety commands are only received from intended sources. NOTE: NASA is working with DoD to develop a new technology for FTS that will be digital and encrypted.","Lesson ID":1254}
{"Recommendation(s)":"When writing specifications, take into the account the environment that the equipment is to operate within and write sensible conservative specifications. Once the equipment is built, do not allow waivers to requirements that are derived from the natural environment.","Lesson ID":4416}
{"Recommendation(s)":"Request a copy of manufacturers material lot certification along with distributors conformance certification when purchasing materials.","Lesson ID":451}
{"Recommendation(s)":"Thoroughly train all evaluation teams in the use of any instruments they handle and supply appropriate criteria to evaluate results.","Lesson ID":202}
{"Recommendation(s)":"Add a step to all OMS\/RCS system OMI's that are monitored by control logic, to adjust logic limits prior to changing pressure.","Lesson ID":77}
{"Recommendation(s)":"Perform a review of test history, maintenance performed, operation history, and design safety to determine the optimum maintenance requirements.","Lesson ID":3197}
{"Recommendation(s)":"Evaluate OMS engine nozzle cover holding clamps to determine whether redesign or preventative maintenance should be implemented.","Lesson ID":105}
{"Recommendation(s)":"ISTP (International Solar-Terrestrial Physics Project), including SOHO and NOAA will have procedures in place for the next event to coordinate information to the media. Also, media folks excited by NASA reports about solar events will be encouraged to confer with NOAA\/SEC if the story involves likely terrestrial effects. If you have media interviewers, we suggest you encourage them to consult the Space Environment Center Home Page (www.sec.noaa.gov) for its assessment. This site took 142,000 hits on April 9, and includes statistics on how skillful are the Center's predictions. Both the NOAA and NASA public affairs officers will be engaged from the beginning of the media interest in future events. Some portions of the media have expressed embarrassment at the degree to which they inflated the story and missed the point that these were spectacular observations, because there were new sensors in orbit to see an ordinary event in new ways. There is some hope that educational efforts currently underway with the media will result in maintaining the increased sensitivity to solar-terrestrial observations and events, while ensuring more balanced and correct reporting next time.","Lesson ID":556}
{"Recommendation(s)":"The following process improvements were implemented to ensure the cleanliness of the flight hardware. a) Inaccessible areas, which may trap contaminants in subsequent manufacturing operations, are sealed or provided with access panels, holes, etc. to facilitate cleaning. b) Cleaning techniques have been developed based on the specific hardware being cleaned. c) A FOD prevention focal point has been established. d) FOD prevention focal, Materials & Processes, and Quality Assurance approve all FOD-producing operations. e) Areas adjacent to a FOD producing operation are securely protected. f) Tyvek or packaging film is placed below and around any FOD producing operation to catch the fallout. g) A clean room vacuum is run during the operation to catch any FOD as it is generated. h) The area and the operators are vacuumed after the operation. i) If there are areas, which are inaccessible after the operation, a vacuum or borescope inspection is performed of these areas to ensure there is no contaminates. The vacuum inspection is performed by putting a clean room wipe between the nozzle and the hose and vacuuming the area. j) See lesson learned #1205 for a discussion of FOD control throughout the program and hardware life cycle.","Lesson ID":1275}
{"Recommendation(s)":"Programs should produce an audit plan that formally addresses and documents required audits so that any deviation from these requirements are properly documented by Projects in either a variance (waiver or deviation) or applicable documentation (Acceptance Data Package, Master Verification Plan, Systems Engineering Management Plan, etc.).","Lesson ID":4582}
{"Recommendation(s)":"NASA should create a dependency matrix of all I-loads. Furthermore, it should assess its Space Shuttle and ISS procedures and ensure that they are all fully documented.","Lesson ID":1125}
{"Recommendation(s)":"Replace all similar and same size connectors with keyed or different sized connectors.","Lesson ID":154}
{"Recommendation(s)":"Develop a maintenance concept early in the program life cycle to provide a basis for full maintainability support. It should be used to influence systems design to ensure that attributes for ease of maintenance, minimization of repair and down time, and logistics support will be present in the final design.","Lesson ID":724}
{"Recommendation(s)":"Emphasize the importance of reporting close calls. Make it easy for employees to report close calls.","Lesson ID":531}
{"Recommendation(s)":"Identify and implement improvements in the quality review, inspection, and testing of connectors in proportion to their criticality. Prior to future launches, perform megger checks of all critical wiring harnesses and inspect harnesses to verify quality of installation.","Lesson ID":50}
{"Recommendation(s)":"Responsible system engineers should maintain a log for all components, which have anomalies that are within specification.","Lesson ID":447}
{"Recommendation(s)":"Allow time to fully staff requirements development teams before beginning requirements development efforts.","Lesson ID":10001}
{"Recommendation(s)":"The following recommendations are derived from Reference (1): Assure that a thorough review of all Certification Data Packages accompanying received Ti alloys is performed by trained and experienced Materials & Processes (M&P) engineers, Procurement Quality Assurance (PQA) specialists, or equivalent personnel. Material suppliers should be Nadcap (National Aerospace and Defense Contractors Accreditation Program) certified, and they should be audited and approved by PQA and M&P engineers and placed on an Approved Suppliers List (ASL). Ti materials for flight applications should only be procured from suppliers on the ASL. Ensure that quality clauses regarding material have sufficiently detailed requirements to assure that mill certifications, processing certifications, and testing certifications will be received with material or procured metal parts. All procurements should require that the material type and specifications be listed in the contract. Each drawing should identify the material type and specification in accordance with References (4) and (5). Material testing should be performed on a sample basis to validate the supplier’s material test reports. More information about procedures and processes that help mitigate the procurement of nonconforming Ti alloys can be found in References (1) and (2).","Lesson ID":12901}
{"Recommendation(s)":"Integrated compatibility assessments now performed for externally applied materials subjected to expected fluid releases to preclude any potential degradation and subsequent deleterious effects.","Lesson ID":203}
{"Recommendation(s)":"The careful use of redundancy in Critical Kennedy Space Center (KSC) Ground Support Equipment (GSE) Mechanical Systems ensures reliable operation.","Lesson ID":659}
{"Recommendation(s)":"The recommendations documented in the previous military specification MIL-T-10727 and the current industry specification ASTM B545, such as controlling the type and amount of impurities intentionally added to the plating bath, should be implemented to prevent or minimize the occurrence of tin whiskers. When tin plating is used on mechanical, electrical or electromechanical components, continuous process monitoring (especially of suppliers) must occur to assure that tin whisker growth is addressed and compliance maintained. Additional Key Words: Latent Failure, Material Properties, Sneak Circuit","Lesson ID":924}
{"Recommendation(s)":"Understanding and addressing the design environment, component interactions, and potential failure modes are the keys to high reliability in high performance liquid hydrogen turbopumps for launch vehicle engines. Designing and using a combination of unique sealing, cooling, processing, material selection, and balancing techniques in response to engine design requirements will permit the development, production, and reliable flights of hydrogen turbopumps.","Lesson ID":750}
{"Recommendation(s)":"When developing Mission schedules plan enough schedule and cost contingencies to allow for multiple iterations in the integration of flight detectors with the spacecraft.","Lesson ID":479}
{"Recommendation(s)":"Perform inheritance reviews to span the differences between the previous use of existing spacecraft designs, hardware and software, and planned new usage. Inheritance reviews should include the following assessments: Verification that the inherited hardware\/software designs are compatible with the spacecraft design, mission environment, qualification requirements and product assurance requirements. Verification of the necessity and mission compatibility of design changes and implementation plans. Determination of whether additional protoflight testing will be required for the inherited hardware\/software. Identification of potential risks associated with documented problems of inherited hardware and software. Delta inheritance reviews should be performed when major mission changes occur.","Lesson ID":346}
{"Recommendation(s)":"When operating nominally, ‘non-prime’ computers must provide telemetry regarding their health to the prime computer or to the support equipment upon request. Perform more complete screening of commercial parts, including burn-in of flight parts to eliminate infant mortality flaws. Add additional thermal cycles and erase cycles to the environmental box test program. Due to it’s known low reliability, avoid using NAND flash memory to store critical parameters. Re-architect the function that provides FSW health monitoring to cover more FSW issues, including improving the watchdog timing architecture. Even if NAND memory cannot reliably store data, the spacecraft must be capable of generating (a) real-time telemetry without a file system operational and (b) Data Products from files stored in the RAM File System. Maintain a capability to debug FSW while in “crippled mode” (e.g., operation in a low power state, without the File System, etc.) Implement a minimum level of hardware commands capable of recovering from flight system faults without recourse to FSW. Provide software support for reformatting flash memory to any desired size starting at any address, based on a value received prior to booting.","Lesson ID":11201}
{"Recommendation(s)":"Develop a GSE Integrated Product Team (IPT) that has authority to review GSE designs and help establish GSE quantities and requirements for all GSE. The IPT will make written agreements (BEA's) and\/or contract modifications to ensure multiple copies of GSE are procured when required.","Lesson ID":5044}
{"Recommendation(s)":"Packaging designs, whether new or inherited, need to be reviewed for adequacy; especially when electrical power and thermal aspects of a design can be affected by spacecraft system configuration changes. Manufacturing processes need to encompass ease of manufacturing and inspection aspects. Inspection must be performed by Quality Assurance instead of by an assembler. Adequate temperature margins between qualification temperatures and expected in-flight operating temperatures need to be assured. Consider mission thermal cycle profile in mission design and test.","Lesson ID":387}
{"Recommendation(s)":"The Office of the Chief Engineer, with the assistance of the Associate Administrator for Safety and Mission Assurance, should effect the following activities: For the Space Shuttle and Space Station programs, review all hardware components that are not currently refurbished on a prescribed, certified maintenance schedule, with particular emphasis on hardware that is not readily accessible for inspection. The same Offices should order similar reviews for all other equipment that may be in use for a longer period than intended, including facilities and ground support equipment, with special emphasis on those the failure of which might have adverse consequences with respect to personnel safety and loss of critical assets.","Lesson ID":1478}
{"Recommendation(s)":"For ground processing of a space launch vehicle scheduled for multiple flights, implement a connector mate\/demate and test verification tracking system such as the SCAN system used in the Space Shuttle program.","Lesson ID":3757}
{"Recommendation(s)":"NASA should ensure that the current manufacturing and quality control procedures continue to be rigidly adhered to and conscientiously followed in production.","Lesson ID":1048}
{"Recommendation(s)":"Include nozzles and related components in shelf life surveillance programs.","Lesson ID":466}
{"Recommendation(s)":"Drawings provided by vendors and manufacturers should be as accurate as possible and include adequate pictures of the hardware. Drawings should be dimensioned. Sketches are rarely acceptable. When the IBA was delivered to KSC, accurately dimensioned drawings for the RMS Thermal Blanket System were provided, which alleviated many ongoing problems.","Lesson ID":3656}
{"Recommendation(s)":"Understand the load regime for the WRI application. Plan to test and characterize WRIs to get more accurate structural analysis model predictions. Apply test-correlated WRI stiffness properties for this load range in analysis models. Apply non-uniform damping characteristics to analysis models through damping tables, etc.","Lesson ID":19101}
{"Recommendation(s)":"Design a secondary\/redundant latching system that will ensure that the ET GH2 vent line is held secure.","Lesson ID":187}
{"Recommendation(s)":"Outmoded Design of Space Shuttle General Purpose Computer (GPC) Limit Software and Hardware Upgrades","Lesson ID":1124}
{"Recommendation(s)":"Ensure all lines are maintained with proper insulation and all surfaces are visually inspected for excessive ice build-up prior to clear for launch.","Lesson ID":89}
{"Recommendation(s)":"Use material movement personnel and equipment that have been trained and\/or certified to move JCI. Verify that project personnel involved in preparations for loading and shipping JCI are familiar with requirements for special (e.g., international) shipping. Cognizant personnel should stop unplanned JCI transportation operations until a review by all required JPL organizational participants has taken place. For all planned and unplanned transportation of JCI, including loading and unloading operations, ensure that System Safety, Hardware Quality Assurance (HQA), and Shipping\/Receiving (Reference (7)) have been informed of the operation. (It is acceptable, on a case-by-case basis, for either System Safety or HQA to be present during the operation. This is to be determined as a joint decision between System Safety and HQA.) If use of contracted transportation services and equipment is required, perform a dry run of the operation without moving JCI. Confirm that the transportation company has provided adequate qualified staff, and verify vehicle equipment (e.g., lift gate) functionality during the dry run. When released, Revision 8 of the JPL Flight Project Practices (JPL DocID 58032) will require that each project develop a Transportation Plan to describe project plans for safe transportation of flight hardware and critical support equipment. In addition, transportation plans for the Aquarius project (and future flight projects planning international shipments) should incorporate contingency planning to anticipate the availability of less than optimal transportation resources for JCI.","Lesson ID":2456}
{"Recommendation(s)":"Some type of human error can be traced to nearly every studied incident as a root cause, whether it be an error in the design phase or an error prior to or during operational use of hardware containing hypergols. Humans are most definitely not perfect and even when the most knowledgeable personnel are intimately involved in the design phase (vehicle or GSE) or during an operation, mistakes can be made and critical items can be overlooked. One can deduce, however, that most incidents happen during some sort of dynamic operation. Hypergols tend to be very stable in a static configuration (as long as the compatibility characteristics have been well addressed). An effort should be made to allow for multiple “sets of eyes” to study hypergol system designs, procedures, system configurations, and training plans.). In several of the incidents advance warning (prior to any liquid or vapor release) was available to the technicians in the vicinity of the spill and\/or the engineers that were monitoring from a remote location. The warning indications include off-nominal data (remote or local), off-nominal system characteristics, and\/or local changes that occurred without human intervention. Some of these went unnoticed or were ignored during the operation, thus resulting in an incident. There was advance warning in 19 out of 38 total incidents (50% of the time). This percentage does not include spilled fuel as an advance warning of a fire (five occurrences). Depending on the local environment, there is a reasonable probability that if hydrazine (or one of its derivatives) is spilled, there will be a fire; therefore, the fuel spill itself could be considered an advance warning of a fuel fire. Roughly 42% of the documented fuel spills studied resulted in a fire or explosion. It could not be determined if there was an advanced warning for two of the incidents; therefore, they were not included in the above percentage along with the mentioned five fuel spills. Technicians and engineers should be cognizant of system changes during hypergol operations.","Lesson ID":2196}
{"Recommendation(s)":"Carefully evaluate proper tape to use for each situation, and take steps to ensure that incorrect tape cannot be used.","Lesson ID":536}
{"Recommendation(s)":"The TSS-1R Mission Failure Investigation Board made the following recommendations: use rigid standards for fabrication and handling of the high voltage cable; ensure that the deployer path is free of debris; reduce, through design and operations, the possibility of arcing; conduct electrical integrity tests as close to the flight date as possible; conduct high fidelity tests on critical subsystems; strengthen the integrated systems development approach.","Lesson ID":566}
{"Recommendation(s)":"Verify that a structured, multidisciplinary approach to parts selection, design evaluation, and procurement has been applied prior to committing to a final design.","Lesson ID":675}
{"Recommendation(s)":"Employ a dedicated engineer to assure that the hardware being built matches the ICDs. Ensure that cognizant engineers verify consistancy between their hardware and the MICDs\/ assembly drawings, and provide proper notification of interface changes. Use vendor ICDs where applicable, but do not maintain two sets.","Lesson ID":569}
{"Recommendation(s)":"Adopt and use current, state-of-the-art software processes and tools to manage requirements for software development. Value and foster the collaborative relationship between the customer who uses the software and the developer providing the software to ensure the success of the software project.","Lesson ID":3377}
{"Recommendation(s)":"An obvious recommendation is that the status of the fusing element be verified after the last EED live fire test, before launch, which would stress the fusing element. Another recommendation would be NOT TO USE THIS DESIGN. If it is desired to break all connections to the power source then this could be done with an arm and a prearm single pole elements in each leg of the design or with double pole elements. Best of all options would be to not use this kind of ground fire pulse design AND check the status of fusing element after each use of the circuit and prior to launch. It is crucial that for any designs like that shown the fusing element be checked at least once before launch and after the last test that would stress the fusing element.","Lesson ID":448}
{"Recommendation(s)":"Redesign the ECLSS GO2 panels to eliminate the use of gaseous nitrogen while supporting the flight crew breathing test.","Lesson ID":27}
{"Recommendation(s)":"Consider the use of Pitot-static heating, even in the case of experimental aircraft used exclusively in normally dry, temperate environments.","Lesson ID":359}
{"Recommendation(s)":"In the specification section 01200 Project Meetings, specifically require attendance of the weekly construction meetings by the Contractor's job superintendent.","Lesson ID":749}
{"Recommendation(s)":"Perform comprehensive research and testing prior to manufacturing parts for unique operational environments. Develop more informative tests such as a squeeze test to better differentiate between candidate resins.","Lesson ID":1039}
{"Recommendation(s)":"Future mechanical system designs should attempt to eliminate the need for a torque limiter and any type of clutch\/brake assembly. This is especially true for any actuator that will have a long service life. Ideally the hardware should be designed to withstand the maximum output loads of the actuator. Even with torque limiters, many of the orbiter’s mechanical systems were not completely protected for jam conditions. In a system with an over-center linkage design, there is a huge mechanical advantage as the linkage reaches on-center. As such, the loads in the linkage are high for a relatively low input torque. Analysis showed that the ET door uplock latch system was not well protected by the torque limiter. A jam near the end of the latching cycle would cause the hook to yield before the torque limiter would slip. For future programs\/designs where a torque limiter is necessary, new torque limiter designs should be considered for improved reliability and serviceability.","Lesson ID":2839}
{"Recommendation(s)":"Redesign lifting sling mechanism to prevent stress from being applied to the PPU's operating components during lifting operations.","Lesson ID":85}
{"Recommendation(s)":"Material certifications should be submitted and approved for any kind of painting or coating of equipment. The changes to coating or painting process used at the facility performing the work should be approved and certified to ensure that the facility can perform the requirements according to the specification. The customer should also make a site visit to the facility during the coating process and perform a QC inspection to verify all required steps in the process are being performed.","Lesson ID":2356}
{"Recommendation(s)":"All Firex deluge system valves should be in accordance with industry norms and provided with specific open and closed position markings.","Lesson ID":49}
{"Recommendation(s)":"The ground segment should be capable of determining the co-registration by performing on-orbit operations and processing the data from the sensors.","Lesson ID":1530}
{"Recommendation(s)":"Future awards to new prime contractors, especially small businesses, should contain additional oversight requirements, including delivery of subcontractor statements of work, and a specific plan for flowing requirements to subs. Programs\/Projects should include a requirement for a specific “subcontract requirements flow down” plan to be provided as a deliverable under the contract by the contractor. This required plan should be submitted along with the complete list of contract technical deliverables developed by the requirements office and provided to Procurement. The requirements office should provide the details of what needs to be included in the plan, as well as any other documents (e.g., subcontract SOWs, or other subcontract technical flow down requirements) that should be included in the plan and\/or delivered by the Contractor.","Lesson ID":6756}
{"Recommendation(s)":"1. Get hardware back from flight when and if possible 2. Take and evaluate imagery from each launch when possible 3. Plan for material obsolescence 4. Consult engineers who work with the material and processing closely prior to deciding to launch, especially in return-to-flight circumstances 5. Ensure a robust risk management, hazards awareness, and engineering rigor to S&MA responsibilities as well as depth of knowledge of materials and processes 6. Programmatic decision makers should be required to assess the integrity of their programmatic support and be held accountable for failure to identify, mitigate, and integrate issues that violate requirements","Lesson ID":17903}
{"Recommendation(s)":"Critical design features that reduce joint rotation, improve seal features, provide close tolerances, provide for leak checks, and provide venting are used to improve the reliability of case-to-case and case-to-nozzle field joints for large solid propellant rocket motors. Principal design drivers are the combustion chamber pressure vs. time profile, segment stacking and assembly tolerances, insulation and sealing configurations, launch dynamic loads, flight dynamic loads, and environmental temperatures.","Lesson ID":759}
{"Recommendation(s)":"The area in the vicinity of FADS pressure ports need to be verified to be free of surface imperfections and waviness. Rub a finger across the pressure port in both directions. If no irregularities or waviness is found, then the surface should be flush enough.","Lesson ID":1599}
{"Recommendation(s)":"An independent peer review of every instrument and subsystem is mandatory. There are no exceptions","Lesson ID":1276}
{"Recommendation(s)":"Hazard analyses should clearly identify any assumptions that limit the analysis scope. Assumptions should be assessed as a minimum during an integrated review. “Black box” analyses must clearly identify any services, conditions, circuitry, signals, or other active interface outside the box and a rationale presented for not including them in the analysis. The rationale will need to address failure scenarios and contingency operations in addition to nominal operations.","Lesson ID":1367}
{"Recommendation(s)":"Make attempts to limit the ROIC noise to values close to the theoretically predicted limits.","Lesson ID":1595}
{"Recommendation(s)":"Continue to support the nascent, but better defined, radiation effects research and development program.","Lesson ID":1142}
{"Recommendation(s)":"Design a handling sling device that will self-adjust to the load as it is lifted and keep it steady throughout the lifting operation.","Lesson ID":92}
{"Recommendation(s)":"The JPL Deep Space Atomic Clock project team realized brazing development was necessary to ensure successful hardware manufacturing and assembly, and took steps to explore the best brazing process for their application. The lessons learned and the JPL approach should be considered a model for how NASA should work with vendors in the future. From the JPL-Deep Space Atomic Clock best practices that apply to these lessons: • Pre-Qualify vendors that have both a low-rate, R&D capability as well as a high-rate production side. o Fund the vendor to assess their current processes for applicability to new work. o Don't compete process development unless you have a huge flight quantity order. • View the vendor as a development partner. Their success is your success, and vice versa. • Use multiple vendors for process development to maximize potential for success. o This requires additional and focused team support for each vendor • Interface with the vendor at the detailed engineering level. Don't depend on high-level company contacts, especially for highly technical discussions. • Structure Sub-Contracts or PO's such that NASA owns the resulting development process. o This may seem to cost more, but it lessens the difficulty with cross-fertilization of knowledge between vendors and enables more flexibility later on in competing brazing services using the developed process. • Use specific, step-wise PO's or contract deliverables to work through the Non-recurring engineering (NRE) portion. o Predicate flight deliverables on success during NRE work. o This moves the risk to NASA, which is advantageous for small, specialized vendors. • Use ample runs of coupons to be evaluated by both vendor and NASA. • Execute tight team coordination between vendor and NASA (weekly) during NRE phases. • Interact with vendor's 3rd tier vendors to ensure the process will not be sub-sub-contracted. In summary, this team of SMEs uncovered a common thread throughout most of the projects assessed – the lack of brazing development can result in inadequate process results and substandard parts. Brazing is a very specific, potentially complex process that is also extremely useful to join materials. Brazing cannot and should not be viewed as the best, lowest cost process for all applications. Mechanical joints, welded joints, or the elimination of joints in addition to brazing must be considered in the design. As a side note, after addressing these aforementioned issues, it might be a misnomer to refer to this team as a ''tiger team\". It is recommended that this team of brazing SMEs be referred as the Brazing Investigation and Response Team (BIRT). Though this team can perform as a true tiger team, the team believes NASA's best interests would be served by this using the \"BIRT' as a floating (as opposed to standing) Agency resource to proactively address and\/or be available to advise projects on an as needed basis.","Lesson ID":14001}
{"Recommendation(s)":"Government mandatory inspection points should include incoming\/receiving inspections of critical GSE. Any GSE that interfaces with flight hardware, or resides in spaceflight environments with flight hardware, should be inspected to ensure it meets requirements and complies with the engineering documentation.","Lesson ID":6757}
{"Recommendation(s)":"Reference (3) recommends: Question whenever you or your group are very sure of something (“known knowns”) for PDR. Make sure you perform all the steps of requirements tracing and verification, even when it is easy. Identify “key” requirements for special treatment. “Key” is determined by the customer: determine consistent definitions and how you use them. Conduct a deep vertical review (Level 1 to Level 5) of the design against “key” requirements; this should include a “roll up” of verification from Level 4 to Level 1 for PDR. Ensure that “key” requirements flow down to at least Level 4 and are verified at Level 4. Revisit “key” requirements at all gate reviews: do not drop a key requirement easily. Identify the polarization on drawings or by means of any other methods of design capture used. This should be treated similar to attitude control phasing. Include predictions of test results that verify requirements in procedures. Does not include calibration (Note: This requires both a comprehensive understanding of the end-to-end flight instrument requirements, and the details of the integration and test approach and instrumentation.) Repeat peer review when there is a moderate\/significant design change, including a thorough review of the change documentation. The review board membership should have the ability to penetrate the technical design and the fundamental measurement being taken. The project team (and not just the Principal Investigator and the contractor system engineer for the instrument) should have the responsibility and resources to penetrate the instrument technical design. The Engineering Change Request process should be strengthened to be technically rigorous with regards to the validation of all levels of requirements that were affected by the change. Reinforce the requirement for PDR and CDR to explicitly show that ”the design meets its requirements with margin” by means of objective evidence. This needs to be done for not just Level 4, but also for Levels 3, 2, and 1 (i.e., roll up performance to demonstrate that the requirements are met). Provide build-to-print projects, or those with significant inheritance, direction on what body of work needs to be revisited or reviewed.","Lesson ID":17001}
{"Recommendation(s)":"This practice will increase equipment reliability and decrease maintenance by preventing unnecessary repairs to equipment, personnel time loss, and schedule impact due to liquid intrusion. Facilities that contain electrical and electronic equipment (e.g., motor control centers, power supplies, programmable logic controllers, etc.) should be designed with adequate protection from overhead oil or water sources. Oil sources can come from an overhead crane gearbox that may leak and water intrusion from an overhead pipe or valve.","Lesson ID":879}
{"Recommendation(s)":"Label valves, fluid lines, and critical equipment in all equipment rooms. Establish an incident command structure that will function at all times, not just during normal working hours. Prepare emergency response plans for identified significant hazards or threats prior to the occurrence of such an event.","Lesson ID":1192}
{"Recommendation(s)":"Material selection is an important aspect of design. Often the success of the design is critically dependent on a material or materials performing as desired. This is especially true in the case of advanced composite materials with polymer matrices reinforced with carbon or aramid (Kevlar®) fibers. The important considerations necessary for a proper selection of a fiber-reinforced polymer composite material in NASA spacecraft and satellite structures include fiber material, fiber reinforcement form, fiber volume, matrix material, ply lamination, processing, cost, database, health and safety factors and end-item properties.","Lesson ID":689}
{"Recommendation(s)":"A thorough peer review of flight software code builds, including test results for the satellite bus and all instruments is mandatory","Lesson ID":1294}
{"Recommendation(s)":"See lesson(s) learned.","Lesson ID":626}
{"Recommendation(s)":"In two-phase systems, the flows must be characterized to understand the differences between 1-g test and 0-g performance. Differences in behavior as they affect critical components and functionality must be understood so that the limits of 1-g testing can be known.","Lesson ID":26703}
{"Recommendation(s)":"Design and install drain pans to catch and contain leaking hydraulic fluid beneath hydraulic components.","Lesson ID":118}
{"Recommendation(s)":"A uniform methodology for the installation of all fasteners should be provided early in the design phase of the program. This fastener specification should be imposed on all vendors\/contractors responsible for hardware assemblies on the space vehicle. Where applicable, locking threads with running torques and final torques should be imposed on all assembly drawings. Additionally, the Shuttle Orbiter hatch actuators are essentially multi-geared torque multipliers containing numerous small parts which cannot be easily maintained. Despite several successful ground cycles of the hatch actuator, the problem was not identified until flight, and was not repairable in-flight. Future designed should give serious consideration to less elegant designs. Designs with less complexity, lower parts count, and the ability for in-flight maintenance, in-flight repair or in-flight work-around should be given a higher priority in design trade studies. It is easy to design something more complicated with added features and additional failure modes, but more difficult to build it to be simple and robust with fewer failure modes; future designers should strive for the latter.","Lesson ID":4417}
{"Recommendation(s)":"Use active leveling when lifting\/mating flight elements. Active leveling requirements should be designed into GSE used for lifting\/mating flight elements.","Lesson ID":4999}
{"Recommendation(s)":"Develop and implement procedures to return explosive devices to their original configuration, fire it as part of a test plan or send it to Explosives Ordnance Disposal.","Lesson ID":1582}
{"Recommendation(s)":"Require aproprieate operations instructions to verify that all orbiter vent doors are in the standard purge configuration prior to start of venting.","Lesson ID":84}
{"Recommendation(s)":"Develop a methodology for streamlining the failure analysis process.","Lesson ID":221}
{"Recommendation(s)":"Maintain an integrated overall systems perspective so that build up of individual parts work as designed particularly in view of modifications and rework.","Lesson ID":2716}
{"Recommendation(s)":"Based on the above observations and LL the following recommendations have been developed to help others plans for successful Project lifecycle transitions: 1. Ensure that a potential project has PM representation at the earliest possible time (ideally the proposal phase). 2. Ensure that all proposals go through a formal approval process that includes representation from all project management elements. Enlist the expertise from Center resources such as the System Management Office, Chief Engineer, Training Office, and Mission Assurance Organizations. 3. Senior Management should aid the blending of science and PM teams by communicating the rules-of-engagement (ROE) and expectations to all parties involved. Furthermore, any commitments the Senior Management make to accompany and aid a new PM should be followed through or else the new PM and their direction will loose credibility. 4. Metrics indicating the progress of a project's transitional period should be defined, collected, and used to maintain the project on track. 5. The temporary and periodic use of transition\/change management experts and facilitators should be considered for high-risk transitions, especially those requiring cultural changes or major changes in business practices. 6. The transition ROE should distinguish between \"rescue\", \"maintenance,\" and \"change of direction\" PM changes. These different situations that necessitate a PM change should be used to determine how significant procedure changes should be. The new PM under rescue situations should be supported by Center-wide experts\/resources and not left on their own. 7. The existing and incoming project team members should be willing to compromise on procedure rigor and formality such that the focus is on risk reduction and results. Short cuts and processes with less rigor may be appropriate under certain circumstances.","Lesson ID":1345}
{"Recommendation(s)":"Follow your organization's procedures for handling of cryogenics. Operations with liquid nitrogen should only be performed using the buddy system and by experienced and qualified personnel familiar with the hazards and safety precautions. Resist the urge to rush in and rescue a downed co-worker; 60% of the confined space fatalities happen to the would-be rescuer. If rescue is necessary, use proper protective\/breathing equipment. Confined Space Entry requirements and procedures must be followed when working with nitrogen in areas that are not well ventilated. Improve visibility through the use of portable ventilation fans to disperse the vapor cloud surrounding the operation with necessary. Consider use of portable oxygen monitors when working around cryogenic fluids.","Lesson ID":550}
{"Recommendation(s)":"Provide comprehensive pre-launch coordination between the flight project and the Deep Space Network to evaluate initial acquisition signal modes and levels and their strong-signal effects on the station receiving equipment. Ensure that telecommunication engineers a) apprise the flight project of the likelihood of the expected post-launch indications of feedthrough- and saturation-related, downlink signal degradation; b) support the project during initial downlink signal acquisition to distinguish between apparent and real degradation; and c) provide the Flight Control Team with procedures for responding to this anomaly. Reduce the likelihood of errors in the monitoring of station data and the evaluation of the associated predicts during critical mission sequences. This may be accomplished by modifying signal level and signal-to-noise ratio displays to indicate to the FCT when these indicators may be affected by feedthrough or saturation effects. A less preferred alternative to this alert is to modify the link models to mark the predict values that may reach levels subject to feedthrough and saturation.","Lesson ID":1531}
{"Recommendation(s)":"NASA must not allow programmatic constraints\/limitations in cost schedule drive compromise into a thorough risk assessment and testing program.","Lesson ID":1319}
{"Recommendation(s)":"When selecting batteries for space flight applications, the following requirements should be considered: ampere-hour capacity, rechargeability, depth of discharge (DOD), lifetime, temperature environments, ruggedness, and weight. Many batteries have been qualified and used for space flight, enhancing the ease of selecting the right battery.","Lesson ID":714}
{"Recommendation(s)":"Do not allow contractors or other workers to work on a pipeline while conducting high pressure test. Reduce pipeline pressure to 40 PSI to 60 PSI to locate a leak. Use silver solder on 2\" and larger copper pipes. Strictly enforce the three phases of control in construction: preparatory inspection, initial inspection, and follow-on inspection. Have a safety meeting with the construction crew a day or two before a long weekend or holiday.","Lesson ID":1096}
{"Recommendation(s)":"To minimize possibility of improper braking, provide crew training with braking techniques for various landing profiles. Prior to orbiter leaving the OPF, perform anti-skid brake inspections and check electrical power\/pedal calibration integrity and hydraulic control valves. A fire fighting capability is mandatory at all planned landing sites should a hydraulic fire occur after wheel stop.","Lesson ID":128}
{"Recommendation(s)":"Ensure that any surfaces that are clamped together are clean and free of tape, tape adhesive residue, oil, dirt, or other lubricating elements.","Lesson ID":43}
{"Recommendation(s)":"Management should improve their approach for assuring that employees consider the safer means of performing a task before they begin. The approach should be clearly communicated to all through a formal work permit process for assessing the risk of working on electrically energized systems as defined in NFPA 70E,paragraph 110.8(B). The contractor should establish a formal and auditable permitting process for energized electrical work per the guidelines of NFPA 70E and OSHA requirements NASA should prepare and execute a surveillance plan for providing oversight of contracts that address compliance with contractual safety requirements (e.g., National Fire Protection Association (NFPA) 70E, Standard for Electrical Safety in the Workplace) and federal law regarding safety (i.e., OSHA Regulations). A hazard analysis should be performed for all critical work that includes an overall risk assessment, PPE evaluation, safe operating procedures and appropriate training. Supervisors\/managers should ensure that employees are knowledgeable of the systems they work with and tasks that they perform, providing training where necessary. When it appears that tasks cannot be performed in a safe de-energized state, the task should be presented in an open forum with management and knowledgeable personnel for further assessment.","Lesson ID":2696}
{"Recommendation(s)":"When designed for EMI 'cleanliness', power converters and EMI filters should be matched: bought from the same company and in the same series.","Lesson ID":543}
{"Recommendation(s)":"Consider implementing a system in which all mishaps, regardless of actual loss or injury, are assessed by a standing panel of accident investigation specialists. The panel would have the authority to elevate the classification level of any mishap based on its potential for harm.","Lesson ID":1237}
{"Recommendation(s)":"Ensure uniform treatment of all systems and subsystems in technical and management reviews regardless of heritage. Require comprehensive independent peer reviews on all subsystems and systems.","Lesson ID":595}
{"Recommendation(s)":"Use simplified models of the structure as appropriate during early design work but switch to higher fidelity models when the design is fairly mature before going into the final analysis and verification phases.","Lesson ID":1223}
{"Recommendation(s)":"Consider ground testing due to removal and replacement of line replacement units (LRUs) when including and locating check valves in flight fluid systems.","Lesson ID":3221}
{"Recommendation(s)":"Match COTS tools to project requirements. Recommendation: It is essential to conduct a thorough evaluation of project requirements and to compare these requirements against COTS features and vendor capabilities. Test and prototype COTS products in the lab. Recommendation: Prototype COTS hardware and software in a lab setting as similar to the field environment as possible. Develop the prototype system in stages in the lab environment with on-going integration and testing through the design»s maturity. Install, operate and maintain the COTS field and lab components. Recommendation: It is essential to be physically present when performing on-site installations, and that support\/maintenance contracts be in place for COTS hardware and software. It is also recommended that a lab-based prototype system be maintained and staffed to permit the test of enhancements, upgrades and configuration changes to COTS software prior to field delivery of these upgrades.","Lesson ID":1346}
{"Recommendation(s)":"Ensure that the four steps listed above in the “Description of Driving Event” are performed on all flight system I&T programs. On system testbeds where it is feasible, perform a walkthrough of the testbed configuration at the beginning of each I&T work shift.","Lesson ID":1520}
{"Recommendation(s)":"Add mandatory inspection point to procedure to verify mechanical stop mounting screws are properly torqued.","Lesson ID":454}
{"Recommendation(s)":"This guideline provides checklists taken from Government-Industry Data Exchange Program (GIDEP) files to be used as a measure to avoid commonly experienced problems in transistor-to-transistor logic (TTL), complementary-metal-oxide-semiconductor (CMOS), and memory circuit design applications.","Lesson ID":680}
{"Recommendation(s)":"Establish individual system cleaning techniques to assure system status after final servicing and install filters with change-out capability.","Lesson ID":244}
{"Recommendation(s)":"Reducing the risk of Electrostatic Discharge (ESD) during Space Transportation Systems (STS) processing requires an understanding of the problems and proper reliability practices or controls for various conditions\/situations. When conductive materials are present, proper bonding and grounding techniques are essential. When non-conductive materials (i.e., wood, paper, glass, plastics, etc.) are present, these materials must either be eliminated or properly selected or treated for the particular application and use. Another important factor in ESD control is the percent relative humidity (RH) which should be monitored and regulated\/controlled, where feasible.","Lesson ID":685}
{"Recommendation(s)":"Increase the diameter of the \"O\" ring and redimension the \"O\" ring groove to provide optimum \"O\" ring squeeze while preventing \"O\" ring entrapment. (In the Solid Rocket Motor (SRM), the primary \"O\" ring diameter was increased to 0.290 in and the groove was decreased in width from 0.378 inch to 0.345 inch.)","Lesson ID":951}
{"Recommendation(s)":"Require system reviews be conducted after major contract changes to ensure all required inspection and maintenance activities are scheduled in accordance with NASA, NFPA and manufacturer requirements. Create a process to periodically review contractor compliance with NASA, NFPA, and manufacturer requirements for inspection and maintenance of critical fire suppression system components. Create a process to periodically review monitoring requirements of the Firex system and pumps. Contractor personnel monitor PRV discharge pressure when pumps are operating. Install an alarm system in the VAB Utility Annex to warn diesel pump operators of an over-pressure condition. Monitor Firex system pressure in the LCC with an alarm on the KCCS water console. If the alarm activates, personnel can direct diesel-driven pump operators to shut the pumps down and isolate the LCC from the VAB Firex supply loop. Require pump operators to be in direct communication with SPOC personnel on the KCCS water console while operating the pumps. For future fire suppression system installations, at the beginning of the construction project, contractors should be briefed on the importance of following contract requirements for installation of the fire suppression systems, including manufacturer’s recommendations. The entire VAB \/ LCC fire suppression system should be reviewed to identify single failure points in all stages of operation.","Lesson ID":5936}
{"Recommendation(s)":"Training and constant awareness on the part of the technicians are essential to achieve proper and consistent fastener installation. Accurate measurement of the grip length every time is critical to the proper installation of fasteners. This operation can seem simple and even inconsequential, so it can easily be taken for granted.","Lesson ID":3260}
{"Recommendation(s)":"Avoid the use of combustible porous materials, such as wood, as tools for working on or in conjunction with solid propellants.","Lesson ID":344}
{"Recommendation(s)":"Revise Center Aircrew Flight Operations Manual (DCP-O-300) guidance to ensure compliance with the following aviation safety documents: NPG 7900.3A, \"Aircraft Operations Management,\" 41 CFR Part 101-37, \"Government Aviation Administration and Coordination,\" 41 CFR Part 301-2, \"Transportation Allowable,\" OMB Circular A-126, \"Improving the Management and Use of Government Aircraft,\" NPD 8700.1, \"NASA Policy for Safety and Mission Success,\" NPD 8710.2B, \"NASA Safety and Health Program Policy\", NPG 8715.3, \"NASA Safety Manual.\" The revised DCP-O-300 shall encompass the supervisory process which will provide insight and oversight for aircrew conducting flights to ensure that they are current and properly experienced by accomplishing the following: a. Establish clear qualifications and requirements for all categories of pilots and other aircrew members. b Revise the supervisory approval authority for sorties to ensure Flight supervisory approval process has adequate insight into proposed flight activity. c. Establish requirements for aircrew pairing to ensure the required experience level is met. d. Establish training syllabi for all aircraft to ensure that no aircraft idiosyncrasies are overlooked. e. Provide training requirements that are clear and complete for aircrew to meet currency requirements for aircraft specific initial flight and to requalify after the aircrew has had an extended stay away from the aircraft. f. Define requirements for scheduling non-essential aircrew for flights. g. Establish documentation and an annual review process that ensures the aircrew's training and experience is sufficient for the category of aircraft to be flown. h. Establish policy that delineates instructor and pilot checkout requirements for each aircraft. i. Establish procedures that shall ensure management policies and DCP-O-300 requirements are reviewed annually, realized and adhered to by all aircrew. 2. Review and revise the Aviation Safety Program to ensure the Center has aircrew conducting flights that are current and properly experienced. 3. Provide mishap training in public relations area.","Lesson ID":1377}
{"Recommendation(s)":"See lesson(s) learned.","Lesson ID":634}
{"Recommendation(s)":"Emphasize the potential for the scaffolding to tip over if the disassembly is not preformed in the proper order. Have a knowledgably person (i.e., trained in assembling and disassembling scaffolding) present and in charge but not actively performing the work. This will enable the person in charge to see the \"big picture\". Provide additional training for employees to avoid future events. Make training specific for the task at hand. Based on the uniqueness of this set up, time should have been devoted to the potential hazards involved in the take down.","Lesson ID":1318}
{"Recommendation(s)":"Replace the original IRT fan blades with a modified set of spares.","Lesson ID":477}
{"Recommendation(s)":"The need to re-qualify an inherited spacecraft subsystem design for application on a new mission is widely recognized, but careful consideration should be given to the need to re-qualify the capabilities of the subsystem contractor: For development of a subsystem that is dependent on novel technology, persevere in devising an incentive-based contract acceptable to both parties. When inheriting a subsystem design that has not been built for many years, consider verifying manufacturability by fabricating a qualification model. When inheriting a design for a build-to-print, ensure that all of the essential resources are actually available to be inherited-- drawings, tooling, fabrication procedures, models, personnel, etc. Assess whether the contractor has the management stability and dedication to the project needed to meet contract commitments. Place a priority on ensuring that TRDs, MICDs, and ICDs are completed and released in time for the technical reviews that require the documents. The NASA Center should provide all of the supplementary hardware attached to the Center-provided components to be delivered for integration and test (I&T). To mitigate I&T problems with controlling a complex subsystem interface, assure that the spacecraft contractor provides a dedicated individual (see Reference (4)) to oversee the spacecraft side of the interface. Exercise great care in the identification and elimination, where possible, of test-as-you-fly exceptions.","Lesson ID":3396}
{"Recommendation(s)":"Develop and release the launch procedure early enough for comprehensive testing prior to launch. Rigorously test and verify all telemetry channels, and their alarms, that will be used during launch and flight. Ensure documentation such as telemetry definitions is kept up-to-date.","Lesson ID":609}
{"Recommendation(s)":"Three general methods of ultrasonic testing can be used singly or in combination with each other to identify cracks, debonds, voids, or inclusions in aerospace materials. Each has its own unique application and all require certain precautions or techniques to identify potentially flawed hardware. This practice describes selected principles that are essential in reliable ultrasonic testing.","Lesson ID":765}
{"Recommendation(s)":"Fabric type Electrostatic Discharge (ESD) wrist straps containing conductive metallic fibers should not be used in the assembly, fabrication, or handling of electronic hardware. Nonshedding ESD wrist straps are available. Special care is required from all personnel who work in close proximity to critical hardware to avoid contamination of any type. All aspects of fabrication and test of critical hardware should be carefully reviewed before initiation of an activity.","Lesson ID":301}
{"Recommendation(s)":"Note that there are multiple candidate design measures for ensuring propellant vapors never meet, including: A propulsion subsystem design that uses separate pressurant tanks, similar to the Europa Clipper design. Use of check valves that prevent vapor back-flow. For example, such check calves were used successfully by the Cassini project, which employed a combination of latch valves and pyro valves like Juno, but the Cassini valves were no longer available for acquisition by the Juno project. Incorporate pyro valves in both propellant sides and reduce the time the tanks are not isolated. In designing spacecraft propulsion subsystems for long-duration missions: Adhere to JPL’s test-as-you-fly (TAYF) principle when flight-qualifying check valves. (That is, life testing would likely have detected the Juno oxidizer leak that led to either FORP build-up or excessive exposure of the check valve to oxidizer.) This recommendation may be very difficult to implement because it requires full mission-duration, high-fidelity testing lasting years. If TAYF is not feasible for a project, the propulsion subsystem should ensure positive isolation of the propellant vapors throughout the mission. This is in contrast to the current practice of seeking to limit the propellant vapor contact to benign concentrations, partly by means of pyrolitic isolation valves. Projects should continue to incorporate sufficient downlink telemetry to ascertain the health and functionality of the propulsion subsystem.","Lesson ID":28105}
{"Recommendation(s)":"After completion of the current planned Block II certification test program, conduct a certification extension test program that will demonstrate the highest thrust level for safe continuous operation achievable by the Block II configuration. This program should attempt to achieve at least the 109% power level.","Lesson ID":1006}
{"Recommendation(s)":"All external areas of spacecraft flight hardware should be designed with consideration for assembly and handling operations. In particular, sharp or pointed corners, which could easily snag protective clothing should be avoided. This should be a topic for preliminary and critical design reviews at subsystem, instrument and system levels. Physical surveys should be conducted early in the assembly operations to identify hardware that is susceptible to handling damage. Protective guards and other procedural safeguards should be developed early before damage occurs. In situations where these safeguards are not possible or adequate, a second technician (buddy system) should be assigned to monitor and assist in the operation to provide another level of protection.","Lesson ID":355}
{"Recommendation(s)":"Specify in work document that vent doors must remain in standard purge configuration and all on-board vent door circuit breakers remain \"open\".","Lesson ID":125}
{"Recommendation(s)":"Ares and Space Launch System (SLS) external thermal environments are developed using a six digit numbering system that is tied to the axial and circumferential location on the vehicle, and the type of body point being analyzed. This system has proven adaptable to both programs. This system, or a similar one, should be used on all launch vehicle programs. Six digit system based on vehicle location and type of point Used for Ares I, V, I-X, and SLS design, test and flight gauges Different prefixes, allows easy comparison and correlation Held up well over 7 years of use Figure 1: Body Point Numbering Chart","Lesson ID":6357}
{"Recommendation(s)":"Review test procedures and hardware for all mechanisms to assure testing is done with the mechanism in the full flight configuration (i.e., test as you fly). Modify procedures and drawings to assure adequate service loops are provided in cross hinge cabling. All ground deployment testing should be conducted with the cross hinge wire harness and any insulation in the flight configuration and not redressed after stowage of the deployment mechanism for flight. If any change\/redressing of cabling is necessary after deployment testing, conduct a walkout of that deployable before stowage for flight. Deployments\/walkouts should be videotaped and mechanisms should be photo-documented in the deployed and final stowed position.","Lesson ID":909}
{"Recommendation(s)":"Conduct a thorough analysis, together with the National Security Agency, to determine the level of computer security required by the Agency, the level of security that can be expected from the system and its most serious vulnerabilities. Also require all major mission or safety critical programs to have a qualified third party conduct a computer vulnerability analysis of their designs as soon as possible.","Lesson ID":1150}
{"Recommendation(s)":"Redesign flags to lock and remain stationary (until acted upon by external force) as fluid raises magnetic float to interact with each flag magnet. Filter all fluid loaded in LT's to eliminate particulate contamination which may collect on chamber walls. Install float assemblies weighted to a fluid SG of approx. 1.0 so fluid concentrations will register maximum level and avoid tank over filling.","Lesson ID":120}
{"Recommendation(s)":"Emphasize to all individuals involved in the work task that proper procedure execution is mandatory. Access to the OPF deluge system Zones 1 through 6 should be positively controlled (e.g., a lock and key arrangement). Personnel with access should be fully trained and certified in the operation of the system. A policy should be developed outlining which operations\/ activities require PTBS. This policy should be rigorously implemented when developed. As part of the reassessment of the use of this system, all control panels should be properly labeled. A positive position for open versus closed should be readily visible on all valves. The manual arming and firing valves should be oriented to the industry norm and provided with specific open and closed position markings. Access to OPF deluge system Zones 1 through 6 should be positively controlled (e.g., a lock and key arrangement). Personnel with access should be fully trained and certified in the operation of the system. The policy of free access to the water deluge control panel key should be reviewed. Evaluate the risk of inadvertent OPF deluge system water flow with the current system design. The water deluge system valve repair task was not observed by Engineering, which could have prevented the deviation to written procedure by the facility water technicians. When malfunctions on critical facility\/GSE systems occur which could affect flight hardware, a clear policy is required that outlines what level of management approval is needed to initiate repairs. The OPF area warning system should be split between Bay 1 and Bay 2, enabling the NTD to only evacuate one OPF bay when the emergency does not warrant evacuating both bays. Non-redundant GSE should be identified, and workarounds developed if this GSE is destroyed or incapacitated for an extended period of time.","Lesson ID":1183}
{"Recommendation(s)":"The mechanical bonding of the heatsink to the printed wiring assembly results in a unitized structure, providing the components with the support necessary to prevent the reported damage. The elimination of unapproved tooling and processes ensures that electronic components will not possess latent damage that would result in reduced reliability.","Lesson ID":1202}
{"Recommendation(s)":"See Lesson(s) Learned.","Lesson ID":1300}
{"Recommendation(s)":"For bipropellant propulsion systems, ensure that supplier data on engine and engine component acceptance tests are used properly in determining the flight propellant loads and that consumption data are available to mission planners for use in accurately predicting the onset of oxidizer depletion. Be sure to verify the level of helium or nitrogen pressurant gas saturation in the propellants. If a method that time averages the reduction in acceleration from steady state values is used to determine the onset of oxidizer depletion and to trigger burn termination, select an appropriate threshold deceleration value based on actual test data.","Lesson ID":572}
{"Recommendation(s)":"The Board strongly recommends that the two Agencies proceed immediately with a comprehensive review of SOHO operations addressing issues in the ground procedures, procedure implementation, management structure and process, and ground systems. This review process should be completed and process improvements initiated prior to the resumption of SOHO normal operations. The recommendations are described below in detail. GROUND PROCEDURES An ESA and NASA review of the process for SOHO operational procedure change should be implemented forthwith. The review should critically assess the process from beginning to end. The review should include matters such as who can initiate a change, who agrees it should be made, how is the modification process monitored, how is it validated, how is it introduced into operations, how it is signed-off, how are the users of the procedure informed of the change, and how are users trained on the new version. All SOHO procedures modified since launch should be identified and subjected to a thorough review of the changes made and their verification and validation status. The review should be led by ESA and supported by MMS, NASA, and the FOT. This review should be completed before the resumption of routine operations. If there is any doubt about a procedure, it should be re-validated. PROCEDURE IMPLEMENTATION NASA should perform an immediate comprehensive audit of all ISTP on-going flight operations activities to assess conformance to contractual requirements addressing areas such as leadership, configuration management, roles\/responsibilities, anomaly handling, and general procedure implementation and validation. The activities pertinent to SOHO should include ESA in the review. ESA and NASA should review the decision authority for real-time divergence from agreed upon ground or spacecraft procedures. In the event that a problem is encountered during any procedure execution, the decision authority for the subsequent action must be clearly defined. Spacecraft safety must never be compromised. It is critical that NASA should review the relevance of selected metrics to determine adequacy for contractor performance evaluation. MANAGEMENT STRUCTURE AND PROCESS ESA and NASA should review the allocation of their responsibilities for the operation of the SOHO mission, as defined in the STSP MOU, Program Plan, and SOHO Mission Management Plan. Assessment should be made as to how these responsibilities have been undertaken by both parties. Changes should be proposed and implemented where appropriate. In particular, ESA's responsibilities for the technical integrity and safety of the spacecraft and science instrumentation and NASA's responsibilities for Ground Segment infrastructure and the conduct of the mission in accordance with the approved Flight Operations Plan should receive critical focus. This review should be preceded by internal reviews in both Agencies and completed prior to return to normal operations. It is anticipated that the review should result in an improved Mission Management Plan. ESA and NASA should re-assess staffing to ensure it is commensurate with the complexity and criticality of the SOHO mission and consistent with the updated Mission Management Plan. The staffing should be strengthened as required. Surge capability should exist to support non-routine and contingency operations. NASA should perform a risk-based analysis of operations plans to determine the level of insight\/oversight appropriate for joint, cooperative, and PI missions with special attention to accountability. GROUND SYSTEMS All operational timelines should be planned and validated well before implementation with proper attention to risk assessment and contingency planning. The operations scripts (the string of procedures used by the FOT) for other than routine science operations should be put under configuration control and any change formally approved by ESA and NASA. Each time such a script is changed, the whole script should be validated. Flight operations should verify response to spacecraft configuration changes and critical commands to ensure proper execution. Flight operations should verify configuration prior to initiating critical spacecraft activity to ensure it is consistent with planned events. ESA\/ESOC should lead an independent assessment of the capabilities of the NASA SOHO simulator and provide recommendations for suggested maintenance and enhancements. The FOT should review the current database to ensure that all critical parameters are flagged as out-of-limits (and preserved) if they violate values as defined in the ESA provided satellite users manual. If possible, automatic monitoring should be extended to all telemetry. An ESA and NASA board should review all outstanding Ground System Problem Reports and the plans to close them. ESA and NASA flight operations personnel should be conversant with both the ESA and NASA systems to the maximum extent possible to form a more synergistic, integrated team.","Lesson ID":664}
{"Recommendation(s)":"While making threaded joints assure that all threads are clean before torquing fasteners. See Description of Driving Event for critical information.","Lesson ID":500}
{"Recommendation(s)":"Provide winch and cable arrangement for safely extending\/retracting platforms from mate\/demate device side access platforms.","Lesson ID":29}
{"Recommendation(s)":"Remeasure all case segments in inventory to determine reuse acceptability and require measurements to be retaken during refurbishment procedures.","Lesson ID":224}
{"Recommendation(s)":"Finding: The procedures at Stennis Space Center (SSC) are designed to provide maximum flexibility and adaptability. Each procedure attempts to anticipate all possible situations which leads to very voluminous and complex procedures that are difficult to follow. Recommendation: Restructure and re-format the SSC procedures to reduce complexity, ambiguity and to enhance the probability of being understood by technicians and inspectors prior to performing the work. Consider individual planning for unique jobs with the aid of computers and include\/adopt either the KSC or Canoga Park system or elements thereof. Finding: The initial release of a SSC procedure is formally controlled, however, subsequent modifications in the field are not, and the responsibility for establishing the options is unclear. The system relies on redlining and DNAing major sections by technicians, inspectors, engineering, and quality engineering to custom fit the procedure to the specific circumstances at hand. Technicians and inspectors routinely DNA and redline procedures. In some cases, the hardware is not subsequently under the control of the person selecting the DNA option. Recommendation: Procedures should be reviewed and approved by engineering for accuracy and revision as required for the identified task prior to release to the floor. Decisions affecting hardware configuration should be made by engineering in the course of the review; not left up to the floor technicians and inspectors. DNA\/NA options to be exercised on the floor should be limited to those actions where results are immediately verifiable and obvious. DNA\/NA options which require decisions where the results are not under the control of the affected line personnel should be disallowed, and if situation changes, new planning should be issued. A procedure deviation system for initiating deviations to correct errors\/oversights would be helpful. Deviations should be reviewed prior to the use of a procedure. Redlines should be limited to minor pen and ink changes not affecting intent, e.g., typographical errors. Finding: Disciplined implementation of existing procedures was inadequate by floor technicians and quality assurance personnel. Technicians performed five procedural steps in the CCVA procedure (Rework #49) that, if properly accomplished, would have disclosed the missing hardware. The QA inspector stamped four of these five. Three other steps were performed in this procedure that would have possibly disclosed the deficiency. The procedure was clear in these areas and the careful accomplishment of these actions with all parties properly fulfilling their roles would have prevented this problem. Recommendation: Personnel performing operations must fully understand the importance of their tasks and consequences of incorrect action(s). They must understand the significance of their stamps on the planning whereby they certify and agree to the accomplishment\/verification of the specific task(s). Technicians and inspectors should not stamp work they have not personally witnessed. Reinforcement of these responsibilities through additional training\/orientation by supervision appears to be warranted to assure the proper level of discipline is in place. Finding: Performance in accordance with the current procedural system does not assure that the hardware configuration is under control through all phases of disassembly\/reassembly. Recommendation: The procedural control of hardware configuration needs to be addressed and changes instituted to assure the hardware configuration is known and under control at all times. This should apply to the transfer of hardware status from one type of paper to another, to procedures controlling the hardware transfer, storage, issuance, and to the procedures for verifying configuration integrity. Finding: A major SSC planning document deficiency is the absence of a list of parts required to start the job and of parts to be left over after the job. Recommendation: Incorporate in planning a list of required parts and a list of parts to be left after the job. Finding: The existence and location of flight and test hardware on test stand A-1 appears to be uncontrolled. The uninstalled coupling was found on level 5. There was a line assembly on level 5 that belonged on level 8. On level 8, a shim was found that should have been left in building 3202. Recommendation: Institute a system that inventories and controls the location of test and flight hardware on all test stands. A preferred approach would be a centralized location rather than multiple locations. The parts crib should be a controlled access area with an individual responsible for inventory of incoming parts and issue to technicians. Parts should be segregated and identified in the crib in such a manner that they can be unambiguously located and retrieved for a particular job\/engine. Finding: Flight engine 2032 was shipped from building 3202 to the A-1 test stand with a considerable amount of open work and a sizable box approximately 4 X 8 X 4 feet with loose parts. The exact configuration of the engine as shipped was not clearly defined and the absence of parts lists did not force reacting to an unaccounted left-over part like the coupling. Recommendation: Discontinue the practice of shipping flight engines with open work unless the work is related to high pressure pumps. Provide an inventory list of loose parts shipped with the engine and to be installed, and a list of parts to be removed from the engine and centrally collected prior to hot fire testing. Institute a system that reacts to parts left over and unaccounted for. If parts to be installed are shipped separately, they are to be identified on the inventory list not as being in the shipping box but as still to be delivered. A verification system should be in place at the engine position that provides assurance of hardware configuration. Finding: Technicians and inspectors interviewed did not know that the actuator which was to be installed was new and being installed for green run purposes. It appeared that the working people in general are not being briefed as to long term objectives. Recommendation: Establish an information system such that also technicians are aware of long term objectives and not just near term objectives of getting dates, paragraphs stamped off, and the paper closed. Finding: No clear identification of a responsible development engineer having full responsibility for the successful accomplishment of a given task. Recommendation: Assure the clear identification of a lead development engineer and full delineation of his responsibilities for each job. Finding: Integration of Government Agency and contractor procedures is inadequate as evidenced by the existence of conflicting instructions concerning mandatory inspection points. Recommendation: The Government Agency letter dated November 24, 1987, concerning a post activity closed paper review of DNA\/NA operations having a Government Agency review within them should be rescinded.","Lesson ID":1340}
{"Recommendation(s)":"All missions must develop detailed crew training processes that ensure crew inputs and human factors are efficiently provided into all system designs. All systems requiring crew interface must be tested prior to being used on-orbit in an environment that includes members of both the flight and ground crew.","Lesson ID":1613}
{"Recommendation(s)":"Install seamless wrought iron piping with a bituminous coating protected by magnesium anodes for corrosion resistance.","Lesson ID":241}
{"Recommendation(s)":"See attached PDF.","Lesson ID":26803}
{"Recommendation(s)":"The fabrication or test organization should thoroughly inspect all MGSE for fastener engagement and specified torque prior to delivery for use by a project. Where feasible, threaded components that are to be placed under tension should be designed with a positive locking device. Otherwise, fastener heads should be spot bonded or torque-striped, as appropriate, to enhance visual inspection of thread engagement. Flight projects should also conduct thorough visual and physical inspections of MGSE prior to each individual use (Reference 3). These inspections should be documented in appropriate procedures, such as JPL Assembly and Inspection Data Sheets (AIDS) for lifting critical hardware. Personnel safety should be addressed, as appropriate, by all procedures. In addition, all test personnel should constantly remain at a safe distance during operations involving suspended loads.","Lesson ID":914}
{"Recommendation(s)":"Review the written procedures and the laboratory Chemical Hygiene Plan for the task. Perform job hazard analyses for all laboratory tasks. Wear protective clothing (goggles, gloves, coat) and work in a clean well-ventilated fume hood. Keep the sash down when reactions are in progress. Never take aqua regia out of the hood. Only prepare the amount you need for immediate use and destroy any excess in the hood in which it was prepared. Aqua regia can be destroyed by cautious and careful dilution with water. Use a large waste container and add the aqua regia to the water, which will produce a less hazardous and less reactive waste. Never store aqua regia and never put it in a closed container, since evolved gases will cause a pressure build-up and possible explosion. Label waste container to remind employees of specific waste. Schedule a frequent waste pickup disposal. This will prevent overfilling of the container and will promptly remove the hazard from the work area. Assess the physical characteristics of any mixture through literature searches, professional consultation, or direct test\/check out of the mixture both prior to and subsequent to loading the reaction system especially for the first time. Be aware of the limitations of relying on material safety data sheets (MSDS) and other literature to assess the hazardous characteristics of a mixture. MSDS do not traditionally address interactions between a mixture's chemical components except as broad classes (acids versus bases, oxidizers versus reducing agents, or organics, etc.).","Lesson ID":945}
{"Recommendation(s)":"NASA should complete its evaluation of a 109% power setting for intact aborts as soon as practicable and reevaluate the ability of the SLWT to accommodate this higher power setting.","Lesson ID":1078}
{"Recommendation(s)":"Careful coordinated pre-flight analysis by both the Navigation and Spacecraft areas is needed to estimate the size and uncertainties of these effects, to establish the necessary operational interfaces, and to estimate the scope of the operations task. Spacecraft designs must be reviewed with an eye to avoiding impingement problems. If impingement is suspected, a test similar to the Voyager impingement test should be planned and executed early in the flight.","Lesson ID":424}
{"Recommendation(s)":"To prevent detonation of fuel in propulsion systems due to the compression of hydrazine and its ignition by pyrovalve blow-by: Use non-pyrotechnic valves such as latching valves, or Use a zero blow-by pyrovalve design, and\/or Fire a pyrovalve only when there is a vacuum downstream of the valve.","Lesson ID":591}
{"Recommendation(s)":"If your organization requires DBAN software for the sanitation of drives before excess, it is well worth your time to load Parted Magic prior to attempting to run DBAN. There are other methods that could be used for disk sanitation. While researching, we found a degauss method of hard drive erasing that seems like it would be very time effective, especially if there are many drives to sanitize.","Lesson ID":7016}
{"Recommendation(s)":"Design a status tester and jumper verification device to ensure proper jumper connections of the PRLA prior to interfacing with the orbiter.","Lesson ID":87}
{"Recommendation(s)":"PRIMARY CAUSE - THE HYDROGEN (H2) PURGE VENT PORT ON ORBITER OV-104 WAS CAPPED. Finding 1: The H2 purge vent port was capped although there were no steps in OMI V1093 Post Operations Instruction #3 to cap the vent. Recommendation: An alert should be widely circulated to all technicians and quality inspectors emphasizing the criticality of rigorously following procedures. The alert should include the necessity to obtain a deviation to the work document to perform any work (including usual shop practices that alter configuration of the vehicle or ground support equipment [GSE] not specifically identified in the OMI. Finding 2: None of the personnel involved (two mechanical technicians and a quality inspector) were aware of the criticality of the H2 purge vent port remaining clear and open at all times. Recommendation: Precautionary notes should be included in OMI V1093 relative to not capping critical vents that must remain clear and open. All OMI's should be reviewed to identify such vents and appropriate precautionary notes incorporated. Placards should be utilized on the vehicle to identify critical vents that must remain clear and open. Finding 3: System training and certification relative thereto are not required for technicians or quality inspectors working on the Orbiter. Recommendation: System training and knowledge should be made part of certification requirements for all technicians and quality inspectors and should be one of the primary considerations for pay increases and promotions. System training should be made available during off-shift hours. A systematic review of all training and certification requirements should be accomplished across the contractor organization. Currency and proficiency training should be a major consideration. Finding 4: The two mechanical technicians and the quality inspector assigned to perform OMI V1093 Post Operations Instruction #3 had no previous on-the-job training or experience performing this task. Recommendation: Technicians and quality inspectors should not be assigned to a task they have not previously performed without the supervision of a system engineer, supervisor, or another experienced technician who has performed the task. Finding 5: With the exception of the part number, the nomenclature on the \"bulkhead\" fitting did not agree with the nomenclature in the OMI. Recommendation: Orbiter and GSE displayed nomenclature should be reviewed to ensure it is consistent with the OMI's. Finding 6: Operation and maintenance instructions are reviewed and approved by several organizations\/contractors. This review and approval process involves system engineering, quality engineering, and safety. After engineering approval, portions of the OMI's are handed over to the technicians to perform without any requirement for further engineering involvement or direction. Recommendation: Station system engineering personnel in the OPF to witness and direct the conduct of their respective OMI's. CONTRIBUTING CAUSE: FAILURE TO INVESTIGATE THE LACK OF H2 FLOW AND TO GENERATE AN INTERIM PROBLEM REPORT (IPR). Finding 7: The second shift fuel cell system engineer did not prepare an IPR for either of the anomalies, i.e., the failure of the 02 reactant valve to close on command and the lack of H2 flow with the H2 reactant valve closed and the purge valve open. Recommendation: Re-emphasize to engineers that IPR's must be prepared and documented real time for all anomalous conditions. OBSERVATIONS 1: The midbody mechanical supervisor and lead mechanical technician were off work the night of the mishap. The midbody lead electrical technician was supervising the mechanical technicians. He was not familiar with the capabilities of the personnel or the task being performed. Recommendation: In the absence of a discipline supervisor and lead technician, supervision should be delegated to the next senior technician within that discipline on the shift. The delegation and chain of command should be clearly understood. 2: On March 19, during OMI V1093 Post Operations Instruction #3 on Orbiter Columbia, OV-102 (OPF High Bay 1), the H2 purge vent port was also capped. An experienced technician sent to review the work found the purge vent port capped and directed the cap be removed. The incident was reported to the supervisor but there was no shop-wide awareness. The inadvertent capping was neither discussed at \"tailgate\" meetings nor were engineering and quality notified. Recommendation: Any improper performance of an OMI step should be documented and generate a review of that OMI by the shop supervisor, engineering, and quality to determine if the document needs to be revised. When improper work practices are discovered an alert should be generated and circulated within the technician, engineering, and quality organizations. These alerts should be discussed at weekly \"tailgate\" meetings. Engineers should attend technician \"tailgate\" meetings to discuss system issues or problems related to processing which are of interest to both groups. 3: A walkdown of the area was not performed prior to fuel cell venting. Recommendation: A walkdown should be performed by engineers in the OPF prior to initiating an OMI, significant tasks, or subsequent to configuration changes affecting future work. Walkdowns should be accomplished in a timely manner for the OMI steps to be performed. 4: Deviation 37-01 was not logged at the work control station and the first fuel cell venting was attempted per OMI V5RO1, step 37-005. Two active work authorization documents (WAD's) existed at the beginning of first shift, April 4, to vent the fuel cell (PR PV6-156255 and OMI V5RO1, step 37-005). The fuel cell system engineers on first and second shift, respectively, each worked the venting procedure on different WAD's. Recommendation: Deviations generated to WAD's must be logged into work control as they are generated in order to ensure work is accomplished in accordance with current and authorized procedures. The need for a coordinated work plan between shifts should be re-emphasized to all personnel. 5: Quality inspectors are assigned work on an indiscriminate basis by a call board system. Recommendation: A quality supervisor should assign work to quality inspectors based on their experience and knowledge. 6: The remote location of the control rooms in the Launch Control Center (LCC) some distance from the OPF creates a natural barrier between engineering and technicians making communications and observation of work difficult. Recommendation: When new control rooms are provided they should be located within the orbiter processing facilities. 7: There is not an effective procedure to identify the constraints open grounds will have on systems. Recommendation: A procedure should be established to notify system engineers that removal of electrical grounds will be a constraint to testing. 8: Engineering log books are extremely important in the shift turnover communication process. They are sometimes hard to follow. Recommendation: Emphasize to engineers the need to keep log books neat and orderly and to highlight anomalies. 9. The NASA\/JSC engineers (the design center) reviewed all the vehicle OMI's for XSC checkout after the Challenger accident. The Presidential Commission recommended the design centers become involved in the review of operating and maintenance instructions utilized at KSC. Design center participation, including concurrence in changes affecting Criticality 1 and 1R items, was also directed by the Associate Administrator for Space Flight's letter of March 24, 1986, Strategy for Safely Returning the Space Shuttle to Flight Status. NASA\/JSC concurred in the OMI process until approximately one year ago. An agreement was then made with KSC that JSC would no longer concur on the OMI's or changes thereto. A KSC contractor has been concurring as the design center's representative and is responsible for coordination with the Orbiter subsystem managers at JSC. Recommendation: The NASA\/JSC subsystem managers should review all OMI's for compliance with the Orbiter Maintenance Requirements and Specification Document (OMRSD) and for clarity. There should be provisions for the subsystem managers to review all OMI's and changes thereto on a periodic basis. NASA\/KSC engineering should validate all OMI's to ensure clarity and that they are sufficiently definitive for utilization by operating personnel. They should also be reviewed for compatibility with good shop practices. 10. NASA\/JSC subsystem managers do not generally review contractor training material. Recommendation: The NASA\/JSC subsystem managers and flight controllers working with NASA\/KSC engineering should review all Lockheed KSC training courses for engineers, technicians, and quality personnel, relative to their respective subsystems, for accuracy and adequacy. 11. System training material is not effectively shared between KSC and the design centers. Recommendation: A joint training group with representation from all centers should be organized to ensure the effective sharing of material and resources between JSC, KSC, MSFC, and Stennis. 12: Observation Training is not identified as a major function within the contractor organization. At the Johnson Space Center, 183 civil service and contractor personnel are assigned to an organization devoted exclusively to Shuttle training. They are responsible for training approximately 550 personnel per year. The number of people assigned to Shuttle and Ground Support Engineering, Orbiter Processing and Shops, and SRM&QA within the contractor organization totals approximately 2500 personnel. Training for these 2500 personnel is provided by the contractor training organization (a part of Logistics) totaling 41 people. Training should be and will be a major activity throughout the life of the Space Shuttle Program at KSC. Recommendation: Training should be designated as a separate and major functional entity at the same level as the engineering, operations, logistics, and quality groups within the contractor organization.","Lesson ID":1182}
{"Recommendation(s)":"Investigate and eliminate potential problems in manufacturing process, final delivery and material cutting of the o-ring.","Lesson ID":177}
{"Recommendation(s)":"The committee investigating the mishap recommended that prior to use with future models, parachutes procured by NASA-LaRC should be checked for appropriate and safe design; definitive specifications should be included with every parachute ordered by NASA-LaRC; and, any instance of change to parachute packing or repacking procedures, or to the parachute design, should require NASA-LaRC approval prior to implementation.","Lesson ID":517}
{"Recommendation(s)":"The Interface Control Document (ICD) should contain all relevant data on potential fluid properties. All relevant fluid properties data for potential cross system contamination, leakage, or ingestion should be included in the liquid propulsion system ICDs. Any future engine test programs should explore the limits of potential gas ingestion so that a value other than zero can be quoted should the need arise.","Lesson ID":6146}
{"Recommendation(s)":"Maintain access to key spacecraft and operations design staff, so they can be consulted in the event of in-flight surprises. (JPL project team members and experts were imbedded with the system subcontractor spacecraft team, facilitating face-to-face interaction to ensure smooth communication and rapid decision making.) Give project managers whose experience is mainly with the project development phases some operational experience so they appreciate that the design tradeoffs they make can have operational implications. Provide robust fault protection and redundancy to allow Operations to trade functional redundancy for flexibility and performance. Facing catastrophic mission failure, persevere to bring in the most experienced, imaginative, and determined NASA Center and subcontractor team personnel. Provide ample margin so the project need not depend upon luck. Never give up-- unless they take away your charge number.","Lesson ID":22502}
{"Recommendation(s)":"Prior to creating facility contamination control environmental requirements, an evaluation of operational processing events\/activities is necessary to assess the impact each event\/activity has upon the exposed flight hardware and the facility environment.","Lesson ID":3336}
{"Recommendation(s)":"Practice: Power line filters are designed into power lines (power buses) at the inputs to payloads, instruments, subsystems, and components.","Lesson ID":646}
{"Recommendation(s)":"Analysis of the design, load application and stability of a lifting fixture assembly, and the center of gravity of the load to be lifted, must be rigorously performed to verify and demonstrate that the final configuration is stable. Ensure qualified, experienced personnel are on site during critical hazardous operations.","Lesson ID":267}
{"Recommendation(s)":"Protect systems that utilize mercoid switches from pressure transients to prevent inadvertent activation. Provide a means to attenuate pressure transients and fluctuations to assure the integrity of water deluge system components.","Lesson ID":47}
{"Recommendation(s)":"The projects should allocate enough resources so that JPL personnel can adequately monitor the parts screening methods as well as contractor-specified manufacturing processes and test procedures. Contingency planning for the mission operations phase should take into consideration potential partial failure modes, particularly where functionally redundant units are involved.","Lesson ID":373}
{"Recommendation(s)":"Scale-up of the ASRM propellant manufacturing plant should be scrutinized closely to ensure that safety and schedule are not compromised.","Lesson ID":201}
{"Recommendation(s)":"Lead engineers should approve only protected light sources when there is a potential for damage to flight hardware.","Lesson ID":68}
{"Recommendation(s)":"Proceed with full funding for the proposed Block I Space Shuttle avionics upgrades as rapidly as possible.","Lesson ID":1151}
{"Recommendation(s)":"Load cell strings must be assembled so that the string components are held together tightly. The design of the string should include fastener torque specifications and these specifications should be followed during assembly. Designers should consider this problem when specifying tolerances for screw length and counterbore length. In one instance where this problem was discovered, it was determined that both were barely in tolerance, yet the combined effect of a long screw and deep counterbore produced a small gap.","Lesson ID":18701}
{"Recommendation(s)":"See Lessons Learned","Lesson ID":903}
{"Recommendation(s)":"When designing or reworking hardware employing capped inserts, it is critical to verify that correct screw length is specified and used.","Lesson ID":437}
{"Recommendation(s)":"System drawings were updated; greater emphasis was applied to enforcing the deenergization verification steps of existing lockout\/tagout procedures.","Lesson ID":19}
{"Recommendation(s)":"Perform a thermal analysis of each electronic assembly to the piece-part level. Provide a heat conduction path for all parts whose junction temperature rise exceeds 35oC above the cold plate.","Lesson ID":809}
{"Recommendation(s)":"Design a GN2 purge detection system that could be monitored electronically and sound an audible alarm at the operations desk if the purge should fail.","Lesson ID":147}
{"Recommendation(s)":"Power distribution circuitry should be designed to preclude inadvertent powering of wax thermal actuator heaters. Wax thermal actuator drive circuitry should be designed to prevent a failure that leaves actuator heaters powered for an excessive period of time.","Lesson ID":612}
{"Recommendation(s)":"Use a fracture mechanics formulation to estimate the design fatigue life and reliability of metallic or ceramic structural and mechanical components subject to fluctuating stress. For reusable spacecraft, update the reliability analysis based on in-service inspection and repair data.","Lesson ID":700}
{"Recommendation(s)":"Strive to accelerate scheduled releases for PCS software. Be prepared to delay schedules, if necessary, to assure that MEIT testing and astronaut training with the flight loads of PCS software are thorough and complete.","Lesson ID":1165}
{"Recommendation(s)":"Based on observations from the Lewis Program, the Board offers the following recommendations in order to enhance mission success in future programs performed under this new paradigm: Balance Realistic Expectations of Faster, Better, Cheaper. Meaningful trade space must be provided along with clearly articulated priorities. Price realism at the outset is essential and any mid-program change must be implemented with adequate adjustments in cost and schedule. This is especially important in a program that has been implemented with minimal reserves. Establish Well Understood Roles and Responsibilities. The Government and the contractor must be clear on the mutual roles and responsibilities of all parties, including the level of reviews and what is required of each side and each participant in the Integrated Product Development Team. Adopt Formal Risk Management Practices. Faster, Better, Cheaper methods are inherently more risk prone and must have their risks actively managed. Disciplined technical risk management must be integrated into the program during planning and must include formal methods for identifying, monitoring and mitigating risks throughout the program. Individually small, but unmitigated risks on Lewis produced an unpredicted major effect in the aggregate. Formalize and Implement Independent Technical Reviews The internal Lewis reviews did not include an adequate action response and closure system and may have received inadequate attention from the contractor¹s functional organizations. The Government has the responsibility to ensure that competent and independent reviews are performed by the Government, the contractor, or both. Establish and Maintain Effective Communications A breakdown of communications and a lack of understanding contributed to wrong decisions being made on the Lewis program. For example the decision to operate the early on orbit mission with only a single shift ground control crew was not clearly communicated to senior TRW or NASA management. The Board believes that, especially in a \"Faster, Better, Cheaper\"program these working relationships are the key to successful program implementation. Although this report necessarily focused on what went wrong with the Lewis Program, much also went right due to the skill, hard work, and dedication of many people. In fact, these people completely designed, constructed, assembled, integrated and tested a very complex space system within the two-year goal and probably came very close to mission success.","Lesson ID":625}
{"Recommendation(s)":"Instruct crane operators to use calculations made from standard ANSI publications to determine safe sling working loads.","Lesson ID":239}
{"Recommendation(s)":"1. Ensure that adequate design and inspection criteria are developed to provide for sufficient cable clearance within an enclosure. Implement the inspection criteria in both acceptance and preventative maintenance inspections. 2. Conduct a site-wide survey and identify all panels meeting the following criteria: a. Locations between the building transformer and the main service entrance panel where the secondary cables have no low voltage protective device coverage (excludes switchgear and motor control centers or any panel with upstream low voltage protective device). Low voltage is defined as above 50 volts and below 600 volts. b. Locations where fire pumps are fed directly from the transformer secondary and do not have any low voltage protective device coverage. This is required by National Fire Protection Agency standards. Locate pump panels without upstream low voltage protection and add warning labels to panel. 3. Using proper PPE, de-energize all identified panels and inspect for: a. Proper conductor strain relief per manufacturers recommendations b. Conductor routing away from sharp panel edges and access panel fastener penetrations. Bundle, saddle, or provide non-conductive isolation barriers as necessary to properly route conductors. 4. Include specific instructions for inspections of physical service entrance cable routing and clearances from panel enclosure contact in all scheduled maintenance and repair procedures. 5. Evaluate present five-year maintenance cycle of main service entrance panels and determine if this cycle should be shortened with respect to usage conditions, i.e., recloser operations, vibration, etc. 6. Future project designs must locate the incoming conduits in relation to the termination at the main breaker such that the number of electrical cable bends is minimized and proper clearances from panel enclosure are maintained. 7. Establish schedule and procedure to survey similar panels or service feed configurations for locations of electrical cables within panel and proximity to dead front. Schedule outages, perform field investigations and make necessary adjustments.","Lesson ID":1716}
{"Recommendation(s)":"Fully consider the cost\/risk tradeoff of not qualifying critical inherited designs for new operational uses. Potential loss of function of a redundant element may be preferable to obtaining no telemetry during high risk events.","Lesson ID":432}
{"Recommendation(s)":"Avoid the use of encapsulants in gradient freeze experiments with indium antimonide.","Lesson ID":1919}
{"Recommendation(s)":"DC drive motor over-speed detection using a voltage sensing relay.","Lesson ID":673}
{"Recommendation(s)":"For a complete description of an intensity-modulated fiber optic microphone, see the paper, \"Fiber Optic Sensor for Measurements of Pressure Fluctuations at High Temperatures\", by Allan J. Zuckerwar, NASA Langley Research Center. The paper appeared in the ICIASF '89 Record.","Lesson ID":514}
{"Recommendation(s)":"Identify potential critical items early in projects for Ground Support Equipment (GSE) as an input to hardware and software design activities. Perform Failure Modes and Effects Analysis (FMEA) for \"as built\" configuration GSE identifying Critical Items. Prepare Critical Items Lists (CIL's) and present the resulting risks to management for acceptance. Use CIL's to initiate control of the risks associated with the critical items and to request a waiver or deviation from program requirements.","Lesson ID":649}
{"Recommendation(s)":"Assure that contamination on internal rocket motor case walls is acceptably low by (1) performing bonding tests on \"witness\" samples which have been subjected to the same processes as the flight hardware, and, (2) inspecting the case walls by techniques such as ultraviolet light to determine if the cleanliness level is equal to or better than the witness samples.","Lesson ID":329}
{"Recommendation(s)":"Design a mechanism that will prevent the ET GH2 vent arm from rebounding back into an SRM.","Lesson ID":157}
{"Recommendation(s)":"Safety must be NASA's highest priority. S&MA managers and support personnel should be involved at the on-set of the program development, and staffing projections should be commensurate with the roles and responsibilities as defined by the program requirements. The absence of clearly defined success criteria for Program reviews is detrimental to the Program end products, and potentially provides a negative impact to safety. Do not overlook S&MA requirements. Without functioning working groups, the contractors' interpretation and implementation of S&MA requirements were questioned and debated at each program review.","Lesson ID":1511}
{"Recommendation(s)":"Select and apply thermal coatings for control of spacecraft and scientific instrument temperatures within required ranges and for control of spacecraft charging and RF emissions.","Lesson ID":727}
{"Recommendation(s)":"It is important that every fiber connector be inspected and cleaned prior to mating. An acceptable fiber optic connector endface will be properly polished, clean, and free of scratches, cracks, and spalls. Clean fiber optic components are a requirement for quality connections between fiber optic equipment. One of the most basic and important procedures for the maintenance of fiber optic systems is to clean the fiber optic equipment. Any contamination in the fiber connection can cause failure of the component or failure of the whole system. Even microscopic dust particles can cause a variety of problems for optical connections. A particle that partially or completely blocks the core generates strong back reflections, which can cause instability in the laser system. Dust particles trapped between two fiber faces can scratch the glass surfaces. Even if a particle is only situated on the cladding or the edge of the endface, it can cause an air gap or misalignment between the fiber cores which significantly degrades the optical signal. When you clean fiber components, always complete the steps in the procedures carefully. The goal is to eliminate any dust or contamination and to provide a clean environment for the fiber-optic connection. Remember that inspection, cleaning and re-inspection are critical steps which must be done before you make any fiber- optic connection.","Lesson ID":1876}
{"Recommendation(s)":"Provide the basic foundational documentation at the onset of the project. Some items that should be included are: - A simple Concept of Operations description, even in pictorial form. Reference to this ConOps will allow for the team to stay on the same page and make good decisions when issues arise. - A schedule, readily accessible to the entire team, updated twice a week during high-volume work periods such as testing. Schedule Developer will be best able to perform this by integrating into the team and following the work. This will relieve the rest of the team from the burden of reporting status. - A listing of all identifiable risks and at a minimum a skeleton of a mitigation strategy to be followed in the event that the risk turns into an issue. This will give all team members a basis upon which to make decisions and execute tasks more quickly while staying aligned with the agreed-upon process. The team should have a schedule and a designated scheduler. The schedule should be updated when information is available and during team meetings. Flexibility should be built into all plans and procedures, to allow for alternate paths when problems arise. Careful thought should be given to the necessary approval process for changes to agreed-upon plans to ensure that proper authorization is given without burdening the flow of work with unnecessary steps. Existing Organizational Work Instructions (OWI) should be reviewed and modified as appropriate to allow for the required flexibility. The ISERV team implemented a bi-weekly integration status meeting toward the end to meet pre-ship schedule. The meeting proved to be beneficial and kept the hardware in flow with little to no wait time because the team knew what to expect and when it was to occur. This could have been started a little earlier perhaps. Seek out local help with database inputs before going to JSC for help. Check internally to see if another project, such as MSG, might have experience with the system\/database. Before management commits to a project like ISERV, there needs to be a thorough assessment of the job performed by Engineering along with the Project Office. The core engineering team that will be responsible for the project needs to be in place and a part of the development of a project proposal. Explicitly define and agree to the qualification requirements and processes up front, involving all stakeholders in the agreement negotiations at the start of the project. Get the requirements in writing. Have adequate funding with reserves for the project Establish a checklist or other guidance to define best practices for developing COTS-inclusive systems at the Center, where to find integrated system requirements, and how to identify risks introduced by using COTS equipment. Work processes tailored to dealing with configuration, information, and certification of COTS equipment should be put in place to assist projects in anticipating development, testing, and certification challenges.","Lesson ID":7217}
{"Recommendation(s)":"In particular, palladium-containing substances (or other catalytic material) should not be utilized in future designs for sliding wipers, relay contacts, etc. to avoid a repetition of this problem.","Lesson ID":438}
{"Recommendation(s)":"Because of the difficulties involved in ground testing spacecraft attitude and articulation control systems in a one G field, it is extremely important to conduct thorough reviews to verify math models of hardware and to understand the implications of simplification of math models on performance in flight. These reviews should involve hardware, analysis, software and systems engineers. Finer resolution display scales should be used around worst-case conditions to identify subtle instabilities.","Lesson ID":358}
{"Recommendation(s)":"To validate the ability of crewmembers to actually use the various available HUT sizes, crewmembers in each of the several size combinations\/configurations should be required to perform normal and emergency functions in training mockups to demonstrate that full capability is available to each.","Lesson ID":1114}
{"Recommendation(s)":"The table below lists the specific recommendations, identified by the JPL Operations Working Group (Reference (1)), to be considered by ongoing and future flight projects. Categories Operations Recommendations Development Recommendations Test-bed\/ simulation\/ modeling Maintain a rigorous review process of the test-bed results; functionally verify whenever possible Implement a fast simulator (faster than real-time) for operations Implement a test-bed time jump capability Work on spacecraft models and simulations while still in Assembly, Test, and Launch Operations (ATLO) and continually update throughout operations. Historically, flight rules come in late in the development process as subsystem experts are involved in testing of their flight hardware. Spacecraft state\/parameter tracking Implement an automated flight system state\/parameter tracking system that ties the uplink command system to the downlink telemetry (What was commanded – What was expected – What was seen). Do not allow invisible onboard application-to-application commanding resulting in no visibility of parameter states. Ensure every command has a default value. Ensure all commandable states can be seen in downlink telemetry. Operations sustainability Perform and document a thorough tabletop planning session at the beginning of each uplink activity to include as a minimum beginning\/ending spacecraft states, detailed verification\/validation plans, transmission constraints, and contingency commands. Look for ways to bring back technical experts for subsystem parameter reviews prior to critical events. (Loss of corporate knowledge is a significant risk item as the operations continues.) Perform a detailed technical review of the impact to other subsystems in the presence of a spacecraft hardware anomaly (as part of the daily operational activity of the flight team). Plan and fund for software tool modifications and periodic hardware upgrades to keep up with the flight system changes as flight operations goes along (including extended missions). Perform a detailed technical spacecraft subsystem review when transitioning from the primary to the extended mission, including key documentation. Set up a schedule to update operational procedures on a regular basis (quarterly, semi-annually, annually), and engage flight team members in the activity. Maintain the spacecraft idiosyncrasy document throughout the testing and operations phase of a project. Maintain an operational risk management process throughout operations. Include as part of a project's closeout activities a thorough review and possible changes to the spacecraft states with a view toward a follow-on mission. (The spacecraft should be placed in a known and documented configuration in anticipation of follow-on activity.) Operations development Incorporate extended mission requirements early in the design of flight and ground systems. Develop requirement for an operations environment that is easily maintained and documented. This may include the implementation of a model based engineering effort. Identify flight operational tools early in the development process to ensure availability for flight operations. Consider performing a wholesale SEQGEN revitalization effort. Operations training Loss of experienced personnel needs to be supplemented with a well-defined training program for new flight team personnel coming into operations. Implement a flight team training program throughout the mission operations phase including: anomaly response exercises, flight team schools, operational error case studies, review of operational procedures, etc. Implement a flight team certification process tied, in part, to the training program. Certification should assess the readiness of each individual to perform his\/her assigned duties. Team members should be recertified on a regular basis (yearly or at most every other year). Human Factors Look for ways to keep the flight team engaged in the day-to-day operational activities. Complacency can easily creep in as the mission proceeds and all is going well. While overtime and team fatigue may be inevitable at times (ATLO comes to mind), managers should monitor team fatigue levels and relieve overloads whenever possible. Watch out for individuals oversubscribing themselves. Configuration Management Maintain a rigorous configuration management process with emphasis on command products, testbeds, and operational procedures (nominal and contingency). Operability infusion Include operations personnel on the project systems engineering team early and throughout the project development phase, to facilitate a flight system design that is less error-prone to operate (Reference (3)). Develop and impose appropriate operability requirements on both the flight and ground systems. Establish an operability working group during development to track and address operability issues. Expert systems Look for ways to automate flight software reasonableness checks with a goal of checking the intent of a command or sequence load.","Lesson ID":8302}
{"Recommendation(s)":"Further investigation and research to be done to study the detailed modeling and analysis needed to establish the data buffer management and compression criteria.","Lesson ID":1594}
{"Recommendation(s)":"It was found that a combination of noise, back-feeding through the outputs of a logic device, and ground bounce were able to produce sufficient voltage below the components' manufacturer specified limit of -0.5 volts that resulted in the FET-based device “latch-up”. The outputs then went into a tri-state condition, allowing the output voltage to gradually rise to the rail voltage. This produced a destructive condition for the H-bridge output transistors. Also, the component manufacturer determined that once the logic device was exposed to this “latch-up” condition, it became more susceptible to future latch-ups","Lesson ID":1603}
{"Recommendation(s)":"Install redundant separate high temperature cut-offs on the oven power supply with appropriate alarm systems.","Lesson ID":78}
{"Recommendation(s)":"Conduct highly instrumented real-time long term tests and accelerated testing of space flight batteries using automated systems that simulate prelaunch, launch, mission, and post mission environments to verify suitability for the mission, to confirm the acceptability of design configurations, to resolve mission anomalies, and to improve reliability.","Lesson ID":802}
{"Recommendation(s)":"Voltage and Temperature Margin Testing (VTMT) is the practice of exceeding the expected flight limits of voltage, temperature, and frequency to simulate the worst case functional performance, including effects of radiation and operating life parameter variations on component parts. For programs subject to severe cost or schedule constraints, VTMT has proven an acceptable alternative to conventional techniques such as worst case analysis (WCA). WCA is the preferred approach to design reliability, but VTMT is a viable alternative for flight projects where trade-offs of risk versus development time and cost are appropriate.","Lesson ID":771}
{"Recommendation(s)":"A well-defined risk management system is mandatory for objectively identifying and tracking project risks","Lesson ID":1296}
{"Recommendation(s)":"Affix hazard warnings \/ identifications on contaminated components. Designate work orders as hazardous if tasks involve hazards. Safety training videos should include details for identification and handling of hypergolic propellants. Train employees on requirements for hazardous waste storage.","Lesson ID":8016}
{"Recommendation(s)":"Ensure that any process modifications are considered for implementation in all units that were previously distributed or deployed - not just to those units processed after the process was modified.","Lesson ID":1}
{"Recommendation(s)":"For a detailed presentation of this work, see the paper, \"Extensional and Flexural Waves in a Thin-Walled Graphite\/Epoxy Tube\", by John Dorighi (Mechanical Engineering Student, University of Colorado, Boulder, Colorado 80309-0424) and William H. Prosser, NASA Langley Research Center, Hampton, Virginia 23665; and, Michael R. Gorman, Aeronautics and Astronautics, Naval Postgraduate School, Monterey, California 93943. The paper appeared in Vol. 226, No. 14\/1992, Journal of Composite Materials.","Lesson ID":509}
{"Recommendation(s)":"A safety check of turbopump speed is made at 1.25 seconds in the startup sequence to ensure that the high pressure fuel turbopump speed is high enough to safely proceed through the priming sequence.","Lesson ID":967}
{"Recommendation(s)":"Include the Lead Systems Engineer (or Chief Engineer or whatever title is being used) in the initial negotiations and concept development phase of the project especially when international agreements are involved.","Lesson ID":2297}
{"Recommendation(s)":"Install a master timing unit to provide precise time correlation between multiple data systems to determine event sequencing in a system failure.","Lesson ID":209}
{"Recommendation(s)":"Install muffler on outlet vent to operate both air receivers during bleed operations and reduce noise level to within OSHA regulations.","Lesson ID":138}
{"Recommendation(s)":"Try to have interfaces as flexible as possible.","Lesson ID":1593}
{"Recommendation(s)":"Test or retest of flight hardware should always be performed with adequate personnel in attendance, with QA surveillance and with approved test procedures. Clarification of this requirement in the flight project practices document should be considered. Prior to the use of test instrumentation, reviews should be conducted to verify that proper configuration and adequate precautions have been taken to prevent damage to flight hardware.","Lesson ID":287}
{"Recommendation(s)":"Prior to venting a hydrogen (H2) system, initiate a gaseous helium (GHe) sweep purge to evacuate air from the vent line. After venting operations are complete, initiate a second GHe sweep purge to evacuate the vent system of residual H2. Use a flapper valve or check valve on the vent line to prevent air intrusion into the line during low or intermittent flow conditions.","Lesson ID":851}
{"Recommendation(s)":"When performing leak checks of components in semi closed or closed cavities consider using this type of leak check. If the component interface is purged during operations and is sampled by a Hazardous Gas Detection System mass spec to provide real time data on the health of the component\/interface during operations then try and use the already existing purge and sampling capabilities to perform the leak checks.","Lesson ID":4218}
{"Recommendation(s)":"A \"quiet\" test of 100 hours or more is necessary to assure that the system is still functioning properly and to fully characterize its performance. In addition, an attitude control system polarity check must be performed.","Lesson ID":1268}
{"Recommendation(s)":"The preferred shipping method is to transport all flight hardware, either international or domestic, by the hand carry method where feasible. This minimizes the risk of third-party handling and maximizes the safety of the flight hardware in transit. It is further recommended that when third-party handling is unavoidable, special precautionary methods be implemented as follows: Packaging design should be reviewed and pre-approved by the cognizant engineer with concurrence by the project safety engineer and the Quality Assurance Engineer. Packaging material and marking should meet the requirements of Reference (3). A packaging inspection report should be generated by the quality assurance engineer at the source and destination port to assure that the critical item was packaged and safely received. Each project should develop a CHHP which addresses how flight and other critical item hardware is to be transported from and to JPL and pulls together all the current documented JPL requirements affecting packaging and shipment. The CHHP should also address when an independent courier service can or cannot be used.","Lesson ID":1849}
{"Recommendation(s)":"The use of stainless steel components in combination with nitrogen tetroxide should be eliminated where obstruction in small passages may occur. Projects of long mission duration that use nitrogen tetroxide oxidizer systems and cannot avoid the use of stainless steel should develop a mechanism to predict flow decay hazard conditions. Oxidizers should be purified immediately before loading to minimize contamination products.","Lesson ID":305}
{"Recommendation(s)":"Plan and implement a timely, effective, process to manage flight project reserves using proven techniques like those employed successfully by the Stardust project (Reference (3)).","Lesson ID":1780}
{"Recommendation(s)":"Enlist, use, recruit, or call in part-time advisors with expertise in working with particular agencies. Get other Agency commitments in writing, and monitor commitment fulfillment closely.","Lesson ID":1094}
{"Recommendation(s)":"Reconfigure SRM segment transportation to preserve case shape and condition during shipment.","Lesson ID":183}
{"Recommendation(s)":"Primary Cause Finding: Aft movement of Bridge 9A of the Payload Bay Area Bridge and Bucket Hoist System with the Payload Bay Door Zero-G Simulator connected (right side only) caused the improper raising of Orbiter 103's (OV-103) right payload bay door (PLBD). Contributing Causes: The operator of bridge 9A, in support of TPS No. VTCS-3-11-138, TCS Blanket Rework - Aft Bulkhead, failed to follow the approved procedure covering bridge\/bucket operations (OMI V3575, OPF PLB Access Bridge\/Bucket System) as follows: A) A thorough walkdown\/inspection of bridge 9A was not performed per sequences 03 and 04 of OMI V3575 to verify Zero-G Simulator was not connected. Appendix A checklist only was used to checkout the bridge\/bucket system. B) A bridge\/bucket observer was not assigned. Recommendation: Delete Appendix A checklist and require use of OMI V3575 applicable sequences for bridge\/bucket checkout and operation. Control systems utilized by Shuttle Processing Contract (SPC) to preclude bridge operation while connected to the Zero-G Simulator were deficient as follows: A) Control of the bridge\/bucket keys was nonexistent. The technician had virtually free access to the keys. B) No provision is set forth in OMI V9023 (Orbiter Payload Bay Door Operations - Horizontal\/Vertical) to tag bridge\/bucket system out of service and secure the key during Zero-G operations per OMI V3575 requirements. C) Shift tie-in from third shift Mechanical\/Electrical\/TCS Supervisor to first shift Electrical\/TCS Supervisor did not occur. Supervisor was not aware of scheduled PLBD operations status nor did he perform a complete walkdown. Therefore, the supervisor assigning TPS No. VTCS-3-11-138 was not aware the Zero-G System was connected. Recommendation: SP-?018(2)K IOPF Payload Bay Access Equipment (Buckets) Operation and Control and OPF Fixed Platform Movement Control}, paragraph 6.1.1.b, which provides for specific key control, should be enforced. Recommendation: OMI V3575 steps to tag bridge\/bucket system out of service and secure keys during Zero-G operations should be incorporated into OMI V9023. Recommendation: SPC OPF management needs to formalize and enforce third to first shift tie-in. A formal end of shift tie-in needs to be established. Recommendation: The sustaining engineering design organization should incorporate a positive, actively controlled lockout device to prevent improper operation of the bridge system while the Zero-G Simulator is connected. TPS VTCS-3-11-138 did not appear on the OPF shop schedule or the KSC Integrated Control Schedule (KICS) for June 4, 1990. This TPS was in response to MCR No. 14725 and should have been scheduled through the KICS system. Had TPS VTCS-3-11-138 been properly integrated into the KICS schedule, work involving bridge movement would have been scheduled to occur after use of the Zero-G Simulator was complete. Recommendation: All OPF shop work (non-hazardous) should be fully integrated with the KICS. OBSERVATIONS Keys for both forward and aft bridge\/buckets are fully interchangeable. Interchangeability of keys compounds the key control issue in another finding. Recommendation: Bridge control key locks should be recoded to provide unique key control (1 key) for each bridge in both high bays. Secondary keys should be maintained by the Orbiter Processing Chief (OPC). Hands-on training for firs-?time operator certifications for the bridge\/bucket system is performed while Orbiters are in the high bays. This practice increases flight hardware exposure to possible damage. Recommendation: Schedule hands on training during periods when high bays are empty. Create a stand-alone OMI to support this training process. The constraints log kept with the out-of-TAIR OMI V3575 in the mechanical mid-body shop area book may not contain the complete list of open Problem Reports (PR's) due to the time lag to annotate constraints from the bridge\/bucket TAIR book to the mid-body book. In addition, there is no official method for recording other operational constraints against OMI V3575. Recommendation: SPC should develop a system to ensure all applicable PRIs and operational constraints are recorded against OMI V3575 in a timely manner. QC personnel, both NASA and SPC, do not receive any formal training on the operation of or hazards associated with the bridge\/bucket system. Recommendation: Provide QC personnel with a familiarization course on bridge\/bucket operations and hazards. Training of such personnel could enhance the check and balance system by providing additional awareness of the hazards associated with improper operation and checkout of the bridge\/bucket system. Technical training given for bridge\/bucket operations appears to be generally adequate. However, based on interviews with operators, there are different interpretations of the significance of finding the bridge inhibit switch on. Recommendation: Training should emphasize that finding the inhibit switch on.should prompt the operator to find out why this switch was left on prior to operating the bridge (e.g., steps in OMI V9023 require inhibit switches to be turned on after the Zero-G System is connected). OMI V3575 should be revised to instruct the operator what to do when inhibit switches are found on. The training instructor for bridge\/bucket operations is not on distribution for OMI V3575 revisions or deviations. Recommendation: The training instructor should ensure that he receives the latest OMI V3575 revision\/deviations to ensure training material is consistent with current operating procedures. There are common\/similar findings between this mishap and the 1985 bridge\/bucket mishap. These finds are: A) inadequate bridge key control, B) Inadequate bridge tag-out (out of service) procedures, and C) Deficient shift-to-shift tie-in communications. There are 86 bridge\/bucket certified operators. This appears to be excessive number to support OPF operations. Recommendation: SPC should reassess and justify the need for the number of certified operators with a view towards elimination of \"incidental\" operators. The Preliminary Evaluation Report (PER) did not address damage to flight hardware even though it was stated on the PER that the Payload Bay Door lifted approximately 10 to 12 inches. Recommendation: Even if there is no obvious damage to flight hardware that has been involved in a Mishap\/Incident, it should be included in item number ten (Equipment Damaged) on the PER. The PER should be revised to include a block for flight hardware that could possibly be damaged. The initial estimate in item ten will then be a TBD until the flight hardware can be examined. SPC OPF Supervision, as evidenced by interviews, are not generally aware of the NASA\/KSC mishap investigation process per KHB 1711.lC,\"Reporting and Investigation of Mishaps.\" In addition, the SPC SPI SF-505(8)KV, Rev. C-1, \"Mishap Reporting,\" lacks specificity on the mishap investigation process. This lack of awareness and specificity led to: A) A SPC Mishap Investigation Team was established June 4, 1990, by the Director of OPF\/HMF\/VAB Shops outside of the authority of Launch Site Directive 002, \"Standing Accident Investigation Boards.\" An informal LSOC Assessment Team was subsequently established by a letter from the Launch Site Director on June 5, 1990. B) Incomplete communications to and within the SPC flow management organization permitted mishap-related, failed hardware to be removed without the SPC Mishap Investigation Team Chairman's approval. Recommendation: Revise SPI SF-505(8)KV to provide SPC personnel a more detailed guide to follow during a mishap investigation process. A review of SAA09FY093-006, \"System Assurance Analysis of the Payload Bay Area Access Bridge at the Orbiter Processing Facility High Bay 1 and 2,\" Section 4, \"Hazards Analysis,\" reveals there are ten controlled hazards in this system. The primary risk acceptance rationale for control of these hazards involves procedural checks, inspections, warning notes, and testing principally via OMI V3508 (now V3575). In light of this mishap and the 1985 bucket mishap findings, the hazard control verification aspects of OMI V3575 are not being implemented as fully or rigorously as envisioned in the SAA. Recommendation: SAA09FY093-006 should be revisited and acceptability of the controlled risk rationale and verification method via OMI V3575 reassessed. On Friday, June 22, 1990, a \"near miss\" incident involving bridge\/bucket checkout per OMI V3575 was recorded. During the forward\/aft motion check of OPF-1 aft bridge\/bucket 9A per OMI V3575, the right-hand Zero-G counterweight basket lifting pulley and mount bracket came close to striking a workstand that extended into the bridge path. The Problem Report (PR) for which the workstand was being used (PRC70-00-002-0026) was not listed as a constraint against OMI V3575.","Lesson ID":1200}
{"Recommendation(s)":"Consider the use of a redundant air data source (one of diverse design so as to lessen the probability of common cause failure) to increase the reliability of air data.","Lesson ID":360}
{"Recommendation(s)":"Reassess\/improve the effects of adverse environmental conditions on pad systems and impose appropriate launch constraints.","Lesson ID":198}
{"Recommendation(s)":"The \"thread-locking compound\" Corporation has provided information that screws should not be reused after having \"a thread-locking compound\" applied; further, a tap should be run into the female threads to clean them prior to a new screw being installed.","Lesson ID":524}
{"Recommendation(s)":"Contingent on system design life requirements, develop and implement a corrosion survey plan for all of the steam lines and ejector duct that includes documenting the results and location of pipe inspections, comparing results from year to year, documenting any trends that may develop, and stating clearly the minimum passing criteria for each inspection. Assure thoroughness and follow-through in the Systems Requirements Review process for affected facilities. Assure rigor exists in the Pressure Systems inspection program, including a process for tracking and follow-up on corrections for non-compliances.","Lesson ID":1391}
{"Recommendation(s)":"Include all stakeholders (customers, operations, design\/implementing organization, and users) in the initial selection of the verification method. Throughout the design life cycle, reevaluate the methods originally selected to confirm they remain valid as the design matures. By formally addressing verification methods at each design review, the implementing organization will ensure it can execute the chosen methods.","Lesson ID":5203}
{"Recommendation(s)":"The distribution of flaw-induced normal magnetic field component in the magnetic-optic imaging instrument has been measured between the test object and the current sheet as well as at locations above the current sheet.","Lesson ID":526}
{"Recommendation(s)":"Use load-sensing pins at critical connection points to indicate loading and load changes as opposed to relying totally on feel or sight. Include load limits in the written operating procedure to protect the hardware.","Lesson ID":3116}
{"Recommendation(s)":"The uncritical acceptance of equipment that has been classified as \"standard\" or \"flight proven\" should be avoided, especially if modifications of any level have been made on this equipment. Plans should be made early in the project to fully evaluate the heritage of previously used equipment. The degree of evaluation may have to be contractually defined on fixed-price contracts. When conducting a FMECA on the power system and other electrical components, electrical shorts should be considered as one of the potential failure modes.","Lesson ID":371}
{"Recommendation(s)":"If use of this type of load bank is required, it is recommended that further evaluation to determine at what length coupling does the load bank performance become erratic. Also, it should be tested with the actual coupling required prior to utilization as a critical load. The reporter has reverted to use of resistive load banks with no recurrence of this phenomenon.","Lesson ID":581}
{"Recommendation(s)":"Practice: Deflection actuated, pressure assisted coated metal seals, or spring energized Teflon® seals, along with prudent flange joint designs, should be used for high pressure static cryogenic sealing applications in launch vehicle engines and related propulsion system components.","Lesson ID":701}
{"Recommendation(s)":"Based on the findings and conclusions, the Committee identified the following recommendations which should prevent similar incidents in the future and improve overall range operations: Management for both the Range User and the Range should ensure that the roles and responsibilities of critical decision making personnel are clearly defined and understood. The Range User and the Range should establish, document, and fully coordinate all mission rules and launch constraints. A final pre-mission briefing should be conducted as near the intended launch date as possible (1 to 2 days before launch). All key participants should be represented at this briefing. This briefing should include but not be limited to: a. Roles and responsibilities of all key participants and the launch decision process b. Mission rules and launch constraints c. Operational procedures including standard abort\/hold terminology d. Communication channels assignments and protocol A direct link should be provided (either voice or electronic) from the WFF RSO\/TD to the flight crew that enables the WFF RSO\/TD to hold the launch in the latter stages of the count should an abort\/hold condition arise. The terminal countdown should be conducted on a single communications net. All critical mission status calls should be made on this net. The FTS CDR mission rule should be reviewed. All inflight non-reversible countdown items such as battery activation should be preceded by a \"go for\" command. Video from carrier and\/or chase aircraft is a highly desirable source of information and should be provided for all future missions. Prior to launch, various scenarios should be conducted that exercise abort calls from the various mission support elements. A dress rehearsal which exercises as many assets as possible should be conducted prior to each launch. There should be a recovery day between dress rehearsal and launch.","Lesson ID":1090}
{"Recommendation(s)":"Project Planning and Control (PP&C) organizations should develop standard product templates that allow for easy integration and summarization of project schedule and budget data and is traceable between the schedule and budget tools and documents. The templates must include, at a minimum, the approved project WBS coding as defined by the NSM system. All schedule tasks must uniquely map to a single WBS element. The PP&C organization should provide all project personnel the necessary training and guidance regarding correct and consistent referencing of the WBS numbering used within the IMS, the budget, or any other project documentation.","Lesson ID":5862}
{"Recommendation(s)":"The Space Shuttle program should ensure that both the GPS and MEDS software changes are thoroughly tested in the Shuttle Avionics Integration Laboratory (SAIL) using the normal and enhanced test protocols that have proved to be robust when testing major modifications.","Lesson ID":1002}
{"Recommendation(s)":"This failure could have been avoided by providing an isolation resistor between each power supply terminal and the scanner. The voltmeter used to make the measurement has an input impedance of several megohms, so an isolation resistor of up to 100K ohms would have provided ample protection without affecting significantly the measurement accuracy. The difference between flight configuration and GSE configuration must be kept in mind. The normal inputs, connected to the spacecraft power converter, are isolated by at least 10K ohms. There is a need to be continuously conscious of the differences between flight and test configuration. The catastrophic potential of a reed relay failing to open was overlooked in this case. Support equipment failures must be prevented from propagating to the flight hardware.","Lesson ID":435}
{"Recommendation(s)":"Develop and implement a preventative maintenance program for the SSME vertical installer.","Lesson ID":113}
{"Recommendation(s)":"1. Consider benchmarking the distribution of emergency response resources at JSC as a ¿best practice¿ for all NASA centers.","Lesson ID":1721}
{"Recommendation(s)":"Prior to fuel transfer operations, inspect grounding reel for deterioration resulting in poor common ground between fueling tanker and transporter.","Lesson ID":136}
{"Recommendation(s)":"Place flight scripts under change control prior to ORT.","Lesson ID":2476}
{"Recommendation(s)":"To preclude detrimental results, care should be exercised in the selection of fluids to be used with or in the presence of polymeric and elastomeric materials.","Lesson ID":430}
{"Recommendation(s)":"Reference (3) provides the following observations and recommendations for test control systems, training, and test procedures that should be considered in planning and managing future environmental test programs: Test Control System Lessons Learned When software updates that containquotpatchesquot to improve system operation and repair problems are not installed upon receipt from the vendor, the test equipment may not operate as expected. In this case, the vendor of the controller used in the acoustic chamber had provided software updates to JPL in 2004, 2005, and 2006 and recommended their installation, but JPL had not installed them and was using an earlier software release. When user-definable parameters in the controller (e.g., the time constant, the control speed, and the maximum drive change) are not set to the values recommended by the vendor, the discrepancies can disrupt testing and contribute to a mishap. The control system set-up and monitoring for acoustic testing of flight hardware always needs to be checked and verified by a second test engineer. It is also imperative that a second party verifies all settings. A record must be made of all critical parameters in the controller software configuration file that are changed or modified, with documentation of who made the changes or why the changes were made. Prior to use of the acoustic test controller, it must be verified that it adequately protects the hardware even when the operator fails to follow the correct procedure. Under these Aquarius test conditions, the installed version of the software should have reduced the drive by 50 percent and aborted the test, but it did neither. Test Control System Recommendations Test chamber controller software updates should be installed each time they are received, vendor-defined parameters should be implemented, and the system should be completely checked out prior to testing flight hardware. Verify acoustic test controller parameters\/limits by the appropriate dynamics and quality assurance personnel prior to initiation of tests. A second party should also check the setting of instrumentation parameters, such as sensitivity and full scale, which can affect the accuracy of the test data during flight hardware testing. The test conductor should fully understand the necessary test safeguards, confirm (with the chamber empty) that the safeguards are in place and that the safeguard parameters are sufficient, and make any controller software changes necessary to protect the hardware when it is tested. Knowledge\/Training Lessons Learned The JPL Quality Assurance (QA) representative present during the test operations should have the detailed knowledge of the test operations needed to verify the status of the acoustic testing and of the test control system. Also, QA should implement a formal process to obtain the proper approvals to perform the troubleshooting steps and to record those steps. If data is missing from the quotas runquot copy of a test procedure because it was not fully updated, it may be very difficult to replicate the test or verify that the test was performed correctly. To avoid human error, test operators need to follow the step-by-step instructions in the written test procedure instead of relying on memory. Human error has often been the primary or a contributing factor in test anomalies. Test operators need to have a thorough understanding of the test controller quotinner workingsquot critical for the protection of the test equipment and flight hardware under test. They must understand the error messages from the control system and the implications of the commands they give to the control system. Knowledge\/Training Recommendations QA personnel assigned to witness a test should be trained in the basic theory of operation of the equipment and the test facility. QA personnel should have the authority to require approval of any troubleshooting that involves critical equipment, and they should properly record the troubleshooting steps taken. QA and the cognizant design engineer should ensure that all applicable instructions are included prior to approving the test procedure. Test operators should pay special attention to updating the quotas runquot test procedure, entering all the required data and information. Train personnel in the proper use of test procedures. In all cases, rigorously enforce use of step-by-step instructions to assure that each instruction is precisely followed. Provide comprehensive training for acoustic control system operators in the system operation principles and practice, as well as all features of the control system, including software safeguards and error messages. Test Procedures Lessons Learned The Aquarius Reflector acoustic test procedure lacked complete instructions for configuring the controller software prior to the test. Although JPL was the test facility operator, no QA discrepancy reports were generated and troubleshooting was conducted in accordance with the reflector contractor's test procedure. The JPL Dynamic Environments engineer assigned to witness the acoustic testing and provide technical assistance was never contacted by the test conductor or by JPL test personnel and informed that an acoustic test was going to be performed as part of the troubleshooting process. The roles and responsibilities of the various personnel involved in the Aquarius acoustic test operations were not clearly documented. This could lead to confusion during test operations. Although the test personnel knew that the test conductor was the person responsible for the test, the JPL test procedure did not mention a test conductor or director. The reflector was left in the chamber while performing critical equipment troubleshooting tests to resolve irregularities in the acoustic data. There was no formal agreement between the Aquarius Project and the reflector contractor who performed the test in a JPL facility regarding their respective responsibilities and obligations in the conduct of the acoustic test. Test Procedures Recommendations For every test of flight hardware, provide a detailed procedure with instructions on pre-test, test, and post-test operations, including such steps to configure the controller as setting the test parameters. In no case should reliance be placed on the operators' memory. If a test failure or problem occurs during test of flight hardware in a JPL test facility, the response should conform to JPL policies and procedures governing the documentation and approval of recovery measures and corrective actions. Test lab operations personnel and the test conductor are responsible for assuring that the JPL dynamic environments engineer is present and intimately involved in all dynamic test operations. In addition to defining the roles and responsibilities of test personnel, the test procedure should identify the individuals by name to eliminate any source of confusion. Prior to testing, develop a list of the names of key personnel that clearly states (1) who absolutely needs to be present and (2) other personnel whose presence is not so essential that testing should be delayed if they are unavailable. Flight articles should be removed from the test facility when there are uncertainties in the environments to which they may be subjected during troubleshooting. Require a written agreement between the flight project and its contractor(s) that stipulates their responsibilities and obligations in the conduct of JPL facility-supported tests. Provide a checklist or template that lists the important elements as an aid for flight projects that need to write such formal agreements.","Lesson ID":2419}
{"Recommendation(s)":"Review the spacecraft power subsystem design for battery passivation effects, characterize the spacecraft and mission vulnerability to such effects, and plan for implementation of battery depassivation measures at appropriate mission milestones. Conduct ground tests on spacecraft batteries using batteries from the same lot, and test them again in-flight to verify passivation characteristics and their effect on voltage output. Assure an adequate supply of spare battery cells. Design spacecraft circuitry to tolerate voltage transients from battery passivation effects.","Lesson ID":1410}
{"Recommendation(s)":"For future Flight Operations Reviews (FOR), the ISS S&MA community is aware of this issue and will in the future review the flight operations products (e.g., Operations Checklists, Malfunction Checklists, etc.) with an emphasis on warning\/caution note placement. At no time should a procedural step precede a referenced warning or caution note. ISS MER-Safety routinely checked the Flt 2A.1 (STS-96) Flight Note procedures sent to the crew for placement of warning\/caution notes, as well as their content. Additionally, this lesson learned will be referenced in PRACA PR# 1000 as part of the Recurrence Control. It is believed that placing a procedure step before a referenced warning\/caution note is a rare oversight and that increased ISS Program visibility of such an occurrence via the PRACA Report and the Lessons Learned should adequately address the problem.","Lesson ID":1204}
{"Recommendation(s)":"Conduct a component-level review of all new or inherited GSE systems and include the requirement for periodic maintenance in the appropriate manuals.","Lesson ID":3762}
{"Recommendation(s)":"Develop a plan to ensure that all of the design experience gained by NASA in the X-38 technology validation effort is transferred to the contractor selected to produce the operational CRV.","Lesson ID":1167}
{"Recommendation(s)":"Install access\/work platform on LH2 ET vent line at 95-foot level of the fixed service structure to provide a safe means of removing blast covers.","Lesson ID":166}
{"Recommendation(s)":"Modify platforms 11A-1 and 11A-6 to allow them to be utilized with the PBD's in \"normal\" service position.","Lesson ID":158}
{"Recommendation(s)":"Provide an explicit or absolute positioning capability in which the device can be commanded to a specific position, allowing development of sequences in which periodic positioning to absolute locations can be executed.","Lesson ID":279}
{"Recommendation(s)":"Institute a Preventive Maintenance Program based upon current reliability-centered maintenance (RCM) techniques.","Lesson ID":891}
{"Recommendation(s)":"Perform thermal dwell test on protoflight hardware over the temperature range of +75°C\/-20°C (applied at the thermal control\/mounting surface or shearplate) for 24 hours at the cold end and 144 to 288 hours at the hot end. Note: Thermal dwell testing is the standard practice at JPL for systems and components which do not thermally cycle during flight. For systems and components that do thermally cycle (generally over a range > 20°C) in flight, the JPL practice is to cycle over a conservative range for three times the number of flight cycles.","Lesson ID":783}
{"Recommendation(s)":"Design Engineering should use a non-welded configuration when close proximity bends are needed. Even though the orbital tube welding process requires only 0.7 inches of straight tubing on both sides of the joint for clamping, approximately 1.5 diameters of straight tubing should be kept between a bend and a weld joint for ovality run-out. This will insure acceptable ovality that, in turn, will insure acceptable mismatch.","Lesson ID":1230}
