{"Tracking #":"15-0052","Mission Type":"Fire, Water Drop (Helicopter Bucket)","Text":"On 11-08-2014 during the initial attack phase of the West Range Fire in Buffalo, WY there were reports from firefighters of a recreational type unmanned aircraft system {UAS} flying in and near the perimeter of the fire. There were no suppression aircraft on scene at this time, but a Type 3 helicopter was on order and anticipated beginning of shift on 11-09-2014. Local law enforcement assisting in evacuations was notified at this time as well as the Safety Officer to be on the lookout for the UAS operator. On 11-09-2014 an AS350B3 was on scene assisting in suppression operations. The pilot was told of the UAS sighting, as well as other single engine fixed wing operating the previous day in and around the fire area during initial briefing. A TFR was put in place prior to aerial suppression operations 11-09-2014. Later that day, an individual near the fire line {which was abutting a state highway} was witnessed by the IC with what appeared to be a UAS controlling system. Altitude the UAS was operating at is unknown. Heavy smoke and erratic fire behavior conditions were exhibited at the time of the incident. See attached photo. The IC immediately confronted the individual who admitted to flying a recreational UAS, which prompted the IC to order the individual to immediately cease operation of the UAS, and leave the fire area.  There were aerial suppression operations taking place at the same time and in the same area by the Type 3 helicopter {bucket work}.  Helibase was notified of the situation by the Safety Officer. Information was passed to pilot by HMGB, after the fact as UAS operator was found, confronted, and removed from the scene prior to notification. Local Law enforcement was also notified of the incident and put into contact with the UAS operator.  Wide circulation of events is encouraged due to likelihood of future incidents with high potential for catastrophic outcome. Local, State, and regional aviation managers were notified prior to this posting."}
{"Tracking #":"15-0166","Mission Type":"Fire, Initial Attack","Text":"During initial attack of the 213 Fire south of Durango, CO a hobbyist offered the local fire department to fly his camera-equipped drone over the fire and take video. I was notified of the aircraft doing the mission as I took command of the fire which was on Federal\/BIA jurisdiction. There were no aircraft assigned to the fire, no TFR in place and no nearby airports and the mission took place without incident. The fire department has been notified that on federal land, UAS will not be allowed without proper FAA accreditation and only after being ordered. They will now contact cooperating federal fire managers and request permission before launching any UAS impacting federal lands."}
{"Tracking #":"15-0327","Mission Type":"Fire, Air Attack","Text":"At 1745 hours PST, while performing an air attack transition and while dropping Retardant on `Div Quebec`” Outgoing Air Attack{Actual}, had a Drone fly under the platform splitting the lead plane and the outgoing Air Attack vertically by Approx. 500ft. The Lead Plane and Airtankers were called off by the outgoing air attack and instructed to ``Go Around``.  The Drone then flew out of sight to the south. The drone is described as a red or orange fix-wing platform with a 3 to 4 wing span. The transition was finished and handed over to the incoming air attack. Air attack ceased all fixed wing operations and airtankers were returned to airtanker base. Law enforcement was then notified. Upon returning to the tanker base on a route 1 mile North of Heaps Peak Helibase another drone was spotted 500ft below the outgoing air attack. Outgoing air attack performed a hard right to avoid and try to detect flight path of drone.  Drone then descended to the East and visual contact was lost.  Outgoing air attack then completed its descent and landed at KSBD with no further Incident. All Fixed Wing Operations halted on south aspect of Fire, all notifications were made at the local and regional level."}
{"Tracking #":"15-0339","Mission Type":"Fire, Water Drop (Helicopter Bucket)","Text":"While on USFS CWN Fire contract duties supporting the fire near Redlands, CA, H-XXX was contacted by LP and advised that a DRONE was spotted by  Air Attack in Division Q {Quebec}. H-XXX was dropping water on the ridge line at 10,500 msl in Division Q. Lead Plane provided no input on what action should be taken. The PIC advise Lead  that H-XXX was departing the area to the SW. H-XXX remained clear of Division Q near Dip site Jenks Lake. H-XXX could not raise Air Attack or Lead on rotor victor air to air frequency x 4 attempts so elected to return to  Helibase. PIC departed the area.Flight Crew was not aware of USFS policy on actions to take if DRONES are encountered within a FIRE TFR.  PIC elected to depart the area."}
{"Tracking #":"15-0425","Mission Type":"Fire, Air Attack","Text":"On July 11, 2015 at approximately 2120 hours, a UAV was observed flying within a TFR on the Douglas Complex. At the time the UAV was first observed, all tactical missions had been completed with Lead, Tankers and Helicopters returning to their respective bases. The air attack platform was remaining on station to map and gather additional intelligence for the newly transitioned Type III team when the UAV was spotted by the pilot of the Air Attack platform. The Air Attack platform established a high orbit over the UAV, maintaining visual contact. Orbiting above the UAV, the UAV immediately reversed course and landed in the vicinity of a vehicle parked along Armstrong road, approximately 3 miles from the fire perimeter and two miles within the established TFR. Once the UAV was on the ground the Air Attack platform descended to 500+ AGL and orbited the vehicle. The UAV was loaded into what appeared to be a grey or silver SUV and departed the area to the north along Armstrong road and then traveled west on HWY 2. A basic vehicle description and direction of travel was relayed to dispatch and the fire operations of the complex. Air Attack returned to Wenatchee without incident. A debrief was conducted with the Unit Aviation Officer and the Assistant Center Manager\/Aircraft at the Central Washington Interagency Communications Center Information regarding the UAV intrusion was shared with the Air Space Coordinator and this Safecom was authored."}
{"Tracking #":"15-0453","Mission Type":"Fire, Helitack","Text":"After being released from the a fire near Coloma, California Helicopter-XXX stopped in Placerville for fuel. Upon arrival at the Placerville airport the pilot was unable to raise the FBO on the CTAF frequency so we landed on the helispot at the west end of the taxi way to try to make contact with the FBO. After no contact was made helicopter-XXX lifted from the helispot to re-position to the self serve fuel island. During the move to the fuel island we encountered a small ``drone`` operating out of a hangar over the west end of the parking ramp approximately 30 feet above ground level and 100 feet from the taxiway. The drone appeared to be overflying the parked single engine airplanes on the ramp. Once it was identified we decided to maintain visual on the drone as we taxied to the fuel island. As we continued on our path it became apparent that the operator was going to keep flying the drone in our direction. Helicopter-XXX gained altitude to about 50 feet AGL and the drone flew directly under us at approximately 20 feet AGL. After landing at the self serve fuel island the helicopter manager walked down to the west hangar and confronted the operator of the drone, explaining that drone operations are prohibited in airspaces such as airports and TFR````s.  After discussing it with the operators I called the Eldorado National Forest FMO and left a message as well as the region 2 HOS.  On July 17, 2015 I contacted the FAA in Reno {Jim Richardson} and filed a report.  The FAA investigator took my statement contact information and will be receiving a narrative report via email. In addition Julie Stewart the USFS\/BLM National Airspace Coordinator was notified and the encounter will be documented on the master list she is keeping."}
{"Tracking #":"15-0457","Mission Type":"Fire, Air Attack","Text":"Airspace incursion: On the date of 7-12-15 while on the Initial attack of the, we were made aware of a medium sized drone near the point of origin. San Bernardino Dispatch was Notified and the aircraft were put on hold at San Bernardino Air Tanker Base by the Air Attack. The operator was spotted and BDF Patrol-XX began to pursue the operator located about 200 yards away. The Patrol made contact with the individual and forced him to land his plane. San Bernardino Dispatch was then notified and the air resources were then launched to the fire. This delay lasted about 30 minutes, causing the fire to grow rapidly and threaten structures on Yucaipa Ridge. The fire was then quickly contained when the aviation resources arrived delivering retardant and water to the head of the fire. The Patrol was not able to detain the Drone operator who was very upset and cursing at the Patrol that he was well in his rights to be there with his aircraft. The patrol was able to get the license Plate of the vehicle, latter leading to SBSO, CHP, and Local FS Law Enforcement to talk to the suspect at his house. Not sure of the outcome or if citations were Issued. Hold Aircraft, Clear area of drone activity, re-engage"}
{"Tracking #":"15-0458","Mission Type":"Fire, Air Attack","Text":"Air Incursion: While responding to the fire as Air Attack shortly after reporting 4-5 acres rapid rate of spread with spotting, deciding to go direct on the Left Flank with Bravo -XX, Tanker -XX, Tanker YYY, Helitanker- XXX and Helicopter-XXX. At that time AA pilot spotted a medium sized RC aircraft\/drone north of the fire 1 mile heading south to the fire behind Bravo-XX with tankers in tow. All aviation resources were then diverted to the east of the fire until the drone was clear. Shortly after with immediate life threat on the 15 fwy {several vehicles on fire} I decided to have Helicopter-XXX proceed with high caution to where the drone operators were spotted landing and make contact with them on the FS 3N24 road. While on final to land on the road, the helicopter’s rotor wash crashed all 3 RC planes\/drones. LEO was shortly behind and soon made contact with the operators. There were also 2 other RC\/Drones that interfered with the lead plane by pursuing the LP at 6 o`clock.  Both these RC\/Drones left the area. All aircraft were then returned to the fire to begin their suppression efforts. The delay of 20 mins in aircraft was critical in the growth of the fire, with the heavy aviation response on scene of the fire when the drones interference, it is without doubt this fire could have been stopped at less than 100 acres with minimal loss to property. Forest Service LEO’s detained the operators for questioning. Mitigated Drone activity, re-engaged"}
{"Tracking #":"15-0682","Mission Type":"Fire, Reconnaissance","Text":"On 08\/23\/15 at approximately 0934 hours, the Owens Valley Interagency Communication Center received a report of a drone incursion into the Walker Fire TFR. Walker Air Operations immediately had H-XXX {who was up performing a recon mission} return to their helibase and shut-down. The original report came from a recreational field employee who advised that the drone operator had landed his drone and was leaving the area in a rental vehicle. Dispatch immediately dispatched a BLM law enforcement Ranger, who was already in the area to investigate. The BLM law enforcement ranger quickly located the drone operator and performed a traffic stop. After speaking with the drone operator the ranger determined that the drone operator, a foreign national, was attempting to film a documentary and was unaware of the tfr\/fire operations. The ranger got the subjects contact info for follow up if needed. Drone operator was counseled by law enforcement on the dangers of drone use near fire operations. The operator acknowledged the dangers and was cooperative."}
{"Tracking #":"15-0754","Mission Type":"Fire, Initial Attack","Text":"On August 29, 2015, I was watching aviation and ground operations on the fire approximately 1 mile from the fire line. Between 1600 and 1630, while aviation operations were ongoing, an unmanned aircraft system {UAS or drone} flew overhead and continued toward the fire line. I located the individual flying the UAS, informed him that his actions were compromising the safety of the men and women fighting the fire, and asked that he stop flying the UAS.  He immediately complied with my request and apologized."}
{"Tracking #":"15-0794","Mission Type":"Fire, Leadplane","Text":"Upon arrival over the Fire, we were in a right hand orbit, having just taken control of the fire from the departing ATGS, and we were also determining retardant runs for two returning air tankers. We also had control of two helicopters doing bucket drops in Division x. As one helicopter was approaching the drop area, I spotted a small bright orange object circling in Division Whiskey. When it was in the sun it showed up bright orange, when it was in shadow it completely disappeared from view. We determined it was a small to medium size drone, and it was at approximately 300 to 500 ft. AGL. We were circling at 8000 ft MSL initially. The drone hovered approximately one eighth to one quarter mile in front of the helicopter as it was dropping water. Initial attempts to contact the helicopter were unsuccessful. After the helicopter departed the drop area I was able to tell the pilot about the drone and we held them and the other helicopter at the dip site which was a large lake below the fire. We decided to shut down aerial operations and had both helicopters return immediately to the Airport, which was approximately five miles to the Northeast. We contacted Dispatch and put all air tankers on hold. We had the object in sight for approximately twenty minutes. At one point it flew to the exact location where the helicopter had dropped water. Just prior to losing visual contact, the ATS observed the object fly right down the middle of the fire. We then lost contact with the drone but this also coincided with the entire fire being in shadow, so we were unable to positively determine if the object had left the fire area. Ground personnel were unable to spot the object. We had climbed to nine thousand feet. We departed the fire approximately thirty minutes after losing visual contact with the object. nan"}
{"Tracking #":"15-0803","Mission Type":"Fire, Retardant Drop (SEAT)","Text":"WHILE FLYING OVER THE  FIRE, PREPARING TO DROP A LOAD OF RETARDANT, A SMALL AIRPLANE SHAPED DRONE FLEW APPROXIMATELY 10 FEET UNDER THE LEFT WING OF TANKER-x. THE DRONE WAS WHITE IN COLOR WITH A RED MARK, AND HAD A WING SPAN OF ABOUT 20 inches TO 24 inches. AT THE TIME OF THE INCIDENT, TANKER-x WAS APPROXIMATELY 500 FEET ABOVE THE GROUND. IMMEDIATELY AFTER THE SIGHTING, THE PILOT STARTED A CLIMB WHILE FLYING DIRECTELY AWAY FROM THE FIRE AND NOTIFIED THE AIR ATTACK OF THE INCIDENT. AIR ATTACK INSTRUCTED THE PILOT TO RETURN TO TOOELE SEAT BASE AFTER DROPPING THE RETARDANT LOAD AT THE DESIGNATED JETTISON AREA."}
{"Tracking #":"15-0833","Mission Type":"Fire, Initial Attack","Text":"This SAFECOM is to document the reported sighting of a small UAS being operated in the northeast corner of the fire TFR on August 21st. The initial report was made by a local LEO to Dispatch who reported the sighting while clearing the public from FS road XX that borders the YYYYY Creek drainage. LEO indicated UAS appeared to be small and operating within YYYYY Creek and various side drainages at 1650 PM. Dispatch records indicate Air Attack was immediately notified {1651 PM} of the reported location, with a response of: ``will keep a look out and will shut down air ops if it gets near the Troy Area``. Troy area is where active air operations were occurring that afternoon - The LEO````s initial UAS sighting was approx 8 air miles from Troy area and Air Attack indicated this wasn````t a factor at the time due to the distance. The only other documented communication related to Asotin Co Sheriff````s office contacting dispatch that they were informing deputies via satellite phone to keep a look out on the east\/northeast side of the fire, and a communication from the AOBD that he was notified of UAS sighting - both at approx 1700.UAO Comments: The sighting was technically a TFR intrusion, but not followed up with locally by Unit or IMT with a SAFECOM or to the FAA {ARTCC} or FAA Av Safety Hotline as recommended in USFS UAS fact sheet distributed in early summer. We will use this event to firm up protocols for likely future events! The IMT PIO did have a Grizzly Bear Fire Facebook page where the ``If you Fly We Can````t`` poster was immediately distributed after the 8\/21 sighting, I was told."}
{"Tracking #":"16-0168","Mission Type":"Fire, Aerial Ignition (Prescribed)","Text":"A 1420 acre prescribed burn was implemented on Tuesday, March 29th on the forest. At the test fire, a UAS was utilized for aerial photography and video. The Area Safety Officer was with the UAS and operator the entire day. The operator is a US Forest Service employee. He communicated that he carries FAA certification, and has valid registration numbers for the UAS. Before the Exclusive Use helicopter left the Helibase, the HMGB and trainee ensured, and was confirmed, the UAS was put away and not utilized. After completion of aerial ignition and the helicopter was confirmed back at the Helibase, the UAS was utilized again for video and photography of smoke in the area.  The HMGB and trainee did not recall any discussion of UAS use during the formal briefing. nan"}
{"Tracking #":"16-0373","Mission Type":"Fire, Air-Attack (Prescribed)","Text":"After just arriving on the XXX fire to assist in a fixed wing retardant mission a drone passed below the air-attack platform. The platform was at 11,500 feet when the ATGS {t} & ATGS witnessed a drone pass below and to the right of the platform within 200 feet. No other assigned fire aircraft were on the incident during the incursion. 3 LATs and 4 SEATs were ordered, but not yet in route. The ATGS platform climbed in altitude and departed the fire traffic area. Operations, helibase, and dispatch were immediately notified and all ordered aircraft were cancelled. The ATGS platform diverted from the fire to Cedar City, UT and landed without incident."}
{"Tracking #":"16-0376","Mission Type":"Fire, Water Drop (Helicopter Bucket)","Text":"While performing bucket water drop operations on the XXX Fire, within an active TFR, Pilot and Co-Pilot witnessed a Drone\/UAS {white\/silver ``Quadcopter``}. While transitioning from the dip to the drop at about 8,500 MSL the UAS flew past the right door roughly 100```` below the Helicopter headed down slope towards the town of Pine Valley. Pilots recorded and passed on the Lat\/Long to Air attack, and returned to Cedar City Airport. Air attack, and Helibase Managers shut down operations and grounded all aircraft to their respective locations."}
{"Tracking #":"16-0385","Mission Type":"Fire, Air Attack","Text":"Immediately after being released from the fire to hold over, helicopter was at 400 ft AGL when a small a quad-copter drone passed under the nose of the helicopter. Drone missed aircraft by approximately 50 feet. Helicopter was still inside the fire traffic area of the fire, within 1\/4 mile of the fire itself. Helicopter located the drone operator and vectored law enforcement to the scene. Also notified Incident Commander."}
{"Tracking #":"16-0403","Mission Type":"Fire, Air Attack","Text":"At approx. 12:10 during the late morning Air Attack mission on the Cedar Fire, 0EB went wide along the left flank of the fire at 8500 feet and spotted a UAS {Drone} approximately 100 feet below and 60 feet to the right of the plane. They climbed through to 9500 feet, departed the area and contacted the aircraft dispatcher about the intrusion. There were no other fixed wing aircraft over the fire at the time, but there was a helicopter working low level along the left flank. The UAS was a couple miles east of where incident aircraft were operating but within the TFR. Air Attack notified the helicopter of the UAS and then based on the comfort level of the pilot decided to continue operations. Earlier in the day a vehicle had been observed in the area of the drone sighting but it was assumed to be incident personnel scouting contingency lines for the fire. By the time Air Attack returned to the area the vehicle was gone. Security personnel for the IMT were notified and sent into the area where the vehicle was sighted. There is now a law enforcement presence patrolling the area of the sighting. All incident personnel were briefed on the protocols for reporting UAS.UAM reported the intrusion to the ABQ ARTCC on 6\/23."}
{"Tracking #":"16-0418","Mission Type":"Fire, Air Attack","Text":"While performing an air attack mission over the  fire, we encountered a drone flying over the fire, within the TFR. We were operating at 7500 and the drone was seen approximately 500 feet below us. The encounter occurred at 1542. We informed the aircraft over the incident of the drone and returned them to heli-base. We circled the area for a few minutes and did not see the drone during our search. During our search we informed Operations and the Heli-base of the encounter. After waiting 30 minutes and as we began to resume aircraft operation over the fire we encountered the drone again, at 1627. The pilot saw the drone and was able to turn and get a good idea of the direction of travel before we lost visual on the drone. We contacted the Heli-base and Operations about the second drone encounter. Operations recommended that the Sheriff’s office had a Helicopter available that would improve the incident’s ability to search for the drone and or the operators and prevent any further incursions into the air space over the fire. We informed the relief air attack of the drone activity and departed the fire traffic area to return to base. Following each drone encounter we made notification to aircraft over the fire, heli-base and Operations.  We noted the time of the encounter and planned a 30 tactical pause of the aircraft operations as explained in the drone encounter procedures.  Additionally, we made attempts to identify where the drone was headed and where it might be operated from in the area surrounding the fire."}
{"Tracking #":"16-0428","Mission Type":"Fire, Air Attack","Text":"At 1340 while flying ATGS on the Erskine Fire, Division C called and said that one of his units saw a drone flying over his division. Div C was adjacent to our type II helicopter dip site and was being used by helicopters at the time. We immediately told the helicopters to return to helibase and to look out for the drone enroute. We also had numerous airtankers working on Div J\/M 10+ air miles away from the drone sighting. We discussed the sighting with the ASM leading the retardant work and concurred that the risk was acceptable to continue working based on the distance and altitude difference. At 1358 Div C safety called and said they had found the drone and that it was on the ground. We transitioned with the relief ATGS at the same time that the all clear was given from safety, so we notified the relief that it was safe to resume all rotor operations. Grounded all affected aircraft until the drone was located and grounded."}
{"Tracking #":"16-0484","Mission Type":"Fire, Air Attack","Text":"Transitioned for relief air attack mission where 2 Firebosses & 2 Rotor Wing aircraft were working the fire. Approximately 20 minutes after transition, Firebosses returned to base for fuel & were put on hold. About 10 minutes after their departure, I noticed a drone or remote control aircraft flying in vicinity {approx. 500-1000 feet above} rotor as it approached the fire doing bucket work. UAS started flying away from rotor, but circled the fire about 1 mile out from ATGS pattern & approx. 2000 feet below us. I lost sight of the UAS when it was flying across the drainage from the fire. Continued to look for UAS & did not spot it again. ATGS aircraft was having a mechanical issue about the same time & had to abort the mission & return to base. Note: I initially thought it was a bird catching a thermal, but my eyes picked up on it being a UAS due to reflective glint {much like a mirror flash} from angle with sun. I was able to continue to follow it for awhile due to the reflective flashes....then got out of position in our pattern. ATGS pilot saw it also when it was at our 3 o`clock position. Kept a visual on the UA as long as I could while Immediately notifying aircraft on scene and ground contact running air operations.  Continued to look for UA & did not spot it again.  Also notified dispatch of drone intrusion on a command channel that many residents in the local area scan.   I understand USFS law enforcement officer made an attempt to locate the UA operator soon after notification with no luck.  Initiated phone call to dispatch upon landing at base & they were making necessary notifications to FAA, Airspace Coordinator, etc.  Recommended Forest do further public relations work via local newspaper, radio stations & social media about the ramifications of flying UAs in fire areas.I also contacted ATGS that I relieved and Regional ATGS coordinator last evening &\/or this AM."}
{"Tracking #":"16-0527","Mission Type":"Fire, Air Attack","Text":"On July 8 2016 19:10 a Temporary Flight Restriction {TFR} intrusion occurred on the XXX Fire near Pine Valley Utah involving an Unmanned Aircraft System {UAS} or drone. This TFR intrusion resulted in a near collision with Air Attack XXX. XXX was at an altitude of 11,000 feet when they passed the drone 30 feet off the right wing of the plane. The incident occurred on the XXX Fire at approximately LAT\/LONG 37 23 .104 113 31.149. Geographical location of Lloyds canyon and Forsythe Canyon on the Pine Valley Mountain range. This is the forth confirmed UAS intrusion on this fire. All Aircraft on the saddle were then grounded for the remainder of the day after the drone sighting."}
{"Tracking #":"16-0541","Mission Type":"Fire, Other","Text":"At approximately 1820 hours line personnel notified the ASGS that a drone was observed within the fire area 300-500 ft above ground level {see attached statement}. A TFR 6\/7671 of 5NM and 12M```` was in effect. At approximately 1845 hours the ASGS was notified by the Helibase that they observed a drone {see second attached statement}. The ATGS had just finished a cycle on the fire and all incident aircraft were at their respective bases. After 1845 hours there were no more sightings of the drone. However, all aviation operations were suspended for the remainder of the day. A portion of the incident map and a map depicting locations and times of the intrusion as described on the witness ICS 213 forms are attached. Air Operations personnel followed the UAS protocol including shutting down operations as the intrusion was unresolved. We {the decision team included IC, OSC, IOF, state and federal agency Aviation managers, AOBD and ASGS with SOF follow-up} took the opportunity to review the weather conditions, times, and fire situation for the previous four intrusions and considered these factors when completing a risk assessment for flights the following days. Mitigation to lower the risk included 1. Minimizing and consolidation of missions, concentrating our scheduling of personnel transport\/recon before noon. a time when no previous intrusions had occurred: 2. Utilizing the ````L in LCES by designating Lookouts from existing crews on key vantage points: 3. Continuing to utilize the Information command staff for key contacts, media coverage, and actions described in the Utah Fire and Education Team final report."}
{"Tracking #":"16-0572","Mission Type":"Fire, Air Attack","Text":"At 1500 a UAS was spotted over the Rock Crusher Fire {NM-MEA} by Air Attack. Lead XX was the only other aircraft on scene. The UAS appeared 300 - 400 ft below the Air Attack and approximately 500 – 600 ft above the Lead Plane. Air Attack followed the UAS protocol by notifying the Lead Plane and Incident Commander. The Incident Commander notified agency law enforcement who happened to be on scene of the fire. Air Attack proceeded to widen the aircraft orbit outside of the FTA and initiate a left hand pattern, in order to track the UAS for the purpose of deconflicting the airspace. The crew lost sight of the UAS. The Lead Plane also widen their pattern beyond the FTA. Within ten minutes of the sighting, the Air Attack and Lead were diverted to another initial attack fire. No firefighting aircraft worked the incident after the divert. Incident commander and aircraft were alerted to the UAS.  UAS protocol were followed during the incursion."}
{"Tracking #":"16-0585","Mission Type":"Fire, Air Attack","Text":"AAM: On July 12, 2016 Air Attack reported an Unmanned Aerial System {commonly known as a drone} near the Rock Crusher Fire. Notify the public, dispatch and tribe."}
{"Tracking #":"16-0657","Mission Type":"Fire, Air Attack","Text":"Near the end of our first shift over the fire, we were on the East side of the fire observing operations in Division Oscar. I observed a drone flying from the East to the West in Pacoima canyon toward Pacoima Dip,Air attack was at 6,500 the drone was approximately 1000 feet below us and approximately 3 miles West of where the aircraft were dropping in Oscar. During this intrusion we had air tanker operations occurring in Division Oscar and heli-tankers working just to the South in Division Oscar. When the drone sighting was confirmed, I made notifications to the Bravo that was working with the air tankers and I notified the heli-tankers of the drone. Following notification to the aircraft we began informing Air Operations and Operations of the drone. We began working on setting up a new dip site that the heli-tankers could work out of and continue to support the incident. While this was going on the incoming air attack came on scene and we briefed them on the drone incursion. As we departed the incident all aircraft in operation over the incident had been made aware of the drone. When we returned to the incident on our next leg to relieve the air attack, we briefly discussed the drone incident that had occurred just prior to our briefing them in to the incident. They explained that they had waited the 30 minutes as prescribed in the drone protocol and had no further drone sightings and then resumed operation out of Pacoima dip. Switching dip sites worked well and allowed the aircraft to continue to support the incident on a critical piece on line with active fire threatening the control line and it provided a good mitigation for the airspace that had been impacted by the drone intrusion. Air attack initiated the drone protocol and made notifications to all air craft over the incident.  Notified Air Operations and Operation about the drone incursion and selected an area for the heli-tankers to work out of that was well clear of the location that the drone had been sighted."}
{"Tracking #":"16-0697","Mission Type":"Fire, Helitack","Text":"Helicopter xxx was on a flight from Durango Airport to the Soap fire for IA. H-xxx was about 12 miles south of the Soap fire flying 1000ft AGL, when the pilot noticed a object off our 11 o clock. The crew on the left side of the aircraft saw a oblong silver object with antenna pass by about about 25 ft below the aircraft. The crew discussed what had just happend and looked around for a vehicle, houses or campgrounds. The crew did see about 5-10 homes in the area. The Manager notified dispatch and the FAO of the near miss when cell phone service became available. The manager filled out a UAS Intrusion\/Situation form and forwarded that to the FAO."}
{"Tracking #":"16-0705","Mission Type":"Fire, Other","Text":"A contractor observed a drone flying just north of the fire area before air options commenced. An agency representative contacted the individual and informed them that if you fly we can````t. They acquired the individual````s name, license plate and reported it to the local LEO."}
{"Tracking #":"16-0714","Mission Type":"Fire, Air Attack","Text":"During an Air Attack Mission on the Virginia Mountains Complex it was reported to the ATGS{t} at 1135 an Unmanned Aircraft {Drone\/UAS} over flew a helicopter. N-XXX was in bound to the Tule fire to conduct bucket work on the north end and was flying at 5000`. The pilot stated that the drone overflew them 100-200 feet and described it as a Quad-copter with a string antenna hanging below. N-XXX continued north 3 miles from the drone area to its assigned area. All aircraft on the fire were notified of the drone and it was relayed to Minden Dispatch. Dispatch was asked to relay the information to the Air Operations Branch Director on the IMT. All aircraft were advised of the Drone and asked of their comfort level to continue operations. The Drone was south bound, and for all aircraft to return to base they would have had to fly towards the area that the drone was spotted. It was 3 plus miles to the south of the area the helicopters were working. The decision was made to continue with operations but not bring any aircraft in the area where the drone was spotted for 30 minutes with the knowledge that the battery life is approximately 20-30 minutes for most drones."}
{"Tracking #":"16-0848","Mission Type":"Fire, Air Attack","Text":"While flying a air attack mission on the fire we had a `drone` intrusion into the TFR\/FTA. There were no active firefighting aircraft on the fire at the time of intrusion. I noted the location of the flying drone and notified the AODB immediately. Local LE was notified and placed in touch with me. I gave the general area we witnessed the drown and followed it around for 45 minutes. We couldn`t identify any drone operator. We finally lost visual contact with the drone. It appeared to be a commercial grade drown of 2-3 feet in diameter capable of high speeds. nan"}
{"Tracking #":"16-0866","Mission Type":"Fire, Retardant Drop (Airtanker)","Text":"Narrative: On August 21, 2016 at 18:40 hour, a private citizen reported 2 individuals flying a drone due south of the incident along East Camino Cielo. The patrol notified dispatch that there may be a drone flying in the area. Dispatch responded that the area was within a temporary flight restriction. The patrol proceeded up the hill to investigate the situation. The incident Heli-base overheard the traffic and inquired with the patrol if it posed a hazard to the aviation operations. The patrol responded that he was still investigating and did not know if a drone was in the air. The patrol made contact with the individuals and found out that they had been flying a drone but there was not one currently airborne. The patrol contacted Heli-base to notify them that a drone was not currently flying. Corrective Action:The patrol continued to educate the individuals of the dangers of flying a drone in a wildfire area with ongoing aviation operations.  The patrol than requested law enforcement to the scene to turn the investigation over.  Law enforcement is continuing the investigation and will proceed as appropriate."}
{"Tracking #":"16-0882","Mission Type":"Fire, Air Attack","Text":"While flying an air attack mission as an ATGS {t} over the Deep North Fire at 1838 hours, I momentarily observed a small orange object moving at a high rate in the opposite direction. The object was approximately 500 feet AGL {2-3000 feet below ATGS aircraft} and moving up a drainage at the north end of the fire from east to west. The pilot executed a 180 degree turn so the trainer or the pilot could confirm the sighting, but we were unable to locate the object. I observed the following characteristics of the object: small, moving rapidly, uniformly orange in color, and flying in a straight line away from the fire. I believe these characteristics to be consistent with a UAS. Total duration of observation was approximately 2 seconds. There were no other aircraft over the fire at the time of the observation. 1} Searched for the object without success.2} Notified helibase, approximately 4 miles away, so they could pass info on to helicopters who were preparing to recover to Colville.3} Notified AOBD.4} This SAFECOM."}
{"Tracking #":"16-0884","Mission Type":"Fire, Helitack","Text":"I was staffing the Cachuma Dip Site with one other Helitack personnel. We were down by the boat dock setting up water pumps to fill portable tanks for water tenders. I spotted a drone flying over the dock at approximately 500 AGL. The other Helitack personnel contacted the Helibase and advised them of the situation. I took off chasing the drone searching for the pilot. I contacted the Park Ranger via cell phone to help with the search. The Park Ranger found the two individuals piloting the drone by the front office. The drone pilot grounded the aircraft immediately. I caught up shortly afterwards. The drone was being operated in the flight path of the helicopters. Helibase was notified that the drone was grounded and law enforcement was contacted. The suspects gave us their information and left the scene. Shortly afterwards law enforcement arrived. Law enforcement contacted the two individuals to return to the scene by the cell phone number they provided. Upon return of the suspects the Forest Service LEO interviewed the drone pilot, while recording with his body camera. During his investigate he figured out that the drone was registered and they were aware of the proper procedures for checking the airspace. Since the drone was being operated in the fire````s temporary flight restriction {TFR} area and they had access to such information, the drone was confiscated and they were given a mandatory date to appear in court."}
{"Tracking #":"16-0969","Mission Type":"Fire, Other","Text":"At approximately 1400 on Sunday afternoon I received a report of a guy preparing to launch a drone near Lucia CA off of HW1. I immediately called air attach and informed him that there was a report of a drone preparing to launch near Lucia about 15 miles to the SE of his location and asked him to confirm that it was indeed outside of the fire TFR. The air attack confirmed that the location was 5 miles outside of the TFR. Meanwhile the TFLD that reported the drone turned around and went back to the drone location to talk to the pilot. By the time the TFLD reached the drone location the operator had packed up and left the area. Presumably because he saw the agency vehicle slow down and turn around. I then informed the incident air attack that the drone operator had left the are and was nowhere to be found. About 45 minutes later I received another call about a second drone sighting. This time it was flying inside of the TFR {and in a Condor sanctuary no fly zone} and a quarter mile from where our helicopters were dipping from about an hour before the sighting. I again reported the sighting to airattack who was working with several aircraft up drainage {2.5 miles N @ 4,000 ground elevation} from the drone location {sea level}. I instructed the STLD who reported the drone to solicit the help of the park rangers and confront the drone operator. They were successful in convincing the pilot to land the drone and to stop flying the drone near the fire TFR. Although I asked the STLD to collect any information about the drone and the pilot that he could he was unsuccessful as the pilot made a speedy getaway during a very high road traffic area and time. We immediately made contact with airattack and informed him that the drone had landed and was no longer a factor. An AAR was done the following day using the NWCG UAS Reporting Protocol matrix. Everything was done in the proper sequence and in a timely matter. We used that opportunity as a learning moment for everyone on the decision and stressed the importance to immediately report any drone airings up the chain of command and to the controlling airattack or aircraft. nan"}
{"Tracking #":"17-0038","Mission Type":"Fire, Reconnaissance","Text":"Prior to recon with XX {Type 1 Helicopter}, the fire IC and county sheriff along with County EOC, witnessed a drone doing a video mission on the fire and had to cancel the recon flight until the drone operator was advised to cease and desist drone operation due to cancelling firefighting operations recon.  The operator stopped the drone filming mission and departed the area after being advised he was hampering aircraft operations on the incident.  The IC advised the forest aviation officer of the incident and was able to continue with aircraft recon operations at that time. CORECTIVE ACTION, county sheriff spoke with the drone operator and advised the FAA will be notified if this ever happens again, the video footage was posted on WLOF news already and he was advised to cease and desist on any filming of active wildfires or while operations are on going"}
{"Tracking #":"17-0056","Mission Type":"Fire, Helitack","Text":"Shortly after take off, the helibase was over flown by a Drone and clear the area when the operator was finished with the photo mission and head for the Cheoah Boat ramp.  USFS LEO was called and tried to make contact with the operator but could not locate in the area.  USFS LEO will continue to try and locate for the next few hours @ 1630 Situational awareness of the possibility of the operator returning to location on any additional launches from the Cheoah Helibase, and submitting a Safecom into the national System for Regional awareness"}
{"Tracking #":"17-0065","Mission Type":"Fire, Reconnaissance","Text":"While at the Cheoah helispot, the manager sighted a Drone over flight of the helicopter XXXX.  The drone came from the boat launch area and headed straight over the helispot and helicopter. Requested the NCF LEO {{#}} 5331 Head over and talk to the operator and advised to stop flying over the EU aircraft, Mr Keeder and Mr killing agreed to stay away while the helicopter is at the base of operations,"}
{"Tracking #":"17-0155","Mission Type":"Fire, Air Attack","Text":"While preparing to drop retardant on a fire, at 1720 operations called me on air to ground radio said a drone was seen on the fire. He was going to locate the drone and the operator. I told him all air operations would be curtailed until the drone was found and on the ground. Told him that the SEAT was sent 5 miles to the west to orbit out of area, I climbed in alt and went south for 5 miles. After 10 minutes he reported it was on the ground and we resumed air ops with out further incident. Ground folks need to be super vigilant and report all sighting to a\/c."}
{"Tracking #":"17-0173","Mission Type":"Fire, Aerial Ignition","Text":"While conducting Ariel ignition on the XXXX XXXX fire Helicopter NXXXX, The ground personal noticed a drone over flying the fire inside the pending TFR and reported it to law enforcement, The LEO located the drone operator and advised he was impeding on an ongoing federal wildfire and interfering with air operations and to halt all filming operations, the LEO did write the operator a ticket, and has all his contact information for future contact by the FAA or regional office RASM. Advised the operator to halt all drone operations and was issued a ticket for impeding on a federal wildfire incident and intruding on Air operationswith a pending FAA TFR, also advised the GACC of SAFECOM"}
{"Tracking #":"17-0174","Mission Type":"Fire, Aerial Ignition (Prescribed)","Text":"AT 1730:  Drone encounter on the XX XXXX burn during second cycle of PLDO ops.  Drone was sited by ground personnel at DP12.  The Helicopter had just been in that area for PLDO ops and was making the turn on the opposite side of the burn to return to that area.  Ground personnel notified Air Craft and Burn Boss.  “the drone is hovering right over my head at DP 12”.  Aircraft gained altitude made intentions to return to helispot known to all resources. Returned at 17:35 Firing boss on board at the time was not the designated manager of the helicopter but was a qualified HMGB.  There was a brief discussion between the burn boss and firing boss on A\/G about what to do.  The burn boss indicated that finding the operator would be time consuming and it would be better to release the helicopter due to nearing pumpkin time. During the pre mission brief and GAR risk assessment drone encounters were discussed. It was stated that all ground personnel had been briefed about the possibility of drones that morning. It was pre-determined that any drone seen in the area would result in a shut down of air ops. The ground person at the drop point was quick to relay the information and the pre-determined action to return to the helispot and shut down was executed."}
{"Tracking #":"17-0276","Mission Type":"Fire, Other","Text":"May 20th 2017 at 1805: A drone was spotted 60 yards from the Helibase at approximately 50 feet above ground level: in the designated flight path of the helicopters when they make their descent to land at Helibase. It was white in color and approximately two feet in diameter. Helibase contacted 0TA, the helicopter who was flying a mission over the fire to inform him of the drone intrusion into the TFR and the hazard around the Helibase. The helicopter was asked not to come back to Helibase until we were sure that the drone was out of the area because of the major safety concerns that the drone inflicts on the helicopter in the air. Helibase Manager called the Air Operations Branch Director to inform him of the drone intrusion. Air Operations called the Helibase Manager back to inform her that the LEO was going to come tie in with the Helibase Manager to see where the Helibase Manager saw the drone land. The drone was watched by the Personnel on the helibase and the Helibase manager watched it fly over the Incident Command Post and hover for approximately 10 seconds before it descended down and landed near a residential residence. The LEO arrived, and Helibase informed him of where they saw the drone Descend and land.  The LEO had enough information to go make contact with the individual and was able to confinscate the drone and cite the individual. The drone flying around the Helibase imposes a huge safety concern for our pilots and personnel involved in aviation missions due to the possibility of a collision in the air which could potentially cause a fatal accident. The drone impeded on the operations of the Helibase because, if the helicopter needed to come back to Helibase right away for fuel or a mechanical issue they would safely not be able to due to the safety risk of the drone flying in the area."}
{"Tracking #":"17-0292","Mission Type":"Fire, Other","Text":"I was working as a Fire Effects Monitor{FEMO} assigned to the Fire and went to the Division Delta lookout for smoke and Fire behavior observations. I had another FEMO with me and there was also a lookout from the Hotshots in place. During the observations, I noticed a small reflection in the smoke during air operations, approximately 500 ft above the roadway intersection. I immediately pointed it out to the other two personnel. And they saw it. We watched it and noticed it slightly change the flight pattern, and were confident that it was a UAS. The IHC Lookout notified the appropriate chain of command, and they got the message out to Air Attack. At this point, the UAS was flying East\/Northeast and gaining altitude toward the top of the drainage. Shortly after it was reported over the radio, it disappeared. One of the aircraft working the Fire also spotted it, thereby confirming it was actually a UAS. nan"}
{"Tracking #":"17-0341","Mission Type":"Fire, Initial Attack","Text":"While assigned to the Douglas incident Douglas Air Attack {AA} was notified by Douglas Operations of an Unmanned Aircraft System {UAS} spotted flying approximately 200 feet over the fire area. Ground resources described a Red and White drone, however it was not seen by air resources. The Air Tactical Group Supervisor {ATGS} assigned to the incident immediately notified all aircraft, had air tankers return to base, and had helicopters land in a safe location. Law enforcement searched the perimeter and made public announcements to the neighboring residents.  Visual contact of the UAS was lost and after an extensive search of the area was deemed safe to resume air operations."}
{"Tracking #":"17-0362","Mission Type":"Fire, Initial Attack","Text":"A new fire was reported to the dispatch center at 1245 on June 15th, 2017. The fire was reported on Cemetery Hill, a location 1\/4mile from multiple structures and residences. At 1303 dispatch requested a Type-1 helicopter from the Boundary fire that was located at the Williams Airport to respond to the new start. As the helicopter was preparing to launch a report from the fire came in about a drone over the fire. Dispatch immediately called to have the Type-1 helicopter hold at the airport and not respond. Several County Sheriff and local Law Enforcement officers were on scene and tried to track down the drone operator. The drone eventually departed the fire area and the IC called to bring in the Type-1 Helicopter in at 1343. The drone never reappeared and the operator was not found. Quick actions were taken by dispatch to ensure the helicopter did not respond to the area until the drone was gone. The FAO and PIO on the forest will work on a press release about the incident to inform and educate the local community."}
{"Tracking #":"17-0414","Mission Type":"Fire, Other","Text":"Drone spotted on Division C by engine crew during suppression activities. 2 Air Attacks and 3 helicopters were working fire at the time. Air Attack was notified and Helicopters were returned to Helibase at Taos Airport. Drone was a white quad copter approximately 2 feet across. New Mexico State police were notified of the situation and are investigating. Location of incident was 36* 33.225`` X 106* 6.657`` Air Attack remained over fire to evaluate situation. Operator was not located. After approximately 1 hour of no additional sightings helicopters were returned to service."}
{"Tracking #":"17-0424","Mission Type":"Fire, Air Attack","Text":"While providing aerial supervision on the XXXX Fire, we had a drone incursion that passed within 200ft of the plane.  We shut down all flight operations and returned to YYYY. We ceased all aviation operations and returned to Flagstaff. Helibase, AOBD, operations, dispatch, and the IC were notified immediately."}
{"Tracking #":"17-0454","Mission Type":"Fire, Air Attack","Text":"UAS\/Drone intrusion on the Lightner Creek Fire on 7\/1\/17. TFR in place. ATGS was over the Lightner Creek fire prior to helicopter missions starting for day. Ground resources {DIV Zulu} reported to the ATGS that a local law enforcement officer with Durango Police Department had seen a UAS\/Drone flying from the vicinity of the Lightner Creek road toward the fire at approximately 0900 hrs. No other incident aircraft over fire at the time. High point on fire is 8300 feet and Air Attack was working at 9500 feet. With report of UAS intrusion ATGS had pilot climb to 10500 feet and notifications were made to Dispatch, Helibase, AOBD\/ASGS and local FAO. All planned helicopter missions over fire were held at helibase until situation resolved. All divisions contacted and requested to monitor area. No other sightings from incident personnel. ASGS contacted the local Deputy of the LaPlata County Sheriffs office, operator not found and no other sightings. As of 1000 hrs, ATGS, AOBD and OSC2 determined that it was safe to resume operations for day. Unable to locate UAS or operator. No further sightings. Ongoing law enforcement investigation with LPCSO. UAS protocol followed and intrusion form will be submitted."}
{"Tracking #":"17-0471","Mission Type":"Fire, Air Attack","Text":"7\/4  1045 while flying ATGS over incident, I observed a small white object flying over the black, 50-100 ft. agl, on the southeast corner of the fire. I pointed it out to the pilot and we watched it for several minutes trying to determine the nature of the object. Based on the plastic nature of the color {white was consistently shiny}, and the flight profile {hover and erratic} movement we determined it was most likely a drone. I then began reporting the incursion and pilot moved us out of the area, to the west flank to begin notification and shut-down helicopter operations. We had been approx. 3000-3500 ft. agl, and do not believe we were in danger. We made a cursory visual search for an operator but did not see one. operations were not at a critical point in aviation terms, 2 helicopters were over the fire. h-9bh was transiting south of the fire to a helispot on the sw corner {10+ miles from incursion}, i directed h-9bh to land at helispot and hold. h346 was working in div a nw corner of fire {10+miles}, and i also directed them to land and hold {airport north of fire}.  i also began notifying process {ic, dx, and faa}, incident personnel notified law enforcement.  after notifications were made, we landed at ykm {12 miles west of incident}, so that i could use my phone to review and determine a re-engagement criteria.  upon consultation with ic, dx and regional atgs coordinator, i proposed re-engagement of aviation resources on the west side of the fire based on the separation from the sighting {10+miles}.  and if the pilots felt comfortable and ensured that they examined the airspace they would be working prior to entry, they would be able to operate around east the fire after 1300 at their discretion.this proposal was discussed and agreed upon with the pilots and managers of the aircraft by cell phone.probably didn````t need to shut-down helicopter operations after discussing incident with others based on the separation, but i felt that the conservative call was appropriate based on my inexperience with uas incursions."}
{"Tracking #":"17-0477","Mission Type":"Fire, Initial Attack","Text":"On July 03, 2017 on the Keystone Fire {WY-MBF-17118}, during evacuation notification of the Lake Creek Resort area on the Laramie District of the Medicine Bow\/ Routt NF and Thunder Basin NG, Forest Service LEO witnessed a person flying a drone aircraft. FS LEO notified that person that they needed to land the aircraft immediately. At the time of the incident there was one type 3 helicopter, and air tankers. Drone incident was located about 4 mile south of the fire. There was no TFR in place at the time of the drone incident and the UAS did not impact any air operations. Action taken was that FS LEO made contact with individual and had them land the drone aircraft and leave the area.  To the best of my knowledge no individual was not cited.  Incident commander notified ATGS, and on July 5th notified District Ranger, Forest Supervisor, Forest Assistant Fire Management Officer, and Zone Fire Management Officer and Assistant Zone Fire Management Officer, Forest Supervisor notified Forest Fire Management Officer.  Forest Public Affairs Officer was going to mention incident in the next fire update."}
{"Tracking #":"17-0483","Mission Type":"Fire, Helitack","Text":"During ongoing Fire Operations on the Limerick Fire local law enforcement spotted an individual remove a drone from their personal belongings and begin to operate the drone 1\/4 to 1\/2 mile East of I-80 in the vicinity of the Fire. Law Enforcement approached individual and made them aware of the dangers\/violations of flying a drone near Fire operations and had them ground the drone and vacate area. Law Enforcement informed individual of the dangers\/violations of flying a drone in Fire Operation Area.  Law Enforcement had the drone operator put the drone away and vacate area.  LE recorded individual`s personal information and FAA drone license information."}
{"Tracking #":"17-0552","Mission Type":"Fire, Air Attack","Text":"Two SEATs were returning back to Mountain Home base after making a drop on the fire.  I was positioned on the General Aviation ramp to park the aircraft when the driver\/loader for one of the aircraft informed me that an Unmanned Aircraft System {UAS} was flying within the perimeter of the airfield.  I observed the UAS and immediately contacted the pilots to ensure they were aware. I continued to maintain watch of the UAS and its position in relation to the SEATs until both were safely on the ground. It should be noted that an approved UAS airfield is located approximately 3 miles East of Mountain Home airport. The SEAT base manager contacted the UAM and informed him of this action.  The airport manager notified the Public Works Director, Point of contact for the RCA airfield, and the local police who were going to respond to the area."}
{"Tracking #":"17-0569","Mission Type":"Fire, Other","Text":"On the Brianhead Incident near DP-48 a UAS was spotted by the Division Papa Safety Officer. The Division Supervisor was notified and responded to DP-48. Division Papa notified Brianhead Operations Section Chief, who notified the Air Operations Branch Director. The AOBD notified Brianhead helibase and informed them of the intrusion and confirmed that no incident air operations were currently underway. Once the Division reached DP-48 he made contact with the Drone operator. The operator was very cooperative and returned the drone back to DP-48. Division Papa was able to get the operators information and the operator left the area. Brianhead AOBD notified Color Country Interagency Fire Center and informed them of the intrusion. In addition, the AOBD notified the SLC Air Traffic Control Center. nan"}
{"Tracking #":"17-0571","Mission Type":"Fire, Retardant","Text":"At 1900 hours, the Whittier Fire was making an impressive downhill run off of West Camino Cielo. I was down highway 154 and turned on Old San Marcos Road. Approximately half way down Old San Marcos, I ran into an individual who was operating a UAS and filming the fire. I pulled over an asked the individual to cease operations. He was reluctant at first because he thought he was far enough away that he was no factor for the fire. The operator complied and landed the UAS. I informed him that he was in the middle of the TFR. The individual asked what that meant. I also informed him that there was a mobile retardant plant set up at the bottom of highway 154 and Fire helicopters had been flying over the very spot where he was operating. I explained what the TFR is and told him how much of an impact operating a UAS can have for aviation, fire fighters, and the whole operation. A good conversation was had, and the operator was thankful for the information. I contacted the IMT AOBD and ASGS, and suggested placing ``If you fly, we can`t`` posters along Old San Marcos Highway and Highway 154`` to help get the word out to the public. When I drove by this morning the IMT had the posters in place."}
{"Tracking #":"17-0628","Mission Type":"Fire, Helitack","Text":"Fire was County\/Rural with State Agency, in the rural hills just south of Spokane. Helicopter was arriving and local Chief on scene advised a drone was spotted. Helicopter shut down near the fire while crew put bucket on and got ready to dig line. Air Attack was ordered with 2 Fire Bosses. After 20 minutes nobody on the fire had seen the drone any longer. The helicopter fired up and engaged, as Air Attack arrived and confirmed it had been a while since the drone was last seen. A TFR was ordered as well when Air Attack was ordered. Operations continued for several hours with no further issues. Waited until comfortable drone was gone."}
{"Tracking #":"17-0812","Mission Type":"Fire, Water Drop (Helicopter Fixed-Tank)","Text":"Air Attack and 2 type 1 helicopters were flying over multiple fires on the  Complex. The 2 type 1 helicopters were dropping water when a drone was reported in the Dam area. A Local USFS Law Enforcement Officer and 2 Forest Protection Officers were dispatched to the area. All aircraft were sent back to their respective bases\/Helibases. Upon arrival the LEO made contact with 2 non-mechanical gliders. The Aircraft were then dispatched back to the fire. All aircraft were grounded till the situation was identified and resolved.  The Public Information Officers put out a news release.  The team Liaison spoke with the local glider club to resolve future issues."}
{"Tracking #":"17-0835","Mission Type":"Fire, Reconnaissance","Text":"Operation on the Six Rivers National Forest, Young Fire began on 8\/18 with the DOI agency FireFly VTOL UAS. The 8\/25 afternoon IR reconnaissance flight landing concluded with a propeller strike. The approach was set in guided mode with an automated RTL landing. Within approximately 5 meters from the takeoff location a side gust of wind pushed the UAS off target completing the landing 12 feet from center point where the ground was struck breaking the tips of two of the six propellers. No other damage occurred to the UAS. Corrective action was to relocate the takeoff and landing area to a larger opening.  The propeller strike location was selected based on line of site for the radio link.  Operations were moved to a larger area clear of all obstacles giving a larger buffer for any adverse winds on final."}
{"Tracking #":"17-0838","Mission Type":"Fire, Initial Attack","Text":"During initial attack on a local district fire, employee used a personal drone to fly .6 miles to check out a smoke report. Employee thoughts were to check the fire activity, the fuels between the crew and the fire, size of fire, and take a picture to send back to Duty Officer. The fire was burning in a Ponderosa stringer and only consuming the needle litter. Employee asked dispatch if they could get permission from D.O. to let fire clean up understory. While waiting for answer employee flew drone once more around the acre fire and recorded flight. Employee sent pictures and video to duty officer to show them that fire could be confined\/contained to under 5 acres. After the flights the employee was advised that they had in fact broke BLM Policy by flying a personal drone and without the proper certification. nan"}
{"Tracking #":"17-0867","Mission Type":"Fire, Water Drop (Helicopter Bucket)","Text":"This is to report a TFR Intrusion. A drone was flying inside the TFR. At the time this occurred the helicopter had been shut down to save flight time for operations. The airspace that the helicopter has been previously occupying for fire operations was exactly where the drone had intruded. It was on the South edge of the fire in Division Alpha. The drone was operating at an elevation of 9130, it was flying East at first and then West. The UAS was a black drone about 1 1\/2```` by 2```` in size. At the time of this report we have submitted a UAS Intrusion Report with the FAA. At this time we do not have a Case Number. The operator had been identified and Law Enforcement has been informed. nan"}
{"Tracking #":"17-0971","Mission Type":"Fire, External Load (Longline)","Text":"Nxxx had to return to base when positive contact with a UAS operation failed. The UAS pilot had confirmed frequencies and mission parameters with the aircraft before launch. Aircraft launched to perform a backhaul mission, while the UAS was operating, planning to fly with adequate separation. Once in the air Aircraft attempted to contact the UAS operator with no effect. Aircraft returned to base after no contact with the UAS operation. Aircraft took appropriate action, providing for safety first. The UAS mission was organized by the local agency representative to the fire. The fire incident team did not know about the mission until it was about to launch when the UAS pilot asked OPS for permission to fly. OPS said okay knowing that no one was flying at the time. Meanwhile the AOBD had cleared a backhaul mission to start and was about to inform OPS when he learned about the UAS unplanned mission. The AOBD tried to contact the UAS operation but was unable to do so. He then learned that Aircraft had returned to base and within a few minutes that the UAS mission had completed. Identified problems 1. UAS mission planning did not go through normal incident planning which would have captured intent, execution, coordination, and approval of the IC et. al.. 2. While an attempt was made to do the UAS mission right, such as obtaining frequencies and talking with the helicopter pilot and manager to guarantee proper separation, steps were missed such as gaining approval from the IC and access to the TFR through the AOBD or ATGS. 3. OPS gave approval to fly on the fire inside the TFR without the authority to do so. 4. The UAS operator did not respond to radio calls while flying, on command or air to ground, even though the radios had been used prior to flight to talk to OPS. It is unknown why this was the case. The UAS pilot depended on the agency rep to monitor the radio. 5. To obtain the UAS, agency rep had gained permission from the other incidents OPS to borrow the aircraft and operator. The UAS operator sent a text to the other incident aviation staff, which was not received because the cell tower was not working. This meant that the lend\/lease process where the other incident  AOBD would have informed incident AOBD did not occur. 6. The agency rep assumed that if he talked with OPS of each fire to borrow and use the UAS that the OPS would contact and gain necessary approvals and then told the UAS operator that it was okay to fly.   A meeting with the two fire aviation staffs, the UAS operator, the agency rep, the forest aviation officer was held to discuss what went wrong and how to make things better.  Here are the recommended actions:1.\t The UAS operator will verify approvals and planning processes have occurred before launching a mission as “pilot in command”.  He has the Interagency Fire Unmanned Aircraft System Operations Guide and will confirm items on the mission checklist pages.2.\tLend\/lease procedures for UAS will be the same as those for other aircraft.  This will provide proper briefings, TFR permissions, etc just as if it were a helicopter.3.\tSpontaneous missions should be considered a “watch out” and generate a pause to reflect on the mission as well as the procedures so that steps are not missed to expedite the mission.4.\tUsing text messaging does not guarantee communication.  Verifying requests, information receipt, etc may mean follow up conversations.  One should not assume that the absence of response is approval.5.\tOPS must remember that UAS are aircraft and must follow aircraft rules.6.\tCaution should be applied when a non-assigned to a fire person requests a mission within a fire operation or a TFR."}
{"Tracking #":"17-0977","Mission Type":"Fire, Reconnaissance","Text":"While flying an autonomous survey mission on the Complex, Fire, Division O we experienced a hard landing due to a depleted battery. At the end of its survey the 3DR Solo with a GoPro payload was approximately 1800’ from its home location. It reported 40 percent battery when it started its Return To Launch and started to fly back. To be on the safe side I had moved to a location approximately 600’ closer so that I could manually land it on the road. As the UAS approached I assumed manual control and started bringing it down manually. The battery level was dropping very quickly and at around 15-20’ it hit 10 percent and initiated its automatic RTL procedure. I pressed the “B” button numerous times which I had programmed to “Fly Manual” mode but there was no response from the UAS. It continued it ascent to 200’ and proceeded back to its Launch location. As it descended over its Launch location it lost sufficient power and fell at close to free fall from around 40-50’. On impact with the ground it it flipped over and the rotors continued to spin until A+B+Pause was pressed to cut power. The gimbal, GoPro, several rotors, and one leg were damaged. Batteries will be tracked on an individual level to identify ones that deplete faster and will be removed from service. Greater care will be taken when programming autonomous flights to ensure that their length will not exceed the battery life. Hitting the ``Fly Manual`` button should have returned control to the pilot. It is unclear why this did not happen."}
{"Tracking #":"18-0034","Mission Type":"Fire, Other","Text":"US Forest Service Law Enforcement Officer {LEO} noticed a drone operating 100` AGL on Angeles Crest- Hwy. 2 just west of Red Box. This drone operations was within the Wilson Fire TFR. No aircraft where flying at the time of incursion. K-14 Unit confiscated the drone and processed accordingly. The Angeles ECC made immediately notification to Air Operations.   Air Operations for the Wilson Fire made notifications to: Forest Supervisor, RASM, ATCC, and processed FAA Incursion Notification form to the Airspace Coordinator.FAO - Worked with PIO to get information out via twitter and other FS sites on Drone operations and operator responsibilities prior to flying a drone recreational with in the forest and fire areas."}
{"Tracking #":"18-0083","Mission Type":"Fire, Air Attack","Text":"AT 1334 hours while working as HLCO on Lilac Fire Branch II safety called on A\/G stating to standby for emergency traffic. Then after channel was clear he notified HLCO that a drone was spotted over Division O at the intersections of Olive and HWY 76 and drop point 101. HLCO had one other aircraft working in that area besides them. HLCO called helicopter XXX on victor and reported the drone sighting and then instructed them to clear the area and proceed east away from area, HLCO then flew east away from the sighting area as well. HLCO established an orbit area on east side of fire approximately 5 miles from sighting with helicopter XXX. HLCO then notified helibase of drone sighting, then contacted Branch II safety and let them know they were clear and to advise when they found the operator and drone was confirmed down. Relief HLCO came up at approximately 1345 and was cleared direct to east side of fire where they had established their orbit with XXX. Transition between HLCO`s occurred and first HLCO return helibase, relief HLCO waited approximately 20 minutes the drone was not seen anymore and the operator was not found, HLCO and helicopter XXX returned to helibase without entering the area of sighting. nan"}
{"Tracking #":"18-0147","Mission Type":"Fire, Air Attack","Text":"While working the fire with 2 seats we were notified by ground unit of a drone over the NE corner of the fire. The inbound seat which I just cleared into fire area was told to hold to the west of fire and we also moved to the SW of fire. Dispatch, AOBD, and IC were notified of drone and seats fuel was verified. Five minutes later at 1630 were notified by ground units that drone operator had been located and drone was on the ground. We again made contacts and resumed aviation operations. A TFR was not requested due to a short duration of aviation resources anticipated over fire. nan"}
{"Tracking #":"18-0241","Mission Type":"Fire, Air Attack","Text":"Air Attack 1 was working the Prairie Fire about 6 miles NE of Little Falls with FB-201, FB-202, and Helicopter 56BH. Each Fire Boss had made two drops with 56BH continuing to do bucket work. The Pilot of AA1 noticed what he thought was a bird fly underneath the Air Attack platform and above the helicopter that was doing bucket work as AA1 observed from a higher altitude. As the pilot continued to watch the object’s flight he observed that its flight pattern was not consistent with a bird, but that it was instead an UAS quadcopter. AA1 informed 56BH that a UAS had been seen over the fire and 56BH discontinued bucket work and landed at an LZ south of the fire. AA1 repositioned east of the fire and contacted the IC and informed him of the UAS protocol and asked the IC’s assistance in locating the UAS’ operator. The IC made contact with law enforcement and had members of the local fire department that was already on scene to disperse and try to locate the operator. The earlier tanker drops and helicopter bucket work had taken care of most of the running fire. Air Attack 1 contacted HMGB Westerman for an assessment of the fire and his opinion if the ground resources could handle the remaining suppression work. Westerman informed AA1 that in his opinion it could be held with the resources on scene. AA1 contacted IC Butler and relayed the assessment and the IC released AA1. 56BH remained on the ground for approximately 25 minutes after AA1 departed the fire to return to Brainerd TB. The HMGB contacted Brainerd TB and asked that they call the Air Desk to determine the next steps as attempts to locate the drone operator were unsuccessful, and the UAS had not been seen since the initial sighting. Air Desk confirmation was received that if the UAS had not been seen recently, and the operator could not be located, that the flight crew could use their discretion to lift off. The HMGB contacted the IC and confirmed that 56BH was no longer needed on the fire, and that no ground resources, the FD, or law enforcement had seen the UAS airborne. The HMGB let the IC know that 56BH would depart the fire to the south, clear the area as soon as possible, and would not recon. the fire before leaving. Great job on the part of AA1’s pilot maintaining situational awareness and spotting the UAS!  Another reminder that we need to remain vigilant and document all incursions so we can continue our public education and outreach efforts in the hopes of mitigating this issue.  Established procedures were followed and were successful.  UAS incursions in fire airspace have been steadily increasing over the last few years on a nationwide basis. Kudos to Parker the AA pilot on being heads-up and to the AA, IC and HMGB on the incident and to airtanker base and dispatch staff for following the established UAS protocols for deconflicting the airspace and making appropriate notifications to the FAA."}
{"Tracking #":"18-0296","Mission Type":"Fire, Water Drop (Helicopter Bucket)","Text":"The local exclusive use helicopter was performing water drops utilizing a 50 foot longline with a fast bucket on the Prison Hill Fire on May 20, 2018. At approximately 1839, several helitack crewmembers at the helibase {about 1 mile to the west of the fire} noticed a small personal style drone aircraft in our vicinity. As soon as the drone was spotted, it quickly proceeded in an east to west direction toward the area the helicopter was working. As soon as the drone was spotted, one crewmember immediately notified the pilot of the situation on the designated air to ground, while another crewmember was notified by the incident commander that an engine firefighter had also spotted the drone.  At this point, the crewmember and pilot agreed that we needed to cease air operations, land and shut down at the helibase."}
{"Tracking #":"18-0467","Mission Type":"Fire, Air Attack","Text":"At 10:15 Air Attack was over the fire flying over Division Tango at 12,000` MSL when the Air Attack spotted a drone flying at 10,000` MSL {approximately 3000` AGL}. It was a large drone Black Red and White flying the fires edge. The Air Attack called HeliBase and shut down all helicopters working the fire. The pilot maintained visual separation until we were in a position to leave the fire and return to cedar city. Once on the ground Drone protocol was initiated and all notifications were made."}
{"Tracking #":"18-0487","Mission Type":"Fire, Initial Attack","Text":"On the XXXXXXXX fire air attack noticed a small white drone flying in between the helicopters elevation and air attacks elevation about 300-400 feet above the ground. He notified the other aircraft and made a wide loop and lost sight of the drone. Local sheriff was on scene and was notified, unsuccessfully attempted to locate. At the same time, NOPS was notified of the intrusion and a Unit Intrusion Form was submitted. Helicopters were grounded for a short time then continued their mission.The drone was last seen going south from the lat\/long provided above. nan"}
{"Tracking #":"18-0564","Mission Type":"Fire, Water Drop (Helicopter Bucket)","Text":"Helicopter xxx began flying on the Kings Landing Fire during its initial attack at 1600. At 1630, a TFR was requested for the fire with a three mile radius, up to 3000```` MSL. A second helicopter xxx engaged the fire. At 1700 dispatch logged the helicopters reported a drone in the area of the eastern edge of the fire. At 1707 the IC reported the helicopters were disengaging from the fire until such time it could be confirmed there was no longer a drone over the fire.  The helicopters made wide circles looking for the drone.  Until such time they became comfortable the threat was gone, they continued to circle the fire.The TFR took effect at 1710.  No further drone activity was reported and aircraft operations continued with normal operations."}
{"Tracking #":"18-0566","Mission Type":"Fire, Initial Attack","Text":"During the evening news cast {KTVB, Boise}, drone footage was shown of the Cartwright Fire. The Great Basin ASAT team happened to be in Boise and see the broadcast. The proximity of the drone to the fire during retardant dropping operations was a concern. The ASAT team drove to the area near where the fire was to determine the distance the UAS was to the fire based on the footage. The UAS was within 1\/2 mile of retardant drops, and 1\/4 mile of the helitack`s helispot. During the visit, the property caretaker was present and said that he saw the drone and was concerned about how close it was to SEAT aircraft. A TFR was not up at the time. The UAS operator`s name and business was on the news cast footage. The UAS was not sighted by agency personnel during active firefighting operations. The BLM fire liaison for Boise District to the city of Boise was notified by the ASAT team the following morning. The ASAT team will make the appropriate notifications using the NWCG UAS incursion protocol. The ASAT team will attempt to contact the UAS operator and discuss the hazards associated with operating in the vicinity of active wildland fires, regardless of the presence of a TFR."}
{"Tracking #":"18-0595","Mission Type":"Fire, Water Drop (Helicopter Bucket)","Text":"During bucket work on the south side of the Rattlesnake Fire, pilot encountered a black drone at eye level as he was coming out of the dip. This was during the initial attack phase of the fire. The dip site was in the Little Salmon River next to Highway 95. The pilot notified Air Attack immediately and Air Attack advised him to set down at the helispot at the heel of the fire.  Air Attack then notified the IC and the IC assigned someone to go investigate near the dip site.  Neither the drone, nor the operator was found.  No other aerial operations were conducted the rest of the shift on the south side."}
{"Tracking #":"18-0666","Mission Type":"Fire, Reconnaissance","Text":"On 08\/01\/2018 H-XXX was conducting a recon for rehab with 2 Agency Personnel. At the southern end of the Grassy Ridge Fire on Div. B the pilot was flying at an elevation of 4700 ft. at approximately 09:25 when he noticed a white drone 100ft below the helicopter. The Drone was flying northerly direction into the fire and when the near miss occurred it dropped elevation and reversed direction. It turned 180 degrees and flew south back to the suspected operator. See and avoid procedures where taken and Helibase was notified. Helicopter operations where shut down immediately. ASGS, Div. B, Operations on the fire and local law enforcement where called shortly after incident. The pilot was able to take a picture of the white vehicle that the drone flew back to. This is a Drone intrusion and a near miss Approximately 4 miles inside the TFR. Upon notification of the intrusion\/near miss the rest of the recon was terminated and the helicopter flew back to the Helibase. All helicopter operations where suspended till air operations deemed the air space and situation safe. The Team on the fire and local Fremont\/Clark county law enforcement where notified and responded to the location of the suspected truck\/operator of the drone. In the discussion with the pilot and the Helibase manager after the incident, it was noted that pilot kept his situational awareness during the flight and avoided a serious accident."}
{"Tracking #":"18-0781","Mission Type":"Fire, Reconnaissance","Text":"UAS was climbing to 11,000 ft. msl on a reconnaissance mission when it experienced a rapid and uncommanded descent. The pilot took no action but monitored instruments until the aircraft regained a stable profile. The UAS descended 2,100 ft. in approximately 15 seconds, leveled out, and resumed the programmed flight profile. The pilot decided to terminate the mission, land, and troubleshoot the problem. No further problems were encountered. The vendor crew is reviewing the flight logs.  Initial indication is that the left wing aileron servo was sticking which induced an unplanned steep roll and descent.The aircraft will be inspected and tested at the vendor facility prior to future flights."}
{"Tracking #":"18-0809","Mission Type":"Fire, Other","Text":"At approximately 19:22 on 8\/17\/2018 an off duty Forest Service fire fighter reported a drone intrusion near the airport while an airtanker was in the landing pattern for runway 34. The drone was approximately 24 inches in diameter with black and red paint flying at approximately 450 feet in elevation. Proper notifications were made to command center, NOPS, FAA, local airport authority and Law Enforcement. Discussed drone intrusions at next briefing to inform pilots flying in and out of the base."}
{"Tracking #":"18-0811","Mission Type":"Fire, Air Attack","Text":"IHC Superintendent observed a drone in the vicinity of Division Zulu. IHC Supt relayed the info to Air Attack who subsequently communicated to working helicopters to return to Base. Air attack ceased operations and communicated to operations and incident communications the event and returned to Base. Information was relayed to AOBD, and Law enforcement. As of this safecom the operator has not been located. Removed aircraft from the potential hazardous airspace and communicated with operations if there was any further sightings. AOBD notified local FAO, dispatch, RASM, HOS, and R1 Airspace coordinator. Followed the NWCG flowchart and submitted safecom."}
{"Tracking #":"18-0821","Mission Type":"Fire, Infrared Imagery","Text":"During the parachute landing sequence, the chute did not fully deploy which resulted in a hard landing. The fuselage was damaged {manufacturer is repairing} and the EO\/IR gimbal may have been damaged {manufacturer is inspecting}. The parachute was packed incorrectly which caused a partial opening.  The drogue chute was packed down the lines of the main chute which restricted the canopy.The flight crew checked all parachutes on site and confirmed proper packing.  A recon\/mapping mission was flown on 8\/20 and the parachute opened normally.The flight crew will use a buddy check to ensure proper chute packing in the future."}
{"Tracking #":"18-0826","Mission Type":"Fire, External Load (Longline)","Text":"At approximately 1835 Division Whiskey notified Air Ops of a reported UAS sighting in the vicinity north of the Mobile Retardant Plant, inside TFR. At the time, one helicopter was performing logistical resupply missions to Division Oscar which had two crews at the time. Helibase notified the helicopter which took a far western roundabout approach into helibase and shut down. While Air Ops was making notifications in conjunction with Operations, Division Whiskey trainee notified us that one of their TFLDs was with the suspected operator. Law enforcement from both the Team and the County Sheriffs office responded to the area. The operator departed the vicinity of the TFLD prior to law enforcement arriving. A vehicle and person description was relayed to all law enforcement around the area and the subject was eventually pulled over near ICP. Flight operations were reengaged at approximately 1900 hours after the PIC and Helibase personnel, in conjunction with Air Operations concurred that the airspace was good for flight operations. Helicopter landed back at helibase. Air Ops followed NWCG reporting protocols and also consulted NR Airspace coordinator and Salt Lake ARTCC for reporting info. Local law enforcement are working in conjunction with the FAA. There were four unrelated misdemeanors also issued to the suspected UAS operator."}
{"Tracking #":"18-0839","Mission Type":"Fire, Infrared Imagery","Text":"On 8\/21\/18 We were doing an IR mapping flight on the Natchez Fire. The planned event was to record video with the payload at nadir {straight down} and hand off to the Data Specialist to update the perimeter. Before launching we confirmed with helibase there were no other aircraft over the fire and made out Restricted Operations Zone {ROZ} “hot” {an area defined where the UAS can climb to altitude before transitioning to the fire}. We launched at 903 from the launch point, climbing in our UAS ROZ. Once established at altitude I notified helibase we were transition to the fire to begin IR mapping, and to turn the ROZ “cold”. We transitioned to the fire at 8500 MSL. For an hour and five minutes we mapped the southern portion of the fire. At about 1008 the flight navigation software on the computer started to freeze, and then crashed. The contractor pilot exited the program and restarted it. It started back up but was frozen and pixelated. This was at about 1012. The contractor pilot then completely shut down and restarted the GCS. The GCS came back online and reconnected with the aircraft which had initiated a return to launch and was circling above us at the same assigned altitude. This was about 1016. The contractor pilot and I discussed recovering the aircraft or finishing up the leg that we missed. The aircraft did exactly what is was supposed to do, it initiated a return to home once it lost link with the GCS at the assigned altitude. We ensured we had good connection and the aircraft was responding correctly and flew a short ways to gather the remaining fire images. We debriefed as a crew on rebooting the system sooner rather than trying to exit out of the flight software and re starting it. Upon further investigation by the contractor pilot, the cause of the freeze and crash was due to continuous video gathering, using up most of the RAM of the computer. By rebooting we cleared and reset the RAM usage. At the next firmware update a default to record to aircraft sim card with an override to save to the computer. We also discussed keeping video logging to short clips saved to the computer."}
{"Tracking #":"18-0847","Mission Type":"Fire, Reconnaissance","Text":"The wingtip on a Silent Falcon UAS was damaged when it hit a rock after a parachute landing on a recon flight. The landing area was a 10 acre meadow {DP 95} on the north end of the xxx Fire. The parachute was deployed at about 120 ft agl, drifted about 50 feet, and came to rest near a few small rocks in the landing area. The right wingtip was damaged during the landing and replaced on site. The landing area was a very large meadow on a ridge top which was a good location to set up the ground control station {GCS} and conduct UAS operations. The weather was clear with wind out of the northwest at 5-15 kts. The aircraft performed its takeoff, recon flight, and landing with no problems, but the composite tip of the right wing hit a rock after landing in the meadow and had to be replaced. The components on the Silent Falcon UAS {including wingtips} are designed to be replaced in the field.  It is a common practice to replace damaged UAS parts after a parachute landing.  Wing tips, center sections, propellers, and stabilizers are all designed to be replaced in the field.The crew carries spare UAS components and the wingtip was replaced.  The damaged piece will be sent to the manufacturer for repair.Future landing areas will be inspected for rocks and other features that could cause damage to UAS."}
{"Tracking #":"18-0941","Mission Type":"Fire, Passenger Transport","Text":"A B3 type 3 Helicopter departed Helibase for H-24 at 1010 with HEMG{T} on board, some cargo and the long line loaded in the basket in order to commence a cargo backhaul operation from H-24. Five minutes after the aircraft departed the Helibase, personnel at H-24 reported a drone sighted about 1000` west of H-24. Helibase contacted the aircraft and directed the aircraft to return to base. The helicopter was the only aircraft over the incident at the time of the incursion. The Incursion Protocol was initiated by the helibase manager and Air Attack was notified of the incursion prior to his arrival over the incident at 1055. Air Attack conducted a high level recon over the incident and returned to Twin Falls. The Helibase Manager met with the local Sheriff who suspected it was hunters entering from the other side of the mountain as there are closures on this side nan"}
{"Tracking #":"18-0961","Mission Type":"Fire, Infrared Imagery","Text":"Coming in for a landing I attempted to hover to regain a level flight, I noticed the aircraft started to quickly lose altitude and it began to hover unstably. At this time I attempted to lift the aircraft to prevent it to drop altitude any lower, but was unsuccessful to do so. AB pause was also attempted but it was unresponsive. The aircraft dropped and hit the ground. Flight checklist was conducted. Level and compass calibration was also completed prior to this flight at the take off location. We had to level calibrate the aircraft twice. First one was prior to first flight. After putting in a new battery, the controller asked for level calibration prior to second flight. Both calibration was completed before the incident happened Unsure on what caused the aircraft to become unresponsive. I believe level calibration can be the factor."}
{"Tracking #":"18-0971","Mission Type":"Fire, Reconnaissance","Text":"Solo experienced loss of GPS in erratic winds near trees. Solo made contact with tree, resulting in loss of control and crash. As I dropped below the treetops, Solo lost gps, and the winds shifted. The nose of the aircraft was pointed at me, rather than away. Also, battery was falling through 25{{%}} as I descended, resulting in a ``low Battery`` announcement from the GCU. These factors contributed to a lack of focus on controlling the aircraft precisely in an attempt to get it on the ground quickly. As the aircraft drifted in the wind, a series of incorrect directional inputs and over-corrections were made resulting in the contact with the tree. Solo experienced several ``loss of gps`` incidents during that flight and previous flights.  Area was heavily timbered and in steep mountainous terrain.  Due to the frequent loss of GPS, flight should have been suspended or cancelled.  We should remember that just having eyes on the aircraft is only part of the equation."}
{"Tracking #":"19-0124","Mission Type":"Fire, Initial Attack","Text":"On 4\/16\/2019 Air Attack, 2 SEATs and a suppression helicopter were dispatched to a grass fire near Almelund, MN, in Chisago County. The IC had tied in with the Chisago Co. Sheriffs deputy on scene, and together they managed the personnel on the ground. Operations concluded with the fire being suppressed and all resources returned to their stations. A video on social media showed the SEATs and helicopter in action, making suppression drops on the fire. Some of the footage was taken by a UAS operating in the vicinity. Neither the Incident Commander, the deputy, or aerial firefighters were aware of the UAS. The county Emergency Planner, aware of the safety risk, thought his emergency response units were aware of the danger a UAS poses to piloted aircraft. Thank you for reporting this incursion. All UAS pose a great risk to flight crews regardless of the UAS```` mission and size. MN DNR is in the very early stages of UAS use and on occasion it may be necessary to utilize another agency````s UAS. Any activity with UAS needs to be approved by the Wildfire Aviation Supervisor or delegate, coordinated with the IC, and notification provided to aircraft on the incident. The best practice for UAS is to wait until the initial attack efforts are completed. Unauthorized operations of UAS which endanger manned aircraft are illegal and punishable by law. A Safety Alert was created and shared with Law Enforcement, Fire Departments, and Emergency Managers in addition to the press release regarding UAS. A similar event occurred in April, 2015 which was the catalyst for similar outreach to the MN State Fire Marshalls Office. Remember, if UAS are spotted in the vicinity, ALL SUPPRESSION AIRCRAFT ARE TO DISENGAGE FROM SUPPRESSION, LAND OR LEAVE THE AREA for the safety of aerial firefighters."}
{"Tracking #":"19-0162","Mission Type":"Fire, Other","Text":"The North 92 Fire was located on N. 92nd street and the Canal Bank Road on the Salt River Pima Maricopa Indian Community. We had 3 government vehicles on scene with 7 personnel. As I was preparing to leave the incident I spotted the drone hovering about 50 ft. to the south of our location at 12:06 pm. I switched to video and started recording at 12:07 when it lowered to approximately 7 ft off the ground and approached us coming close to fire personnel engaged in mopping up the fire. It then flew south and I followed it down 92nd street and then east on E Montebello Ave. This is where I stopped and the second video shows the drone circling my vehicle at 12:11 pm. The drone then flew back north towards the canal, west to Arizona State Route 101 where it flew over traffic heading south. I spotted an individual that I thought might be the pilot south of E Jackrabbit Rd on Scottsdale Community College property. I drove over to him and made contact. I was on the phone with Salt River dispatch and he provided a name and phone number to the dispatcher. He loaded the drone into a motor vehicle and left the area around 12:30pm. Contacted local law enforcement {Salt River PD}Contacted dispatch {Phoenix Interagency Fire Center}Contacted Regional Aviation Manager {Carlos Nosie}Contacted National Aviation Manager {Dave Underwood}"}
{"Tracking #":"19-0295","Mission Type":"Fire, Infrared Imagery","Text":"4 minutes into a IR flight on the XXX Fire the Solex app and the Solo controller showed battery close to 65{%} then dropped immediately to -1{%} on the Solex app and 0{%} on the controller. The UAS never went into RTH as a result. Pilot flew UAS back to home and landed as a precaution. Once on the ground the battery on the UAS had 5 lights showing on the battery. Another battery was put in the UAS and conducted a test flight close to take off area. We were not able to recreate this issue. New battery installed and made a test flight. Could not recreate issue"}
{"Tracking #":"19-0297","Mission Type":"Fire, Reconnaissance","Text":"Had several instances where the UAS {Parrot Anafi} would violently yaw left and right until I stopped moving and held hover with the sticks at neutral. It was as if it had hit an invisible wall and refused to move forward. It was very random when it would have this issue. I had had probably 9 flights before I started noticing this as a recurring issue. Each time UAS was landed without incident. Was recommended to re-calibrate UAS compass and reformat micro SD card. Will try this and conduct some test flights."}
{"Tracking #":"19-0298","Mission Type":"Fire, Aerial Ignition","Text":"Upon landing after an aerial ignitions mission it was noticed that one of the heads on a propeller bolt had sheared and was missing. The attached photo was taken, the propeller assembly was rebuilt, and a test flight without payload was conducted. The Visual Observer\/second pilot and I decided to proceed with the mission. The following flight with payload was conducted successfully but on landing we found that another and separate bolt head had sheared. The propellers are the high altitude? variety for flight above 8200 feet and the bolts are the silver, beveled type. 1. Check propeller bolts before and after each flight.2. Document all bolt failures and potential contributing factors.3. Adhere to wind and payload limitations."}
{"Tracking #":"19-0326","Mission Type":"Fire, Water Drop (Helicopter Bucket)","Text":"TRAINEE {T} DIVS L DRONE INTRUSION REPORTED BY WITNESS, 1720 ALASKA TIME See UAS Intrusion Form attached. At 1718 DIV L {T} was driving down AK Hwy 1 eastbound and observed a drone lifting off from vehicle parked at side of highway, DIVS L{T} stopped his vehicle and couldn’t cross to operator’s vehicle. DIVS L yelled at him to get the UAS out of the sky, then crossed the highway, and told him face-to-face to get the UAS on the ground immediately. DIVS{T} said if he didn’t, he would be arrested. He said, “OK, OK, OK” and landed it as quickly as possible. DIVS{T} informed him he was putting his firefighters and aviation resources at risk. DIVS{T} told him to get his equipment and himself out of there. Just as CH-47 passed by enroute to DIVS L, DIVS {T} radioed helibase to inform them of situation, conveying that UAS was on ground. AOBD {T} called DIVS {T} and discussed the situation. After AOBD{T} talked to DIVS, AOBD called AICC in Fairbanks and KIDC in Kenai, following drone intrusion procedures. In two separate conversations, one with F&WS LEO and the other with supervisor from the FAA at 1250 on 7\/12, it appears as if Kenai Dispatch {KIDC} called Soldotna PD, who sent texts to F&WS LEO, who didn’t receive them until this morning. It has been determined by LE and relayed to supervisor that it was a rental vehicle and the investigation and tracking down of the suspect is proceeding. Emphasized again at helibase briefing and main briefing especially for line personnel.  Checklist procedures followed."}
{"Tracking #":"19-0341","Mission Type":"Fire, Leadplane","Text":"At approx. 1130 hrs ATS spotted an object passing off our left side. It didn`t ``act`` like a bird {not diving, maneuvering, etc.}. ATS {T} in back also saw the object and agreed that it behaved more like a drone, than a bird. I contacted AA and queried if any one on the fire was operating a UAS. AA contacted IC{T}, and was told that there was no UAS activity on the fire {official or otherwise}. At the time we were in a lull as far as air assets, so the short investigative time didn`t have any effect on suppression. We surveyed the area from a safe altitude, and by the time the SEATs arrived over the fire, it had been close to a half hour since the sighting. Our crew discussed the situation and felt that enough time had passed that we felt the threat had been mitigated. No other ground personnel reported seeing anything unusual. There was a TFR {5NM radius upto 11,500 ft. MSL} in effect over the incident at the time of the incursion. At approx. 1220 hrs. {after AA had left}, the IC called the ASM to inform us that there was a civilian ``looking for his drone``. So clearly that confirmed that there had been a drone. At that point we ceased operations and had helicopters return to helibase, held the SEATs at KBAM. We also returned to KBAM. I````m not sure if this may be what the kids are doing these days, but both ATS{t} and I believe that the drone was camouflaged in a tan\/sand colored paint. Just something to think about out there."}
{"Tracking #":"19-0387","Mission Type":"Fire, Water Drop (Helicopter Bucket)","Text":"On July 24, 2019, the XXX Fire AOBD was notified of a drone incursion near the mobile retardant base\/XXX Reservoir dip site. The drone was observed by two security officers {SEC2, SEC1} flying at treetop level and below. Dip site monitors immediately notified Air Attack {ATGS}. ATGS then moved the two Type 1 helicopters that were using the City dip site to the XXX dip site which is located well to the north of the reported drone incursion. The helicopters were able to use XXX dip to continue providing water drops to the requesting divisions which were located a considerable distance away from the reported drone incursion. The security officers visually followed the drone as it flew in a westerly direction. They lost visual contact with the drone over a subdivision. Security officers and law enforcement {LEO} saturated the area where the suspected drone operator may have been located but were unsuccessful in locating the individual. AOBD maintained active communications with the Type 1 IMT law enforcement branch as LEOs were trying to locate the drone operator.  The IMT law enforcement branch increased LEO presence in and around the incursion area the following day.  The IMT aviation branch worked with the PIO’s to impress upon the public the importance of not flying drones in the TFR.  PIOs are working with local media outlets, TV, radio, newspaper, and social media to increase the “No Fly” message.  PIOs are also posting signs in the neighborhoods\/subdivisions to increase awareness of the “No Fly” message.  PIOs have also increased their presence in the subdivisions as well."}
{"Tracking #":"19-0399","Mission Type":"Fire, Reconnaissance","Text":"During a pre-flight engine run-up, a battery hatch cover disengaged from the fuselage and hit one of the vertical takeoff and landing {VTOL} propellers. The motor failsafe activated and the motors shut down. The propeller and battery hatch cover were replaced and the mission was conducted.The aircraft manufacturer {L3} is in the process of redesigning the battery hatch cover."}
{"Tracking #":"19-0409","Mission Type":"Fire, Reconnaissance","Text":"This is a TFR violation report for the XXX Fire on the XXX NF. TFR{{{#}}} XXX. At approximately 1800 hrs local time, three V22 Ospreys flew over the UAS Launch and Recovery Zone {LRZ} at approximately 8,000` msl {2000` agl}. The crew for Unmanned F107 was preparing to depart the area for the day and the UAS was not airborne. Our radios were packed up, so we don`t know if the aircraft attempted to call on the assigned TFR frequency. The local FAO was notified the morning of 7\/30. File SAFECOM and reach out to federal partners through established channels to ensure they are aware of firefighting aircraft\/firefighting TFRs.  This has been discussed with the local FAO."}
{"Tracking #":"19-0429","Mission Type":"Fire, Reconnaissance","Text":"At approximately 0830 Division Alpha notified field operations of a drone intrusion over the fire area all aircraft operations were suspended for 1 hour after the drone was last seen. All drone intrusion protocols were followed and the air operations were resumed at 0930. The local dispatch, IC {T}, helibase manager, and local law enforcement were contacted. There was no contact made with the operator of the drone. The only corrective actions I would recommend would be increase availability of drone detection equipment, to increase the awareness of drone intrusions."}
{"Tracking #":"19-0447","Mission Type":"Fire, Infrared Imagery","Text":"The Type 2 UAS was ordered for a number of fires in and around the XXX Wilderness on the XXX of the XXX National Forest. The mission was to detect any heat remaining on the fires, map their perimeters, and provide imagery to local fire managers. The day before the mishap, a flight was conducted on a fire that went smoothly. On the second day, a similar mission was planned over a different fire. A thorough safety and operational briefing took place prior to launch with all members of the mission. The only difference in this mission and the previous day`s was the location of the fire and the placement of the launch area. The UAS flew over the fire for just over an hour collecting data before the Pilot in Charge {PIC} began the procedures for landing. On final and while flying on an automated flight plan, the UAS aggressively changed its angle of attack and pitched down. The UAS impacted the ground at this angle one-quarter of a mile from the intended landing zone. The fuselage, leading edges of the wings, and tail boom all sustained significant damage leading to the aircraft being deemed not airworthy. The angle of attack change is normal for this aircraft on approach to its landing zone. The crash was due to an incorrect input into the Ground Control Station {GCS} of the landing zone elevation. This elevation was gained from a new GPS out of the box. The input into the GCS was 5915 and the actual elevation of the landing zone is 6280. This incorrect input made the aircraft believe that it was over 300 feet higher and continue with this angle of attack prior to leveling off for landing. The PIC and flight crew will double check inputs into the GCS prior to launch to verify that they are correct.  Correct elevation will be gained from more than one source.  If you are using a new GPS, cross-reference with a GPS that is known to be accurate."}
{"Tracking #":"19-0448","Mission Type":"Fire, Reconnaissance","Text":"On 8\/7\/2019 the UAM was informed that Cooperator UAS operations had taken place on a BLM ownership fire within the district the day before. The operations had taken place during the IA phase of the Meyer Springs fire. The fire at one point had helicopter operations on it and an air-attack ordered. The UAM called the Dispatch Center to gather more information. The dispatch had been informed after the fact that the flight had taken place and that a UAS was used to get reconnaissance information for the fire by a county fire resource. The UAM called the District Duty Officer as well as the County Fire Warden to inform them of the situation and discuss the situation further. Upon further investigation the pilot of the UAS was FAA Part 107 qualified and was flying his personal UAS over the fire to talk the BLM engine crew in and provide GPS coordinates of the fire. UAM contacted the pilot to inform him that the BLM currently did not have an ability to use Cooperator Aircraft or personal UASs on emergency incidents unless they were FAA part 107 qualified, A-450 Basic Remote Pilot, S-373 UAS Incident Operations and Interagency Carded for Make and Model per the BLM National Aviation Plan. UAM explained to the pilot the importance of not flying his UAS over BLM ownership fire until he had received the proper training. UAM also sent an email to all district fire personnel explaining the situation and providing BLM\/STATE\/LOCAL Policy referring the the situation. PLEASE NOTE: THAT THIS FLIGHT WAS IN NO WAY MALICIOUS. THE INDIVIDUAL WAS FAA PART 107 QUALIFIED AND WAS TRYING TO PROVIDE A SERVICE THE THE CREW ON THE GROUND TRYING TO FIND ACCESS TO THE FIRE ON FOOT. IF ANYTHING THIS SHOWS THE URGENT NEED TO PROVIDE GENERAL AND FIRE UAS TRAINING TO OUR COOPERATORS!"}
{"Tracking #":"19-0455","Mission Type":"Fire, Other","Text":"At approximately 1125 on Tuesday, August 6th, a UAS was observed flying in the area of DP 122 on the Williams Flats fire. The Safety Officer notified the DIVS who notified the ATGS. The Air Attack held up a Type 1 helicopter en-route from helibase due to the incursion until the airspace was cleared. DIVS contacted a Marine Patrol LEO who initially thought it was a Fire UAS before approaching a nearby house boat. The drone operator on the house boat admitted to flying his drone over shore and was apologetic. After discussing the dangers of flying a drone over a fire and the potential fine associated with it, the LEO decided not to ticket the operator. The LEO notified the Air Operations Branch Director for the team of the incident. The LEO chose to educate the operator rather than fine him. The team Public Information Officer contacted news agencies in Washington to report on the incident and educate the public. The Air Operations Branch Director made the notifications to appropriate agency aviation personnel as well as the FAA."}
{"Tracking #":"19-0475","Mission Type":"Fire, Air Attack","Text":"Air attack in air with two tankers and two helicopters. Arrive on scene over Sweeney Fire. Two drops made from airtankers and two helicopters were working the active flanks. Air attack spotted a drone flying at approximately 1000ft AGL and reported to the helicopters the location of the drone and advised them to hold at the dip site. none."}
{"Tracking #":"19-0482","Mission Type":"Fire, Air Attack","Text":"AA-xxx was returning to GVAAB after an out of unit dispatch, when they encountered a UAS directly over Rollins Reservoir, 6 nm SE of the airport. The air attack aircraft and the white quadcopter were at the same altitude of 4700 msl. The UAS was spotted approximately 100 ft. off of the left wing. Rollins Lake sits at 2100 msl. Timely notifications were made to the Grass Valley ECC, the airport manager at the Nevada Co. Air Park, the TNF helitack crew at White Cloud Helibase, and the TNF Forest Aviation Officer."}
{"Tracking #":"19-0489","Mission Type":"Fire, Infrared Imagery","Text":"UASP and UASP{T} were ordered to provide intelligence for a Resource Benefit Fire. UAS was chosen do to fire being in wilderness and it was the least amount of impact to the Wilderness. UASP flew 3 missions utilizing a UAS with a standard imagery camera with no incident. UASP{T} launched with IR camera and flew to the fire and captured imagery. The UASP and UASP{T} had set a return to home trigger point at 50 percent battery life. At 49 percent battery life the Pilot started his return flight. The Fire was about 2000 vertical feet above launch point so as the pilot flew back to the launch point he was descending. The Visual observer stated he lost visual with the aircraft and to stop descending. Pilot stopped descending and continued to fly at the current altitude towards the launch point. Shortly after that Visual Observer heard a audible ``smack`` and pilot lost connection to the aircraft. Both Pilot and Visual Observer determined Aircraft had hit something {assumed a tree}. Due to the time of day Pilot and Visual observer decided to hike off the hill and return the next day to locate the Aircraft. The next day Pilot hiked up to the last know location of the UAS as recorded on the Flight Controller app. Do to limited Cell phone service until he gained elevation and the late night before and early start that morning notifications were not made until approximately 0800 on 8\/15 when pilot hiked high enough to gain cell service. Pilot notified Interagency Aviation Officer, USFS UAS Program Director and UAS Coordinator. The decision was made to report to the Mishap line as well due to it being a missing aircraft. Pilot located the Aircraft at approximately 1300 roughly at the last known coordinates and immediately notified via text everyone previously stated except the mishap line that aircraft had been located. Two of the Rotors were damaged but other than that the aircraft had no visual damage. Further tests and inspections will need to be done before the aircraft is returned to service. The UASP and UASP{T} spoke extensively about the mission and the decisions that were made that led up to the accident. The correct action would have been to have gained elevation until line of site was reestablished before continuing flight back to Launch zone. The pilots decision to continue to fly at present altitude and not climb was influenced by the amount of battery life left on the aircraft and previous experience with 3DR batteries. The UAPS and UASP{T} felt that all the decisions that were made up to that point were sound risk management decisions including picking a launch site that was not the initial planned launch site to allow them to be closer to the fire but at a lower elevation and to delay the start of the mission until early evening when winds were minimal. Neither the UASP or UASP{T} felt that there was any pressure to complete the mission and that they maintained a high focus on risk management throughout all of the flights."}
{"Tracking #":"19-0519","Mission Type":"Fire, Reconnaissance","Text":"On take off for a recon with a type 3 unmanned aircraft system, the right rear motor failed and the aircraft went into a uncontrolled right yaw. The aircraft maintained flight and stability but the yaw was uncontrollable due to 1 of the 6 motors failing. The aircraft was at approximately 15 ft agl. Any inputs for control were unsuccessful. The aircraft was re positioned over the road. After failed attempts to control the left yaw, the decision was made to land the aircraft while in an uncontrollable yaw. The aircraft was landed successfully. On site DOI UAS Inspectors were able to determine that on the power distribution board, the positive connection for the right rear motor was loose and showed signs of shorting.  {see pictures}  The screw was removed for inspection and it was determined the screw had come loose and caused the contact for the positive connection to arch and melt the surrounding plastic.  It also melted the Left rear motor positive connection.The screw threads showed signs of damage that appear to be from vibration.  The loose connection from the screw caused the positive connections to short and arch.The aircraft was taken out of service and will be sent back to the manufacturer for repair."}
{"Tracking #":"19-0575","Mission Type":"Fire, Other","Text":"During operational period multiple tfr intrusions occurred on all divisions. The divisions did a good job notifying helibase and the AOBD. No tail numbers could be identified. It should be noted that before today we had very few intrusions. In an attempt to get a handle on the situation the AOBD had maps of tfr area mad and he distributed them at the Willow airstrip the suspected launch point.  Many of he pilots contacted thought the tfr was lifted at the same time as the Deshka Fire to the South.  The issue seemed to improve then rotor traffic started showing up. Mat Su dispatch was notified and a safe com was generated"}
{"Tracking #":"19-0601","Mission Type":"Fire, Air Attack","Text":"ATGS was supervising two rotors over the Walker Incident on day 2, when radio traffic over PNF Forest Net mentioned a drone flying on the north side of the Genesee Valley. Rotors were configured for bucket operations, and were dipping upstream of the Fournoy Bridge. The dipsite was approximately 1 mile from the drone location. The acting DFFMO for the PNF observed the drone while driving toward the drop point near the heel of the fire, and informed Walker Operations. I was notified on the assigned A\/G, and immediately relayed the issue to rotors overhead. This occurred around 19:00, and there was a TFR in place over the fire. After discussing the intrusion with the rotor pilots, they felt comfortable offsetting further from the estimated location of the UAS, and finished out the end of their fuel cycle supporting ground contacts that were positioned 2-3 miles south and upslope of the valley. Law enforcement located and made contact with the recreational drone operator shortly thereafter, and confirmed that the UAS was on the ground. A Plumas Co. Sheriff and USFS special agent were collocated with Operations at DP-10, and responded code three to locate the drone operator. Timely communication from the ground after sighting the drone allowed the ATGS to deconflict the FTA intrusion. Law enforcement educated the hobbyist regarding the hazards of flying drones in firefighting airspace, and described the legal repercussions of TFR intrusions. The operator promised there would be no repeat performances of said action."}
{"Tracking #":"19-0628","Mission Type":"Fire, Reconnaissance","Text":"While flying a fire, the UAS experienced an issue of unknown sorts and crashed to the ground. From the people watching the aircraft near the fire, they seem to think it was some sort of motor failure due to no more noise coming from the aircraft and it falling straight to the ground. There was a small gust but nothing more than prior gusts during the flight. Winds were 6-8 mph and fairly steady. The flight was done by the same UAS that had been in a crash that required two new rotors two days prior and this may or may not have had an effect on this flight. The UAS is inoperable, however, a policy of a thorough inspection is necessary, which was completed after new propellers were installed. Also, knowing the drone had previously been involved in an accident, I had multiple people watching the flight just in case something happened."}
{"Tracking #":"20-0013","Mission Type":"Fire, Air Attack","Text":"While conducting firefighting operations on the Fire,  The Hotshots reported a UAS incursion within the TFR.  The ATGS trainee immediately returned one type 1 and one type 2 helicopter to helibase until further notice.  The ATGS trainee notified Fire Operations and suggested Law Enforcement be notified. Law enforcement was able to detect the UAS in flight, but was unable to locate the pilot.  After approximately 20-30 minutes without seeing the UAS, all firefighting aircraft returned to working the fire and the UAS was not seen again. Law enforcement unable to locate UAS pilot. Dispatch completed UAS FAA Notification Form immediately"}
{"Tracking #":"20-0032","Mission Type":"Fire, Reconnaissance","Text":"Calibrated UAS prior to flight. Took off and flew mission without issue. Noticed that the terrain was higher than the FreeFlight6 app would allow at max altitude and decided to land to change locations. I was flying back to the landing site and began descending when the UAS violently began to yaw left and right and was flipping in mid air. I continued to attempt to descend and gain some kind of control. I heard the sound of the drone change {sounded as if the prop came off in mid flight} and it fell straight down and crashed 30ft from the landing site. Upon recovery of UAS I noticed several broken props and that the camera gimbal was damaged as well. I also noticed that one of the screws that hold the props on was still attached but was missing the plastic hub that the prop would be attached too. IC and FAO were immediately notified. I attempted to get control of the UAS as much as possible, but was unable to regain and control. I was able to recover the UAS."}
{"Tracking #":"20-0037","Mission Type":"Fire, Water Drop (Helicopter Fixed-Tank)","Text":"Drone Incursion: On October 31st, 2019, at 18:15, CPTR XXX was dispatched to the Maria Fire near Santa Paula, CA. At about 22:30, while conducting water drops near the heel of the fire, at a peak of South Mountain, CPTR XXX, spotted a drone flying in the area of the communication towers near the heel. Hand Crew working on the ground in that area also spotted the drone. This was promptly reported to Air Attack. Air Attack advised all helicopters working on the incident to be grounded at the Santa Paula Airport Helispot until it was deemed safe to fly. Helicopters were grounded for about an hour. Maria Operations requested Local Sheriff to respond units to investigate the drone, and drone operator. Local law was unable to locate. At about 23:40, it was deemed safe for helicopters to re-engage in water dropping operations. This was due to the fact that nobody had seen the drone for over 30 minutes. CPTR XXX was comfortable with re-engaging on the fire. Air Attack ordered all helicopters to be grounded until the drone incursion was investigated and deemed to be safe for aircraft to operate in the area.Law enforcement was responded to investigate and take action as necessary.CPTR XXX made notification to the FAA via phone call."}
{"Tracking #":"20-0094","Mission Type":"Fire, Aerial Ignition (Prescribed)","Text":"After completing PSD operations in Compartments 34 and 35 operations proceeded into Compartment 38. At approximately the 4th pass in the area the PLDO noticed an individual whom appeared to be repeatedly looking at their tablet and then back in the air and notified the Pilot and RXB2 on board. The RXB2 noticed the vehicle and individual doing the same activity and took the precaution of a drone in the area by ceasing aerial ignition and notified Dispatch that they will be returning to Hsp 2. While enroute to the helispot, the RXB2 notified the FS LEO and the nearest ground ignitor {who was also a FPO} the description of the vehicle and to check the area for any drone activity. Once on the ground at Hsp 2, the RXB2 notified the HMGB of the possible UAS activity.  The HMGB then notified Dispatch and informed them that aerial ignition operations have ceased until confirmation of area was clear of drone use.  Contact was also made to the detailed USFS R8 UAS Coordinator.The FPO\/ground ignitor saw an individual who appeared to be taking pictures of the prescribed burn with their phone and advised the individual of the helicopter conducting aerial ignition in the area.  The individual acknowledged their awareness of the helicopter and admitted to flying a small UAS in the vicinity but landed when seeing the helicopter approach.  The FPO was shown the UAS in its case by the individual.  The FPO informed the individual that we are unable to safely fly if the public is operating drones, the individual departed the scene.  FS LEO verified the scene secure and cleared to resume PSD operations."}
{"Tracking #":"20-0151","Mission Type":"Fire, Water Drop (Helicopter Bucket)","Text":"Departing Crow Point fire’s helispot to conduct bucket operations on the fire. The helicopter manager spotted a quadcopter flying 200-300 yards off the nose of the helicopter at roughly 30-50 feet AGL. The helicopter manager radioed the helicopter to land due to a UAS in the area.   Notification made to Dispatch, Law Enforcement support was requested. No contact was made, no witnesses were found. Air operations resumed and operations were completed without any further incident."}
{"Tracking #":"20-0194","Mission Type":"Fire, Air Attack","Text":"Air Attack was diverted from the Canal Inc on CA-MMU to the Fork Inc also on CA-MMU. Both helicopters from the Canal Inc were reassigned as well, but had to refuel in Madera before responding to the Fork Inc. Airtankers were released prior to the divert back to Columbia and Hollister. We arrived at the Fork Inc and discussed priorities with IC and two airtankers from Porterville arrived soon after. Both tankers dropped and were put on a load and return to Fresno. In the time between the tankers returning and helicopters arriving, the pilot saw a blip on the TCAS and then saw a quad copter UAS just down hill from the incident. We lost sight of it in our right hand turn, but still could see it on the TCAS. After several minutes, it no longer showed up on our equipment or were we able to physically see it. About that time all 4 assigned incident aircraft began checking in. I had all aircraft hold out at their current position outside the FTA. I notified IC and MMU dispatch. IC sent a law enforcement officer to the parking lot at Redinger Dam which was most likely site where the UAS operator would be. The fire by then was getting some good containment, so after discussion with IC, we released the incident aircraft back to base in stead of putting them at risk. Air Attack was released several minutes later and returned to base.        Held incident aircraft out of the FTA and made notifications to IC and MMU ECC. Not knowing the location of the UAS and the decreased probability of the fire increasing in size, all aircraft were released.\r\n\r\nAviation Safety Comments: Prudent risk\/benefit analysis by the Air Attack.  Local LEO was notified appropriately.  This is a good opportunity to remind both air and ground crews to refresh themselves on the NWCG Unmanned Aircraft System Incursion Protocol for Wildland Firefighters. (Available online.)"}
{"Tracking #":"20-0279","Mission Type":"Fire, Reconnaissance","Text":"Air Operations on the Fire was notified by UAS managers (UASM) for Unmanned FXXX that an airspace intrusion may have occurred in the TFR during their night operations on the evening of June 11, 2020.  The UASM checked the TFR information and found that there was no TFR in effect when the observed aircraft entered the airspace where Unmanned FXXX was operating.\r\nThe original TFR boundary was extended by the airspace coordinator earlier in the day on June 11, 2020 to accommodate large air tanker operations.   Later during the operational shift on June 11, 2020, Air Traffic Control (ATC) contacted the airspace coordinator to establish a new TFR in order to better accommodate airport traffic operations.\r\nThe Fire’s Air Operations Branch Director contacted the airspace coordinator directly to discuss the TFR creation process and establish why TFR coverage was not in effect for the planned 24-hour period.  The 24-hour TFR coverage was established to provide safe airspace for the planned nighttime UAS operations on the Fire.\r\nThe airspace coordinator investigated the issue and discovered that both TFRs were, in fact, noted to provide 24-hour coverage over the Fire.  The gap in 24-hour coverage resulted after the first TFR  was effectively canceled at 2100 hours on June 11, 2020.  The new TFR  was created and was noted to provide 24-hour coverage.  However, the new TFR would not take effect until 0600 hours on June 12, 2020.  This process created a 9-hour time gap (2100 hours on June 11, 2020 through 0600 hours on June 12, 2020) during which there was no TFR coverage over the Fire.\r\nAircrew narrative:\r\nAt the beginning of shift on June, 11 (20:00) the flight crew verified airspace and found the TFR to be active. During the incursion, the manager attempted to contact the aircraft on the AM frequency assigned to the TFR with no avail. Then switched to the airport Unicom and attempted contact. During this time the TFR was reviewed and found to be invalid. At this point, the UAS held elevation at 5000 msl while the other aircraft flew over the top at 6500 msl. The decision was made to cancel the mission and land the UAS as soon as possible and wait for the TFR to be reviewed and active for the next shift.  No other UAS flights were conducted during this operational period\r\n Shift change from day to night with aviation is a relatively new procedure and it was emphasized that communication of any TFR changes will need to be communicated to all parties.  There is a possible communication barrier during this change as there is no AOBD on the night shift. Consider oversight on all shifts if there are multiple UAS missions during the night shift."}
{"Tracking #":"20-0281","Mission Type":"Fire, Other","Text":"A civilian noticed an individual on the side of Hwy near the fire working the controls of what was believed to be a drone and called 911.  Law Enforcement Officers responded and contacted the operator.  Police Dispatch notified the Interagency Dispatch Center who then contacted the Fire’s ATGS to warn of a suspected drone flying on the west side of the fire, possibly inside the TFR. After being contacted by Interagency Dispatch, the ATGS grounded the aircraft that were currently working the incident until the airspace was clear. The Fire’s AOBD and Forest Aviation officer produced maps that were provided to Law Enforcement confirming the drone operator was inside the TFR boundary. "}
{"Tracking #":"20-0289","Mission Type":"Fire, Infrared Imagery","Text":"On 6\/12 Division Bravo had significant fire growth which impacted indirect lines and caused multiple slop-overs that could not be detected due to intense smoke cover. Crews were pulled off the line while aerial resources continued to engage the fire to slow progression. An Unmanned Aircraft Systems (UAS) Infrared (IR) mission was requested for the early morning of 6\/13 to access the slop-overs and current fire conditions on Division Bravo and produce video and IR imagery to Division Bravo and operations before briefing at 0800. At 0400, UAS operator woke up to find out night resources had departed the line early and would not be available for visual observer (VO) duties. A nearby resource was awoken and asked to assist. There were two flights the morning of 6\/13, the first went well without incident and UAS pilot\/visual observer (UASP\/VO) moved to second location along Dalton Hwy for a different angle of the fire. Upon return of second mission, a critical battery warning occurred and pilot began returning in a more rapid descent than normal. VO asked if there was anything they could do to help but pilot was focused on aircraft and did not respond. As the aircraft neared the landing zone, the pilot did not orient the aircraft nose-out as usual and pitched the aircraft in an unintended direction. This caused the aircraft skid to hit on one corner, break, and (flipped) the aircraft on its nose while moving forward into brush. After aircraft was disabled and inspected, multiple rotors and one landing skid were determined to be splintered and unusable. Brief VOs not familiar with UAS and emergency protocols more thoroughly.  Order qualified UASP to assist in UAS operations.  Plan and coordinate critical missions more adequately before launching operations.  Always follow aircraft and operations checklists.  \r\n\r\nSee attached file for additional information.\r\n\r\n\r\n\r\n"}
{"Tracking #":"20-0451","Mission Type":"Fire, Infrared Imagery","Text":"TFR Incursion by manned fixed wing aircraft. All missions were flown within a TFR over the Fire. At 0846 the UAS was launched after notifications and a preflight checklist\/ inspection. I climbed to 40 ft agl and performed a controls check. I continued to climb to 80 ft agl as I headed south. At around 0848, the visual observer and myself heard an aircraft operating to the southwest. I held position (around 200ft out from the take off location) as we scanned the area for the aircraft. The aircraft was spotted (a yellow super cub) and was initially headed west in a valley approximately 10 miles southwest of the fire and 6,500 ft msl. The aircraft turned north still outside of the TFR. At this point the decision was made to land the UAS. The UAS was on the ground at 0851. The super cub then turned east entering the TFR and flying over the bottom third of the fire, before turning back to the west flying directly over the fire again. The altitude of the aircraft appeared below the altitude of the UAS take off location of 6,300 msl. At the time the UAS was on the ground and disarmed, I placed to call to dispatch to inform of the incursion. The IC was also notified. The aircraft departed the TFR and we lost visual as it headed northwest. No tail number was seen. Dispatch called and had reported the incursion to the tower at Helena Regional. The tower did not recognize the description of the aircraft. \r\n All proper notifications were made before the flight. The sound of the aircraft first alerted to the visual observer and myself the aircraft’s presence in the area. When visual was attained the aircraft was low. Due to the position of the UAS take off location, we were able to see a large area of airspace around the TFR and fire and maintain ”see and avoid”. The decision to land was made promptly although the UAS was close by, we were able to have the UAS on the ground before the Super Cub turned towards the TFR. Dispatch and the Incident commander were notified of the incursion, who in turned notified the tower at Helena regional. As PIC I chose to remain on the ground, for a number of hours in the event the aircraft returned to the area."}
{"Tracking #":"20-0464","Mission Type":"Fire, Reconnaissance","Text":"Setting; Relatively small fire (approx. 450 acres) burning at the base of the mountains. Incident helibase and ICP were located at a school directly below and in close proximity to the fire. Only one aircraft was assigned to the fire. \r\n\r\nEvents: Helicopter was conducting a reconnaissance mission when helibase personnel heard and then observed a UAS flying over helibase towards the fire. Helibase personnel immediately notified helicopter that a UAS was observed headed in their direction. Helicopter informed helibase that the helicopter would be departing the area until it could be confirmed the UAS was on the ground. Helibase personnel quickly located the UAS operator in the ICP parking lot and the UAV returned to the ground.  Corrective actions taken were to communicate the unauthorized UAS to aircraft. Have aircraft depart the area until it could be confirmed the area was safe and to have the UAS operator land the UAV.\r\nHelibase personnel took a photo of the UAS operators' license plate and incident personnel contacted local law enforcement. State Aviation Officer note: Citation was issued to the UAS pilot"}
{"Tracking #":"20-0495","Mission Type":"Fire, Aerial Ignition","Text":"On July 3rd 2020 a UAS module was conducting PSD operations on Division Juliet on the Wood Springs 2 fire with a DJI M600 with Ignis 2 PSD payload. The module had flown a few missions and landed to refill the PSD for an additional mission. After refilling the machine and conducting a preflight inspection the pilot and visual observer ran through the preflight checklist and proceeded to take off. Once the aircraft was off the ground and climbing the aircraft automatically began to lift the landing gear into flight position. The landing gear on the left side of the aircraft operated normally, the right side did not and failed to raise. The pilot tried to manually cycle the landing gear but the right side was unresponsive.  Because the Left gear was working properly the pilot was able to lower the gear and safely land the UAS.  Once on the ground the plot and visual observer inspected the aircraft and were able to determine that the two screws that hold the landing gear servo on the right side of the aircraft had become loose, and one was missing. Because of this the drive gear on the servo was not making contact with the landing gear and therefore unable to raise the landing gear. The missing screw was replaced and both were tightened. After the servo was reattached the right landing gear was tested and was functioning properly. OAS personnel were on scene as UAS module crew members and determined that the aircraft was airworthy. The aircraft was used to continue to conduct PSD missions for the rest of the shift.\r\nIRAM South: No further action."}
{"Tracking #":"20-0552","Mission Type":"Fire, Initial Attack","Text":"During initial attack of the fire an unauthorized drone was spotted in the fire area at 1730. Center manager notified me of the sighting and I took action to suspend air operations until we were confident safe operations could continue. FMO was notified of intrusion and a search of the area was requested to look for an operator. None was found. Law enforcement notified. At 1800 I was notified that the drone had left area and a request to return air operations was received but declined until we were sure the drone would not return. At 1900 after discussion with FMO and with no further drone sightings, we reestablished air operations. There was no TFR in place. Notifications were made to the  Forest FMO, RAO and RASM. Contacts were made to a local sheriffs office to inquire about drone countermeasure technology. A demonstration of this tech is scheduled soon. "}
{"Tracking #":"20-0556","Mission Type":"Fire, Air Attack","Text":"While overhead of the River Fire in the Paso Robles area myself and the pilot spotted a UAS flying around the fire area at approximately 200-400 ft. AGL.   At the time of the drone sighting the fire was winding down.  Myself and the two tankers were overhead orbiting with no tactical maneuvering.  Immediately upon identifying the UAS I advised both tankers of it's approximate location and released them back to base which was 4 miles away.  I reported the UAS incursion to the IC and the ECC and requested law enforcement to attempt to locate the operator.  After advising the IC and ECC we also returned to base.  The UAS operator was never located.  Aviation Safety Comments: Good work by the ATGS with all safety precautions followed, along with the notification of the local LEO's.  For review, attached to this SAFECOM is the NWCG Unmanned Aircraft System Incursion Protocol for Wildland Firefighters."}
{"Tracking #":"20-0567","Mission Type":"Fire, Reconnaissance","Text":"At 1200 hrs. Helicopter NXXX lifted from Helispot 50 (H-50) for a recon with the fire's Incident Operation person, while doing the recon over DIV Zulu between 1200-1238  hrs., the Helicopter Crew-member at H-50 called Helicopter NXXX to inform had them that he had seen a drone momentarily flying south of H-50 at 100 feet above the ground and flew south away from H-50. The Pilot had asked the Helicopter Crew-member if he still had it insight and he's answer was \"NO\". The Pilot then called the Dispatch Center and told them that a drone was seen flying around at H-50 within the Temporary Flight Restriction (TFR) area. Immediately we got a hold of Law Enforcement personnel (LEO) on scene to see if they would drive around the immediate area to locate the drone operator, but didn't see anyone out there. In the meantime Helicopter NXXX still over the fire and away from H-50 had made contact with the Helicopter Crew-member at H-50 to see if the drone was seen again, is was not. The Helitack personnel and LEO had spoken to a few vehicles within the road closure area and nobody had witnessed or had seen the drone. At 1305 hrs. the Pilot with Helicopter NXXX de-conflicted his approach from the northeast, the opposite direction the drone was seen departing too. A Lookout was staffed at the time of the incident, before making the approach to H-50 the Pilot inquired of the Lookout for any traffic near H-50 of any vehicle, person, or drone. Having no visible traffic in the area an approach and landing was completed to H-50. The drone was not attached too or seen over the fire but only within the boundaries. We did not see the drone for the rest of the day. Once we heard that there was a drone sighted at the fire, near Helispot 50, we immediately started communicating with everyone (Fire, Dispatch and Law Enforcement personnel) and started looking and searching for the drone and operator. Throughout the day we continued monitoring for the drone.\r\nIRAM South: Fire personnel were somewhat unsure of  protocol for drone incursion of their aviation operation. Discussion of protocol and notifications required occurred and greater awareness is in place. No further action."}
{"Tracking #":"20-0583","Mission Type":"Fire, Leadplane","Text":"At approximately 2030 local time while flying the left flank of the fire and prepping for the next Airtanker drop, I spotted a drone glinting in the sun.  I was able to see it following the left flank of the fire at approximately 5500’ MSL along some large power lines.  The Air Tactical Supervisor (ATS) in the right seat of our airplane was also able to see the drone and confirm its presence in our work area.  We immediately notified the other aircraft on scene (a large Airtanker and a Type 3 helicopter on a recon mission) of the situation.  We had the Airtanker continue its high orbit and held the additional incoming air tankers on the ground at the Tankerbase.  On our next orbit, we were able to see the drone still in our work area.  The ATS notified dispatch and gave them as much information as we could about the drone.  We continued to orbit and were not able to see the drone again after two additional orbits, thus we made a show me pass on the run for the air tanker on scene with both of us hyper vigilant for the drone.  We were unable to spot the drone.  We briefed the tanker who was comfortable with continuing the mission.  After dropping the Airtanker with no further drone sightings, we ordered up the two additional tankers at the Tankerbase and continued operations with no further issues. Ground personnel and law enforcement officers looked over the area the UAS was reported to be operating in without success in finding the UAS or operator "}
{"Tracking #":"20-0641","Mission Type":"Fire, Infrared Imagery","Text":"DURING UAS MAPPING\/IR OPERATIONS ON THE DOUBLE CROSS FIRE NE OF BUFFALO WYOMING A HUSKY FIXED WING ENTERED THE DOUBLE CROSS TFR. UAS PILOT WAS GETTING READY TO LAUNCH FOR A PERIMETER MAPPING AND IR MISSION WHEN THE VISUAL OBSERVER HEARD A PLANE COMING FROM THE NORTH. WE CEASED OPERATIONS UNTIL WE COULD GET A LOCATION ON THE AIRCRAFT. WE NOTICED IT COMING NORTH TO SOUTH LOW LEVEL (100-200 AGL), WHICH WAS AT OR BELOW OUR ELEVATION. THE AIRCRAFT MADE 1.5 REVOLUTIONS AROUND THE FIRE AND DEPARTED TO THE WEST. AT APPROXIMATELY 1030 THE AIRCRAFT RETURNED TO THE FIRE AREA FLYING EAST TO WEST AND FLEW ACROSS THE MIDDLE OF THE FIRE AND DEPARTED TO THE WEST. \r\n\r\nBOTH INCURSIONS HAPPENED DURING BATTERY SWAPS SO NO UAS WERE IN THE AIR AT THE TIME. THE N-NUMBER WAS IDENTIFIED AND REPORTED TO CASPER DISPATCH BOTH TIMES. \r\n\r\n\r\nTHE N-NUMBER WAS IDENTIFIED AND REPORTED TO DISPATCH BOTH TIMES AND PROPER TFR INCURSION NOTIFICATIONS WERE MADE. \r\n\r\nCREW DISCUSSED BEING VIGILANT IN LISTENING AND LOOKING FOR OTHER AIRCRAFT EVEN WITH A TFR.\r\n\r\nDISCUSSED EMERGENCY OPERATIONS IF WE HAD MORE TFR INCURSIONS. IN THIS CASE THE AIRCRAFT WOULD HAVE BEEN FLYING BELOW THE UAS  OPERATIONS AND ACTIONS OF HOW WE WOULD DIVERT IF THAT SITUATION HAPPENED WERE HAD WITH THE CREW. "}
{"Tracking #":"20-0652","Mission Type":"Fire, Initial Attack","Text":"During initial attack on 19 July at approximately 10:30 AM, the NPS engine crew witnessed an R\/C Aircraft over the Valles Caldera with a wingspan of approximately 4 feet.  They notified Santa Fe Dispatch and attempted to locate the operator but were unsuccessful.  They were not sure if it was a plane or helicopter style aircraft.  In speaking with the staff at the Caldera, they were told that it is not uncommon to see Remote Control aircraft over the Caldera, due to the openness of the area and the proximity of the Highway 4 along the southern portion of the Preserve.  At the same time we were dealing with a series of lightning caused wild fires to the east above Los Alamos and in Bandelier National Monument that ultimately involved our helicopter 1PA and the Type 1 S-61, 917. Notified Dispatch of the RC Aircraft\/Drone. Attempted to locate Operator.  Will notify region to see if signage would be appropriate along highway.  RAM note: Great to be proactive during initial attack and letting dispatch know an aircraft was in the area prior to agency helicopters getting on scene. "}
{"Tracking #":"20-0744","Mission Type":"Fire, Air Attack","Text":"At 1446, drones were witnessed flying within a fire incident TFR and reported by a civilian; the civilian reported to tanker base and tanker base notified FS dispatch center. Law enforcement conducted sweep of the area at reported location.\r\n\r\nActing RASM (jm) comments: spoke w\/FS dispatch indicating State dispatch was also notified of the reported intrusion; all incident aircraft were informed of the intrusion, AA working the fire did see at least one drone, no aircraft were grounded as a result of this report (confirmation of ASRS NASA form and any addt'l info including results of law enf actions is pending)."}
{"Tracking #":"20-0796","Mission Type":"Fire, Air Attack","Text":"At 1930 on the Apple fire on the west side the fire, helicopter 5CH working buckets on the fire edge.  I was watching 5CH go into a dip site after his drop on division F and a drone flew over 5CH  but under AA52 fling at 10,000 feet AGL.  We circled over the drone keeping an eye on the drone. After spotting the the drone I had 5CH hold at the dip.  I informed 5CH of the drone and when the path was clear I sent 5CH back to Redlands heli base to shut down. I informed Pairs dispatch, OPS and heli base of the drone and shut down all aircraft.  After all the helicopter were on the ground we left the area and headed back to San Bernardino. Aviation Safety Comments: Unknown if the operator was located.  All proper UAS airspace intrusion procedures were followed.  "}
{"Tracking #":"20-0822","Mission Type":"Fire, Other","Text":"The mishap occurred roughly 2.5 hours into a planned 3 hour mission at approximately 10:40 pm.  The mission objectives for the flight had been completed and the crew as preparing to bring the aircraft to landing, monitoring the aircraft visually as well as through the GCS.  The crash was located within the hour and the lithium batteries were secured for safety.  The remainder of the wreckage was recovered by 1pm on 8\/9\/20, with full pictures and deliberative mishap investigation process per AgTS and DOI mishap guidance. \r\n\r\nFireEye UAV Unit 2C (FAA #: N8887S) was destroyed while working on the DOI On-Call contract near Globe, AZ on the Cassadore Springs fire, August 8, 2020.  The aircraft was circling normally at 1000’ AGL in Guided mode, when the Cobra A33n engine failed.  The RPIC, who was holding the joystick at the time, attempted to command the aircraft to Fly-By-Wire B (FBWB) mode, to try to fly the aircraft manually.  The aircraft remained in Guided mode thereby attempting to maintain altitude without engine power which resulted in the aircraft stalling.  The aircraft then spiraled and crashed, impacting the ground approximately ½ mile from the landing pad.  The team arrived at the site within the hour, secured the batteries, took pictures confirming that fuel was in the header tank, location of batteries, etc.  The team returned the next day to perform the Mishap Investigation and material extraction in daylight.\r\n\r\nDuring the investigation of the mishap an engine teardown was conducted by the engine manufacturer.  I was determined that an undetermined design flaw lead to a failure of the piston that caused the engine to quit.  There was extensive damage to the piston skirt.  The engine manufacturer is still working to determine why this occurred.  \r\n\r\nContributing factors were ambiguous Mission Planner messages for high latency and joystick enabling, crew task saturation, and high radio signal latency.\r\n Factor 1 – Causal (Engine Failure)\r\n1.\tReplace current A33n engine with another engine tested and certified by P4F and our engineers.\r\n\r\nFactor 2 - Contributing (Mission Planner messaging)\r\n2.\tReplace current Mission Planner messaging with clear indications of joystick status. \r\n3.\tUpdate Mission Planner to automatically enable the joystick during any startup or reboot. \r\n4.\tSoftware prioritization of C&C signal over video on Silvus radio\r\nFactor 3 – Contributing (Task Saturation)\r\n5.\tMove engine indications RPM, CHT, Fuel Used and Fuel Pressure to the Actions Tab to reduce pilot workload. (No more swapping pages to see RPM) \r\n6.\tAdd specific training to brief engine failure immediate action CRM prior to every flight. \r\nFactor 4 – Contributing \r\n7.\tRedesign installation of wingtip antenna on the FireEye to improve connectivity at longer range.\r\n"}
{"Tracking #":"20-0872","Mission Type":"Fire, Aerial Ignition","Text":"During UAS aerial ignition operations on the Pine Gulch fire we encountered a hang fire on the Ignis 2 PSD machine. The event occurred while pilot (UASP Aerial Ignition Trainee) and Visual Observer (Qualified UASP Aerial Igniton) were conducting UAS aerial firing operations on the night shift of the Pine Gulch Fire. The UASP flew to the area of the burnout and successfully completed the first leg of the burn pattern dropping  30 balls. The UASP was repositioning to initiate another leg of  firing when the aircraft gave a hatch motion error and puncture motion error. The VO assisted the pilot in resetting the Ignis per protocol. After reset the error became a red error signifying that it was unrecoverable in flight. The visual observer\/qualified operator noticed that there appeared to be some form of heat signature visible through the camera that was not expected. He stated he believed there was hang fire in the dropper and took control of the aircraft controller. He then turned the camera to look directly at the Ignis 2 machine and visually confirmed fire in the dropper. He successfully initiated emergency procedure using the radio controller to detach the dropper from the hopper. The IGNIS 2 functioned as designed and the hang fire was separated from the hopper. The UASP remained over the ignition area swinging the jettisoned dropper to visually ensure that fire was extinguished in the dropper for approximately 2 minutes before flying back to landing area. Upon inspection of the aircraft and PSD machine, the melted sphere was still in the dropper. Minimal heat damage was noticed on one of the hopper hatches. No other damage was noticed. The machine was cleaned and bench tested, then flight tested before further use.\r\n\r\nAn AAR was conducted discussing what happened and how it was mitigated with the entire module. A good discussion was had regarding the procedures to follow when a unrecoverable error occurs in flight. Including immediately using the camera to identify any situations that would require the jettisoning of the slipper block and the need to ensure that you do not leave the fire area when there is potential to spread fire beyond the planned ignition area.\r\n\r\nThe next night another UASP had a hang fire, but the ball was witnessed to fall from the released dropper.  Pilot returned to the LZ without incident and the aircraft\/IGNIS was inspected and returned to service.\r\n\r\nTo my knowledge these are the first hang fires to happen in over 100,000 balls dropped. An AAR was conducted discussing what happened and how it was mitigated with the entire module. A good discussion was had regarding the procedures to follow when an unrecoverable error occurs in flight. Including immediately using the camera to identify any situations that would require the jettisoning of the dropper from the hopper and the need to ensure that you do not leave the fire area when there is potential to spread fire beyond the planned ignition area.\r\n\r\nThe ball spacing is derived from the IGNIS App based on distance.   The machine will not drop if not moving.   The machine will drop at the defined distance the operator sets in the IGNIS App.\r\n\r\nDuring both hang fire events the ball spacing was set to 0ft to put as much fire on the ground as possible.\r\n\r\nAs a corrective action it was decided to adjust the spacing drop rate from 0 to 13 ft.    It is assumed the machine was having a hard time \"keeping up\" with such a fast drop rate.  We will monitor the change and report the findings to the community of UASP PSD operators.\r\n\r\nThe manufacturer was notified as concurred with the corrective action."}
{"Tracking #":"20-0949","Mission Type":"Fire, Aerial Ignition","Text":"Upon attempting to land after conducting night aerial ignitions the aircraft collided with a tree, tilted and fell about 15' to the ground. The aircraft incurred broken props, broken arm locking tabs, and a broken landing leg. The Ignis housing was cracked around the 3D printed plastic main body. The pilot stated that he had lost perspective of the aircraft position and the pad. He also said that he could not see the tree line as it blended in with the darkness. There was very little natural illumination and we were using truck headlights to light up the pad.  There was discussion about how the truck headlights had possibly obscured the pilots night vision and made it more difficult to pick out the tree line. The previous nights we had used a hand held LED light to spot the aircraft while incoming and to spot the pad while causing less washout. To correct for the loss of perspective for night landing we discussed having the visual observer 90 degrees off of the landing pad and the pilot so he could assist with ensuring obstacle clearance. It was also discussed using the camera to confirm location before descending.  \r\n\r\nRASM:  It is confirmed that in fact this is not a reportable accident due to no damage to property, other than the sUAS, or injury to persons; rule is specific to UAS.  After the incident, the team did exactly what they are supposed to and should do, analysis & self-analysis.  They deserve credit for practicing that notion, to continue to improve and correct, individual and program advancement.  The corrective actions are accurate but some “food for thought” and “thinking out loud” is offered in addition, and they are just that.  Now that we are finding both the need and the authorization to fly at night, a strong suggestion is to expand aviation training for the interagency UAS community to include, what is particular to this case, a robust night flying learning package.  There are so many aspects of night flying and the resulting tactics, techniques and procedures that we can take advantage of for further skill development.  In fact, the agencies ought to own an obligation to provide them with all the tools possible.  A fair amount of night flying incorporates compensation and it sounds like this group is successfully doing that but possibly keenly figuring it out on their own, and they are actually doing a good job of it.  But are we leaving too much up to discovery learning?  This training can try to avoid that and help further develop those skills.   There were some things going on that night that this teaching may have had the crews better prepared for; the darkness of a moonless night, the black of an already burned area, the scorched black (invisible) snag tree, adjusting by using artificial illumination, trying to wash out competing and obstructing artificial light and more.  A pure UAS pilot might not otherwise have a night flying proficiency like a maned aircraft pilot would have established.  Too many subjects to list here completely but the following are mentioned.  Visual Illusions, blind spots (and how to counter them), off center viewing, minimum altitudes, vertical climbs and descents to and from those altitudes when necessary, night vision, protecting night vision, artificial illumination, different types of artificial illumination, natural light and how to use it all of them to your advantage and how to avoid & counter it to your advantage (intentional washing out to mention just one), UAS’s version of a cross between VFR & IFR (a true vertical assent\/decent, perhaps return to home and auto land) and human factors particular to night flying.  A lot more can be covered here but certainly for this discussion a resource for skill improvement and growth, individually and for the greater program.  As we broaden in missions, so to do we need to mature in exposure and training.  There is formal education in this area, a discipline within a discipline of sorts; we might capitalize on it and order the tools this community should have.\r\n"}
{"Tracking #":"20-1042","Mission Type":"Fire, Reconnaissance","Text":"A Parrot Anafi  UAS was being flown along the southern edge of Div W for EO video\/fire reconnaissance.  While in flight less than a mile out from the Launch\/Landing point, the VO and Pilot saw the Anafi spin on its y-axis then drop. Video feed and connection was lost. The crew found the UAS on its back still turned on and missing one of its rear left blades, damage to the right right blade, with right front leg broken.  Crew was unable to locate the left rear rotor blade. It appeared to have broken off at the rotor shaft.  UAS is no longer in service. Aircraft and blades were pre-inspected prior to flight for damage and stored carefully as noted by IASA 19-04 and SAFECOM 19-0471\r\n Continue monitoring for other instances of failure and document pre-inspections with imagery.  Replace blades after a predetermined amount of flight time (100-120) or immediately upon issuance if history is not known.   "}
{"Tracking #":"20-1091","Mission Type":"Fire, Aerial Ignition","Text":"A small Unmanned Aerial Vehicle (sUAV) and a Type 2 helicopter, configured with a 100 ft longline and bucket, came in close proximity of one another during operations on the Woodward fire.   The Unmanned Romeo XXX (URXXX, a Matrice 600), was engaged in aerial ignition near DP 10, and  the helicopter was working in a daisy chain of 3 helicopters supporting firefighters on the ground with bucket drops. Both aircraft were operating in Division T on the Woodward Fire near the Bear Valley Visitor’s Center (refer to map below).  Aerial supervision was in place and both aircraft were made aware of the presence of the other.   Helicopters were given a specific route to\/from the dip and the sUAS was also provided a specific area to operate in.  \r\n\r\nAt approximately 1815 the pilot of the incident helicopter approached the vicinity of DP10, on his way to drop water on the fire.  The aircraft was on the designated route and was climbing from the dip to 1500 ft. MSL over the marine layer to the clear air, when he encountered visual contact with URXXX approximately 100 feet below.  URXXX was in a stationary hover over the marine layer at the time of the encounter. \r\n\r\nThe 1000 ft AGL clearance over the highest terrain feature had positioned URXXX at approximately 1400 MSL, near the altitude where helicopters were operating.  The pilot of the helicopter altered course slightly to the right and passed by the UAV.  The helicopter pilot estimated the UAV to be at about the same altitude as the bucket, and about 100 ft horizontally to the left.  The helicopter continued on the designated route and descended to complete the drop.  Both the sUAS pilot and the helicopter pilot notified Air Attack, who halted the sUAS operation. \r\nConnection to the URXXX was momentarily lost during aerial ignition operations.  The sUAV was at 38% battery life, and reconnection to the aircraft was unsuccessful after several attempts by the operator. The sUAV pilot selected the “Go Home” button to initiate the lost link procedure. The aircraft was observed, by the helicopter pilot, hovering (stationary) at around 1400 ft. during the time of the signal interruption.   URXXX’s visual observer and pilot continued to look for the sUAV with no immediate success. URXXX was finally heard overhead of the original takeoff and landing area at DP10.  The pilot then depressed the “Go Home” button again regain control. The sUAV pilot then maneuvered URXXX to the south of DP10 to clear the smoke and marine layer and to regain a visual of the aircraft. URXXX was located to the south of DP10 and the pilot began descending the aircraft by pitching forward to the landing area south of DP10.  The aircraft was landed without further incident. The sUAS pilot, the incident aviation managers, the helicopter pilot and the air attack all reviewed and discussed this situation to determine what could be done to prevent a similar event.  The following are the contributing factors and on-site recommendations: \r\nFactors contributing to this incident:\r\n1.\tUnmanned Romeo operating at altitudes assigned in AGL; other incident Aircraft operating with altitudes assigned at MSL\r\n2.\tPoor visibility due to smoke and persistent marine layer\r\n3.\tClose operating proximity\r\nWhat went well:\r\n1.\tsUAS pilot immediately notified Air Attack, and shut down operation once the aircraft was back at the LZ\r\n2.\tsUAS Pilot followed all emergency procedures for loss of contact with UAV, IAW the manual\r\n3.\tsUAS Pilot notified Incident Aviation Managers (AOBD) in a timely manner \r\n4.\tHelicopter Pilot practiced see and avoid\r\n5.\tAll parties discussed this occurrence and provided input for this report\r\nRecommendations:\r\n1.\tAll incident aircraft should operate at MSL, rather than AGL.  This will ensure all incident aircraft are operating at the same altitude clearances. (Terrain changes when using AGL can cause conflict by overlapping altitudes with other aircraft operating at MSL, see fig 3). \r\n2.\tEnsure safe operating space (horizontal and vertical) is provided between manned and unmanned aircraft.\r\n3.\tUAS pilots should notify Air Attack immediately of lost communications with the UAV to expedite awareness to other aircraft over incident.  A blind call on the appropriate A\/G frequency is recommended. \r\n"}
{"Tracking #":"20-1098","Mission Type":"Fire, Infrared Imagery","Text":"We were operating within TFR's 0\/6872 and 0\/0961. After activation of the 3 mile LRZ at 1900 we descended from 11,500 to the ground without incident, and deemed the LRZ cold with Cinnabar helibase and Missoula Aircraft Dispatch.  During the breakdown we noticed at 1953 a low flying commercial aircraft fly what seemed to be within our 0\/0961 TFR 1\/4 mile to the North of us. I immediately took a screen shot of my already open flightradar24 app. It showed Delta flight 988 at 9,286 msl.  It was a non-event as we were on the ground.  I called the ASGS (t) and sent him a screenshot. He spoke with Spokane approach and let them know.  The following morning, I made a follow-up call to Spokane prior to launch at the same LRZ. The supervisor was unaware. I received a follow-up call a short time later and was told that our TFR indeed was breached by Delta 988 and exited our TFR at 8,600.  I was concerned that this may happen again tonight. This is most likely a daily flight and if it happened again, we may be in the same airspace at the same time, as we are planning a similar mission.  I also asked if I needed to have a daily call into them prior to launch and recovery. I was assured that it was not necessary as it will not happen again. It is important to have the flightradar24 app to identify aircraft type, tail number, speed and altitude if you see or hear an aircraft that may be in your vicinity. Taking a screenshot can save a lot of time for reporting. We reached out to Spokane approach and were assured that it will not be an issue in the future.  We will continue to monitor our airspace, especially during climb and decent.\r\nRASM comments:  I am appreciative of all the quick communications which took place over this intrusion.  Nice job by the manger to think quickly and use his flightradar24 app.  This intrusion was run to ground very well.  The Natl Airspace Coordinator worked with FAA, Salt Lake Center, and Spokane Approach Control while I worked with Delta Airlines.  It seems all the loops were closed on this from the UAS, AOBD, ASCO, Natl ASCO, Dispatch, GACC, and RASM to the FAA, Center, Approach and Airlines.  Even though good communications took place and the root of this cause was Approach Control dropping the ball, we still must always stay vigilant.  Just because we have a TFR it doesn’t mean it cannot be breached.\r\n"}
{"Tracking #":"20-1159","Mission Type":"Fire, Other","Text":"The xxx Creek Fire’s complexity is attracting interest from the various entities that have roles and responsibilities serving the public.  It's drawing additional interest from media and from the general public.  With the popularity and portability of UAS, drones are used by county law enforcement and fire districts.  The public launches them to gather footage, and the media routinely collects video for news coverage reporting current conditions.  There are many reasons to use drones.\r\nThe xxx Creek Fire, since the wind event, has been under very poor visibility which has grounded our manned aviation operation, however we have been collecting some intel from a fire controlled UAS.  A TFR has been over the fire steady with the exception of one afternoon where it was cancelled to facilitate an adjacent fire posting their new TFR.\r\nOnly one agency has asked permission to fly in our TFR on private lands to collect information to facilitate their mission.  Another similar agency has produced video footage and has expressed no interest in working with the fire aviation program to communicate or meet FAA rules.  I am finding many do not fully comprehend the complexity of a fire aviation program, airspace coordination and the communication with players such, as ATGS who direct operations and set priorities.  This lack of understanding can place our pilots, and manned and unmanned aircraft at risk.  Results could be catastrophic or shut our air operations down. \r\n As the UAS program continues grows, sanctioned and unsanctioned, UAS coordinators need to be more available to advise, coach valid users through the FAA approvals, and recommend how best to coordinate UAS airspace.  \r\nOn a complex fire, traditional air operation managers still have the load of the traditional aviation program and now this additional burden.  A lack of experience and understanding of UAS authorizations and operations makes it easy to say “no” rather than allowing the system to work and helping the UAS users to understand priorities, and learning how we can work together under tightly regulated access.\r\nRASM: This event is likely a reflection of similar events going on within this region and nationally. Ensuring UAS managers, program managers and regional and national leadership get ahead of these challenges for ICTs is going to be an ongoing process. This information is critical in understanding the challenges to work on. Will have the UAS specialist in the region comment as needed for this safecom. \r\n\r\nRUASS:  It is imperative that we continue to work closely with our state, county and local cooperators and educate them on UAS airspace and authorizations from the incident and the FAA.  In order to integrate UAS into a Fire Traffic Area within a Temporary Flight Restriction with other manned aviation, we must be able to communicate, coordinate and deconflict the airspace with the appropriate levels of authorization.  Without it, the results could lead to aviation mishaps or accidents.   UAS policy must align with our federal agencies and our cooperators, be understood and known to all UAS entities requesting to offer up assistance.  The utilization of an on-demand regional UAS coordinator will help to manage incoming request from our cooperators and disseminate timely information to the AOBD’s in order to coordinate and deconflict airspace. "}
{"Tracking #":"20-1169","Mission Type":"Fire, Water Drop (Helicopter Bucket)","Text":"Drone incursion over fire area while rotor wing operations in progress. Resources notified and air ops shut down. Local law enforcement notified. Drone was seen leaving fire area into adjacent subdivision. Resumed air operation after 30 minutes. Drone operator not found.  Continuing PIO campaign educating public of hazard of drone operations in fire area. "}
{"Tracking #":"20-1176","Mission Type":"Fire, Other","Text":"Div O Line Safety observed a UAS flying in the area between DP-11 and H-10. Line Safety quickly located the operator of the UAS and told him that he was in a TFR and to get it on the ground. The Drone operator quickly landed the Drone and Line Safety contacted August fire communication to report the intrusion. The UAS operator was a hired private contractor to remove a stranded incident water tender. He stated that he was using the UAS to locate the stranded water tender on the dozer line. The Drone was in the air for less than ten minutes at an altitude on around 100 ft.     Line Safety quickly located the operator and got the UAS on the ground. \r\n\r\nRASM: Good communication by AOBD.  UAS Intrusion Report was submitted as well."}
{"Tracking #":"20-1197","Mission Type":"Fire, Infrared Imagery","Text":"At run-up for a ISR mission for the Eldorado Fire, pilots noticed degraded rpm performance. A quick troubleshooting with new spark plugs, air filter and fuel filter did not fix the problem. \r\nIt was decided that we would replace the engine with the spare, as the low rpm engine was near the end of its life. After installing the new engine it would not start.  After troubleshooting it was found that the new engine had an incomplete wiring harness that was missing the appropriate terminal pins that activated the fuel injection system.   This was a manufacturer error.  BridgerAerospace flew in a new engine and installed on the evening of 9\/20. A test flight was completed on 9\/21. Aircraft is in service.\r\n\r\nThe low rpm engine was driven to be rebuilt in Oregon. It will be driven or flown to us most likely 9\/22 or 9\/23.\r\n\r\nThe incomplete wiring harness engine was flown to Tucson for a corrected repair. Estimated that we will have the engine on site as a spare on 9\/22. \r\n\r\nKudos to Bridger Aerospace for using good risk management in a degraded rpm situation. Additionally it was impressive to have the aircraft back in service so quickly. They were able to work around a manufacturing defect and provide quick solutions to a difficult problem."}
{"Tracking #":"20-1303","Mission Type":"Fire, Reconnaissance","Text":"UAS module was assigned to Castle Fire (East Zone on the SQF Complex).  Leading up the incident, there had been continual communication issues that led to misunderstandings about UAS operations and capabilities.  On the morning of 28 SEP 20 the UAS Module arrived at Helibase and prepared the GCS (Ground Control Station) for operations.  Original GCS was located on the road downslope of the pads.  The Helitack crew arrived before GCS was established. A  helitack crewmember specified that Pad 3 would be designated for Take-Off\/Landing.  Crewmember also verified this operational plan with his Squad Leader. Squad leader concurred.  After deliberating, the UAS module chose to utilize pad 3 and also briefed emergency procedures for GCS movement in case pad 3 needed to be utilized.  \r\nAfter initial contact with ATGS, UAS PIC was told to hold position to allow for H-XXX to land on Pad 1.  H-XXX landed on pad 1, and UAS was cleared for T\/O.  Positive communication was made with Castle ATGS,  and Helibase.  LRZ(Launch-Recovery Zone) was activated, UAS launched from Pad 3 and ascended to operational altitude.  UAS PIC (Pilot in Charge) deactivated LRZ and proceeded north to mission area. ATGS requested H-YYY to be pre-positioned at Helibase from another Helibase.  Helibase advised pad 1 and 2 were open, but pad 3 had been reserved for UAS.  At this time, Castle ATGS stated that Operations needed to be informed of the situation and rotor operations could not continue out of Helibase.  UAS PIC, contacted Castle ATGS on TFR that if necessary, the UAS GCS could be cleared from the immediate vicinity of pad 3 in 30 minutes to allow for rotorcraft to land.   Helibase, informed UAS PIC to clear UAS GCS of pad 3.  UAS module started emergency procedures to move ground control station.  After moving equipment, pad 3 was open for rotor traffic.   H-YYY pilot was told to land on pad 3. Pilot requested positive confirmation to land on pad 3 although pad 2 and 1 were open.  Pilot landed on pad 3 and rotor wash knocked over Victor antenna. UAS Module was informed that we were being “tested” for emergency response by Helibase Manager. Operations for the day utilized H-XXX on pad 1 after operation and H-YYY on pad 2 and other issues after discussion.  No other rotorcraft landed on pad 3. \r\n UAS module chose to demobilize from incident due to the availability of critical locations to provide useful data to operations. \r\n\r\nR5 UAS AMS Comments: As always, communication and coordination remain key to preventing these types of situations. Ensuring that the HEBM, ABRO, Parking Tenders, and UASM all have the same understanding of TOLC and DECK operations through accurate briefings remains critical for safety. With emerging technology such as UAS, the need for clear communication and a firm understanding of integration by all parties involved is paramount. Every effort should be made to rectify difficulties in communication and to use the AAR process for learning purposes before demobilizations occur. "}
{"Tracking #":"21-0015","Mission Type":"Fire, Infrared Imagery","Text":"During post-recovery inspection of the UAS after a reconnaissance mission, it was observed that the cowling on the aircraft was missing.  This is a protective cover for the UAS engine from dirt and debris during launch and recovery.  The cowling is attached to the aircraft using magnets.  During the flight, there were periods of turbulence and high winds aloft.  The pilot believes that at some point during the mission, winds funneled under the cowling and the magnets did not hold.  Upon further inspection, when the cowling came off, it contacted the push propeller of the aircraft and created a small nick.  The aircraft performed normal with the small damage.   The pilot determined that the cowling was not needed during future missions if the dirt and debris during launch and recovery could be mitigated.  To mitigate the problem, a large tarp was placed on the ground creating a barrier on the landing area that could trap the dirt and debris from getting to the engine.  The damaged push propeller was replaced and conversations with the manufacturer will take place to replace the magnets with a better option."}
{"Tracking #":"21-0019","Mission Type":"Fire, Aerial Ignition","Text":"UR31 arrived on DIVQ of the Red Salmon Complex and were in-briefed by the DIVS.\r\nMission was to PSD a steep ridge at the confluence of the New and East fork of the New river.\r\nAn extents flight was completed to verify radio telemetry, and video link at the firing location. \r\nFlight distance from launch location was 6000ft.   \r\n1\/4 mile visibility from smoke inversion.\r\nThe IGNIS 2.0 was bench tested and settings verified before installation, roughly 450 dragon eggs were loaded.\r\nA thorough walk around was completed.\r\nQualified Pilot and Qualified VO completed the Aerial Ignition checklist before takeoff.\r\nPilot took off and flew to the firing location at 500ft AGL not noticing any odd behavior in flight.\r\nAs the UAS was coming on scene to the firing location the IGNIS 2.0 was armed within the preset geofence. \r\nPilot notices a left Yaw start without input to the controls.  Pilot initially thought it was a camera error as the camera has the independent ability to yaw.  Pilot tried to C1\/C2 buttons which centers the camera gimbal, and faces the camera straight ahead.\r\nWithin 2 seconds the aircraft went into un uncontrollable left yaw with an uncontrolled descent.  Pilot tried to counteract the inputs by climbing and adding Right Yaw without success.  Pilot notified the DIVS about the issue.\r\nAircraft had uncontrollable left yaw all the way to the ground.\r\nThe aircraft impacted the ground within the planned burn area.\r\n\r\n Pilot had witnessed a similar flight failure from another aircraft.  \r\nIn that instance, a stripped screw caused an electrical short in the power distribution board.\r\nA positive terminal connection shorted when it contacted the carbon fiber body causing motor number 2 (CW) to fail.   It in turn cause an uncontrollable Left yaw.  \r\nPilot believes he had an in flight motor failure or prop failure.\r\nA complete prefight check was completed before the mission. \r\nAircraft is unrecoverable."}
{"Tracking #":"21-0027","Mission Type":"Fire, Aerial Ignition","Text":"2nd in flight failure in 2 days.\r\nPilot was operating in the East fork of the New river in DIVQ Red Salmon Complex.\r\nOn the 5th mission the pilot was dropping PSD balls on Bake Oven ridge when the GSC showed a disconnection error and video loss.  Pilot then heard motor wine from the aircraft that was 1200 ft alt and 2300 ft distance from the LZ.   Pilot immediately disarmed the IGNIS as a disconnection error usually prompts a return home warning as a failsafe.   When the connection was regained, the video showed the aircraft in a tree.  Pilot is 100% positive there was no tree strike as he was more than 1000ft agl at the time of the failure.   The aircraft also reset the home point at the point of the incident.  We noted the GPS location and came up with a plan for retrieval.\r\n We were able to locate the aircraft.  We were unable to locate 1 Motor and prop combination.  Motor number 3 was separated from the arm housing.   \r\nAll other broken props, parts and pieces were located in the vicinity of the crash site.\r\nA grid was performed to locate the missing motor, but we were unable to locate it.\r\nThis appears to be an in flight motor failure which in turn hit the GPS and Antennas causing the disconnection from the GCS and the crash from separated motor.\r\nA risk analysis was completed with the National office UAS managers, OAS, ICT1, AOBD, OPS, Pilot, and DIVS to continue operations based on risk management to burn this priority ridge.\r\nWe will be pulling flight logs and video to share with SME's and the manufacturer to investigate further potential cause.\r\n\r\nRASM: Ensure that proper notifications are done for an aircraft mishap.  Utilize the Interagency Mishap Response Guide for contact numbers.  "}
{"Tracking #":"21-0091","Mission Type":"Fire, Air Attack","Text":"A non incident drone was spotted by Red Salmon Air attack over Division U. It was spotted at 6500' agl air attack was at 9000' agl AA unable to get description of drone. SEC on incident was notified, no operator was located. No injuries, damage or near misses occurred.  AA notified AOBD, AOBD made proper notifications on incident. NCIC Aircraft conflict initial report was filled out and submitted, Domestic Events Networks notified, Forest Duty Officer, Forest Safety Officer, and GACC notified. Safecom Filed.\r\n\r\nRASM: SAFECOM received."}
{"Tracking #":"21-0098","Mission Type":"Fire, Aerial Ignition (Prescribed)","Text":"A full inspections was conducted on the M600 motors prior to the flight to ensure the aircraft was operational. The motor appears normal with no issues during this check. The flight conditions during the time of the incident was sunny, temps of 67, with winds from the north at 3-4 mph and elevation of 5000 ft. Operations was normal during the first 3 flights. After finishing up the last flight with aerial ignitions, I started bringing the aircraft back to launch for landing. At approximately 1317 at 200 ft AGL and 300 yards from the landing site, both pilot and visual observer heard a loud snap coming from the direction of the UAS. Immediately after the snap, the visual observer witnessed a piece of unknown debris falling from the aircraft.  The aircraft began to yaw hard in a counter clockwise rotation and uncontrollably descended and impacted the ground. Upon observation of the M600, the arm of the 4\/5 propeller completely snapped where it meets the motor. The mishaps related to the M600 are addressed in the following Interagency Aviation Safety Alert:\r\n\r\nhttps:\/\/www.doi.gov\/sites\/doi.gov\/files\/iasa-2021-02.pdf"}
{"Tracking #":"21-0112","Mission Type":"Fire, Air Attack","Text":"At 10:20 on October 17, 2020 AA 05 notified helibase that there was a UAS flying in our TFR at the following location Lat - 41 05.313 x Long 123 33.083.  That is located near Box Spike on division U on the Red Salmon Complex.  AA spotted the UAS flying below him, at ground level.  It was shaped like a small airplane and was large in size for a UAS.  AA watched the UAS until it left the area.  All incident aircraft that was flying was notified as well as the helibase.  Air Operations was notified, who in turn notified the incident law enforcement.  Also the notifications were made through the local dispatch office. The proper notifications were made.  AOBD contacted the incident law enforcement.  An officer went and checked the site out to see if he could find any information about the UAS.  When he returned he reported that there were several  marijuana grows in that area and it was more than likely a grower checking out his crop.  The fire was not active in that division so flights in that area were limited."}
{"Tracking #":"21-0138","Mission Type":"Fire, Other","Text":"The Parrot Anafi was flying an autonomous mapping mission, using Pix4D Capture as the GCS.  Aircraft was 3\/4 of the way through the first transect when the pilot noticed the GCS indicated that the aircraft had stopped taking photos momentarily, but then resumed taking photos at the end of the transect.  The aircraft completed the first transect (flying south), then turned to the west to move to the next transect, but continued moving to the west and missed the turn back to the north.  Upon seeing the aircraft go off course, the pilot cancelled autonomous flight mode and attempted to regain manual flight control.  GCS indicated that the aircraft was responsive to command inputs and did yaw, but did not respond to pitch commands and it continued to move to the west.  Pilot attempted to initiate \"return to home\" mode using GCS, but aircraft did not respond.  Pilot used remote controller to begin aircraft descent.  Aircraft descended from 400 ft. to 330 ft., before the signal was lost.  Pilot and crew went to the last known location of the aircraft but did not find it, nor could they re-establish signal link to attempt and track it using the GCS.  At the last known location, the aircraft reported 60% battery.  After the fly away and loss of link event, the GCS reported \"0\" GPS satellites.  It is unknown if GPS signal was lost during flight, or if the GPS signal went to zero after the loss of link, as the pilot did not look at the GPS signal indicator when attempting to recover aircraft while controller still had signal link with the aircraft.  Based on the above information, the pilot assumes that the aircraft did lose GPS signal while in autonomous flight.  It did respond to manual input, for a brief period, but did not respond to \"return to home\" mode, which requires GPS signal.  It also did not return to home after leaving the geofence-limited area.  Winds were moderate (gusting to 15mph at the surface), but within aircraft limitations.  However, the delay from the time the aircraft first went off course to the time the pilot attempted to recover the aircraft may have been sufficient to allow the wind to carry the aircraft out of signal range.    While a definitive cause of the “fly away” event is uncertain, several factors may have contributed to it.  First, the pilot had never experienced GPS signal loss with the Parrot Anafi, nor even heard any other instances, which created a sense of complacency that the GPS “always works” on the Anafi… until it doesn’t.  The chance of it happening should have been anticipated and pro-active steps should have been taken to prepare for it.   The GPS on the Anafi can’t be turned off to practice manual flight, but proficiency flights should simulate GPS failure situations, to keep up the awareness level of the situation with both the pilot and crew.  \r\nSecondly, while there is a pre-flight and post-flight checklist to ensure important steps are not missed, there was not an in-flight emergency checklist to follow to help guide the actions of the crew.  An in-flight emergency checklist, specific for each model of aircraft and each GCS due to variations in operability, should be part of a pilot’s standard checklist.  Having written instructions, easily accessible by the crew, will allow crewmembers to cue the pilot about what sequence of steps should be initiated.  During a stressful incident, i.e. an aircraft fly-away, a procedure checklist to follow will serve a pilot better than their fallible memory, since each aircraft and each GCS perform differently.  \r\nFinally, on-going training (practice flights) would improve muscle memory of what actions to initiate during emergency operations.  In addition to routine proficiency flight, emergency exercises and scenarios should be implemented regularly to maintain preparedness levels.  Since April of this year, the pilot has only flown during emergency responses.  A failure to practice is a practice of failure."}
{"Tracking #":"21-0165","Mission Type":"Fire, Water Drop (Helicopter Fixed-Tank)","Text":"On January 20th 2021 in the City of Carlsbad California responded to a vegetation fire within City limits. The incident commander requested a full aircraft order including fixed wing and rotor wing aircraft. At 1520 ground units reported seeing a drone over the fire and at that moment our aircraft was eyelevel with a red drone in a hover. Our helicopter was on final for a water drop when the left seat Fire Captain saw the drone and the Pilot in Command did not. The FC gave a request for a right turn to avoid contact with the drone. The PIC avoided the contact and aborted the drop then initiated a climb to a safe holding pattern outside the fire perimeter.  Air Attack was made aware of the drone, color and location. Air Attack requested to IC for a ground investigation on drone operator. Carlsbad Police Dept. subsequently identified the drone operator within 7 minutes and the operator was compliant. The operator grounded the drone and this was relayed back to Air Attack. Aerial operations resumed with no further impact.  Aviation Safety Comments:  Nice work by the crew on clearing the area and making the proper and timely notifications to ground crews.  For review, attached to this SAFECOM is the NWCG Unmanned Aircraft System Incursion Protocol for Wildland Firefighters."}
{"Tracking #":"21-0167","Mission Type":"Fire, Aerial Ignition","Text":"Fourth flight failure to date caused by m600 motor mount separation.  Pilot was operating on the XX National Forest on a prescribed burn unit conducting aerial ignition.  This m600 had maintenance performed by a 3rd party vendor which replaced the motor mounts bought directly from DJI prior to this flight.  This was the 11th flight since maintenance had been completed, however this flight was with a fully loaded Ignis machine to conduct aerial ignition.  On the first UAS PSD mission for this particular m600 since new motor mount replacement, approximately 1 minute into flight, aircraft went into uncontrolled yaw that resulted in loss of control and impacted terrain.  Remote pilot recognized issue from past UAS motor separation incidents as aircraft was still in view and lowered lander gear with full accent input to try to slow decent rate.  Aircraft impacted the ground damaging landing gear and motors but without significant damage to payloads.  Proper notifications were made.\r\nThe aircraft was located and the motor was dangling from the motor mount via wires. Evidence of motor mount separation was evident. This strongly suggests that the motor broke free of the motor housing during flight.\r\n Mitigations:\r\nReduce the payload weight by reduction of number of balls to 250 and amount of glycol to 3\/4 full when able.\r\nAll PPE will be used by ground crews during PSD operations.\r\nNo flights over people.\r\nMinimize aggressive throttle and\/or pitch\/roll maneuvers.\r\nIf uncontrolled descent is occurring, immediately lower landing gear and go to max climb rate to slow the descent rate.\r\nBe overly vigilant with pre-flight inspections.\r\nInvestigate potential motor mount replacements from third party vendors.\r\n\r\nRASM:  Completely concur with above corrective actions.  The pilot and rest of the team deserve acknowledgement for reacting quickly in the moment but also for developing strong field countermeasures in real time and for the impending future.  While reducing the payload (reducing the max gross weight) works in the field, it is a short term fixe because it would seem the aircraft does not actually perform as advertised \/ designed and to expectations.  But, all the people in the FS and DOI UAS community are very passionate and known for, but also credited with even now, working towards what is needed for the long term, but also for any success that the Interagency UAS Program might realize.  Work is being done between the agencies along with NASA AMES and the FS Technology Center.  A TBO (Time Before Overhaul) practice might be considered if not already.\r\nAlthough a version is already being exercised, an explanatory example is still offered, for whatever that might be worth:  QDR (Quality Deficiency Report System).  Major initiative to identify and resolve deficiencies in fielded equipment. When a fielded item fails to perform as expected and the user suspects that the problem is quality-related, a report is submitted to the responsible commodity for investigation and resolution and possible redesign.\r\nIn the ongoing effort to reduce the risk to personnel inherent with Ariel ignition, the agencies at the highest-level ought to own an obligation to resource and provide themselves with the most favorable and safest tools possible.  Reiterate how extremely important that the agencies fully identify the UAS concept and continue its commitment to support through amplified sourcing and doctrine to meet current and growing needs of this conception; There is a trace of nervousness because of the very finite amount of personnel and equipment presently.\r\n"}
{"Tracking #":"21-0169","Mission Type":"Fire, Aerial Ignition","Text":"On Feb 3rd at approximately 1530, UASP was conducting aerial ignitions for prescribed fire on the XX National Forest. During a routine aerial ignition flight, a red puncture motion error was observed. The UASP identified the error as critical, stayed within the burn unit and initiated the emergency release protocol. After further securing the UAS the Pilot returned the aircraft to the home location. Upon inspection it was observed that the puncture needle was dislodged from its mounted position. Further observation of the needle and housing revealed no obvious damage or abnormalities.  Inspect the needles to ensure the proper alignment and orientation routinely.\r\n\r\nRASM:  Concur with corrective actions.  Additionally, consider incorporating a needle check into the preflight and during the “through flight check” (an abbreviated pre-flight conducted in conducted between flights, for example at battery swaps or some similar\/triggered opportunity).  This condition is certainly something to monitor in case it becomes a trend and might need a redesign evaluation.\r\n"}
{"Tracking #":"21-0172","Mission Type":"Fire, Reconnaissance","Text":"A Parrot Anafi Thermal was in use for situational awareness during a prescribed burn.  The pilot had already completed three flights that day, with minimal issues.  During the second flight, the GCS indicated that the signal between controller and aircraft was weak, and “Return to Home” would be initiated soon, but pilot increased altitude and the signal improved, and RTH was not initiated.  Prior to take off for the third flight, both the controller and aircraft GPS signal did not lock (did not turn green).  After waiting 1-2 minutes, and repositioning the aircraft, both GPS remained red.  The aircraft was rebooted, and shortly after that, both GPS turned green.  There were no anomalies during the third flight.  During the fourth flight, no issues were noted prior to take-off or during the first 15 minutes of flight, but at about 15 minutes the controller provided haptic feedback and indicated that the aircraft GPS signal was lost, and the aircraft was auto-landing in place.  The GCS did not provide an option to cancel the auto-landing.  The pilot attempted to break out of the auto-landing by providing various control inputs (climb, pitch forward, yaw, return to home), but the aircraft did not respond and the video feed was lost as it descended below the tree line and out of sight.   The pilot was driven to within 500 feet of the last known location of the aircraft, as noted by the GCS, but the aircraft did not reconnect with the GCS.  The pilot and members of the fire crew performed a search of the area, but the suspected landing area was a pine forest with a thick under story of saw palmetto, and the aircraft was not recovered.  At the time the aircraft descended, the area beneath it was green, but within an hour, the advancing fire burned over much of the area.  \r\nThe GCS app in use for all flights was the Parrot FreeFlight 6 app.  All flights conducted in manual flight mode.  Prior to all flights, the safety settings on the GCS were verified that the aircraft would Return to Home and land In case of signal loss (and not land in place or hover in place).  A geofence of .7 miles was set to keep the aircraft within its specified flight range.  The aircraft was within line of sight of the pilot at all times, maintaining a position above the tree line, and the pilot had eyes on aircraft at the time the GCS indicated the GPS signal loss.  The last known location of the aircraft was approximately 2400 feet from the pilot, and there was no indication that the radio signal was weak (no on-screen warning) prior to the auto-land activating, nor during any telemetry checks during the flight.  The issue during the second flight with a weak signal seems to confirm that the aircraft would return to home if it lost signal, but evidence suggests the aircraft lost both GPS signal and the radio signal to the GCS at the same time.    \r\n Without flight log data from the aircraft, the cause of the auto-land remains unknown.  There is no information in the manual concerning loss of GPS events, and no way to simulate it occurring mid-flight.  Ideally, further testing of RTH due to loss of link, in a controlled environment, should be conducted to see if the issue can be replicated. \r\n\r\nPilot performed as qualified and operated the sUAS appropriately.  As technological anomalies will happen, sUAS pilots should always consider all trouble shooting options and system functionality tests.\r\n\r\nsUAS operators should explore all options possible for locating downed sUAS aircraft.  See OAS investigation summary.\r\n\r\nThank you for submitting to SAFECOM."}
{"Tracking #":"21-0214","Mission Type":"Fire, Aerial Ignition (Prescribed)","Text":"During PSD Operations on the prescribed fire, on the last firing cycle, a drone was sighted by Battalion above the fire line.  The drone was sighted in the NW corner of the burn, approximately .5 mile from the helicopter conducting aerial ignition.   Battalion informed the helicopter of the drone and its location.  The Firing Boss on board stopped the PSD operations and directed the helicopter pilot to turn immediately to the SE across the valley and ascended to an elevation of 12,000 MSL.  The ground resources monitored the drone and contacted the Prevention nearby to try and determine the operator’s location.  They witnessed the drone depart to the North and after 20 minutes, the helicopter returned to complete the firing operation after a high- and low-level recon of the entire area.  The drone and its operator were not located.  A NOTAM was in effect for the prescribed fire (SAF 04\/004).  \r\n\r\nRASM – TFR cannot be issued for non-emergency events, such as prescribed fire.   Regional UAS Specialist will be providing information to the Regional Communication Specialist plus Forest PAO\/PIO on the continuation of the “You Fly, We Can’t” campaign which informs the public of the hazards associated with flying drones in the proximity of wildland and prescribed fires.   \r\n\r\nKudos to ground personnel observing and promptly informing the flight crew of the drone, to the Firing Boss for taking evasive action, and to the PSD crew for reporting the incident.  \r\n"}
{"Tracking #":"21-0215","Mission Type":"Fire, Aerial Ignition (Prescribed)","Text":"During aerial ignition operations on a prescribed burn at Big Cypress National Preserve, the burn boss informed the aerial ignition helicopter that a UAS was seen in the northeast corner of the burn unit. The helicopter was heading in the general direction described by the burn boss. \r\n\r\nThe helicopter was at a good point to pause aerial ignitions and immediately returned to the helibase located in the opposite direction of the airborne UAS. The helicopter landed safely at the helibase within 5 minutes of being notified of the UAS.  The burn boss identified the UAS pilot shortly after communicating with the aerial ignition helicopter. The UAS pilot was told to land the aircraft immediately and keep it on the ground. The burn boss informed the UAS pilot of the risk associated with UAS and helicopters working in the same area. Law Enforcement were informed of the situation. Additionally the pilot was informed that flying UAS over NPS land is prohibited. "}
{"Tracking #":"21-0236","Mission Type":"Fire, Retardant Drop (SEAT)","Text":"A drone incursion occurred  while a SEAT was on final for the dry run for his second drop on the Cement Hollow Fire.  An UAS was identified in the drop area. The UAS was reported to dispatch.  The local law enforcement was notified and tried to find owner.  \r\nThe UAV has left the scene and the the second retardant drop took place without incident. No TFR was in place.  The owner of UAV was located by law enforcement and  was told to ground the UAV. A  temporary TFR may have avoided this incident. Communication and education continues to be a be a major concern with UAS operators."}
{"Tracking #":"21-0237","Mission Type":"Fire, Water Drop (Helicopter Bucket)","Text":"Helicopter was in-flight to wildfire. IC of fire contacted base manager with information related to UAS in vicinity of fire. The helicopter was contacted via radio to check up short of fire due to UAS incursion on fire. Ground personnel were unable to locate the source of UAS and IC ordered the helicopter to RTB.   Helicopter was ordered to return without ever working the fire. The source of the UAS was never located. A temporary TFR may have helped to prevent this incident.  Communication and education needs to continue to be a regional priority. "}
{"Tracking #":"21-0266","Mission Type":"Fire, Air Attack","Text":"While working the Devore incident, Approximately 1600 after releasing the last helicopter assigned a UAS entered the FTA at approximately 4000' (AA was at 5000') and made 3 orbits in the fire area then departed to the north. Maintained visual as long as we could lost sight of it about 1 mile north of the fire\r\nand was not able to locate a launch site. Notified the IC and dispatch. Briefed incoming air attack of intrusion and general location it was last seen  Aviation Safety Comments: Nice work by the crew on passing down the siting and location. Other information that is useful for pass-down and reporting are the UAS' size, color, and type (rotor\/fixed).  For review, attached to this SAFECOM is the NWCG Unmanned Aircraft System Incursion Protocol for Wildland Firefighters."}
{"Tracking #":"21-0343","Mission Type":"Fire, Reconnaissance","Text":"On 6\/11\/21, at approximately 12:00 MDT, UAS \"Unmanned Romeo 3\" called into Dispatch that they were taking off on a \"resource flight\" in the area of Borracho Canyon, near the edge of the Fire working within a 1.5-mile radius. Approximately 3.5 hours later, at 15:38, Helicopter XXX called Dispatch to announce that they would be flying a reconnaissance mission over the fire. At 15:49, the UAS operator called in to let us know that Unmanned Romeo was on the ground and they would let us know when they lifted again. When Helicopter XXX landed, shortly after 16:00, Dispatch received a call from the IC that the UAS crew had some concerns that Dispatch did not alert them that the Helicopter was about to fly over the Fire. After consulting NWCG document PMS 515 (NWCG Standards for Fire Unmanned Aircraft Systems Operations), it appeared that mission flights should be coordinated \"with participating aircraft when aerial supervision is not on scene.\" (p. 4) Further consultation with the Forest FAO led to a discussion about the role of Dispatch during an operational flight on an extended attack fire. It was decided that Dispatch should call all the aircraft and confirm that they are aware of UAS operations in the area or call to confirm that the UAS is on the ground. In the end, this was a learning experience about UAS protocols. We (dispatch) familiarized ourselves with PMS 515 and had some good discussions about potential scenarios.  Ultimately, clear communication was identified as the key to successful operations. Arrival of a UAS on a fire is a trigger point that protocols for airspace coordination will need to be established. It is still not completely clear if there is a standard is for this situation or if protocols will be developed on a case-by-case basis. Another miscommunication: the logs for 6\/11 indicated that the UAS and Helicopter would NOT be in the air at the same time. (It's not believed that they were ever in the air together) It was also realized that we didn't really have a clear plan for monitoring the UAS flight (no AFF or timers). Another discussion that arose is whether a qualified aircraft dispatcher is required to track UAS activity, especially during night operations, when staff may be limited. In sum, this was a valuable learning experience that brought up many new questions related to UAS operations and opened our eyes to potential issues. Going forward, we recommend wider distribution of PMS 515 and other UAS operational documents as well as more training and discussion about standard operating procedures."}
{"Tracking #":"21-0348","Mission Type":"Fire, Infrared Imagery","Text":"Pilot was descending the aircraft for an accurate landing on the 3 x 3 ft. landing pad.  Approximately 1 ft ground the above, the pilot continued with pitch back inputs.  These inputs plus aircraft rotor wash and wind caused the aircraft to flip back resulting in damage to rear rotor and one GPS antenna.  There could be additional damage which is yet to be known.  There were no injuries to the pilot, visual observer, or any surrounding property.  The three previous flight by other pilots experienced similar environmental factors. When coming into land aircraft you do not want to use any pitches at a low level of your landing site. If need be use full deflection should issues occur."}
{"Tracking #":"21-0379","Mission Type":"Fire, Water Drop (Helicopter Bucket)","Text":"At approximately 2005hrs on 6\/16\/2021 a drone was reported to be flying over pad 7 on the XXX helibase.  At that time we only had one aircraft airborne returning to the helibase.  The drone crossed the helibase from west to east low level above pad 7.  The helicopter manager for Pad 7 notified the helibase of the drones location and direction of travel.  Helibase personnel were able to keep the drone in sight confirming its location on the east side of the helibase.  The drone quickly changed direction and headed back to the west following its previous path.  Again helibase personnel were able to track the drone westbound out of the helibase airspace where our personnel lost visual contact.  After the drone was confirmed to be out of the airspace the helicopter landed safely at its pad.  The drone was not spotted again and notifications were made.  The inbound helicopter was notified of the drone and instructed to hold south of the helibase until the drone could be mitigated.  After the drone was witnessed leaving the airspace to the west the helicopter was able to land at their pad while helibase personnel continued to watch for the drone.  \r\nThere was a federal LEO who was providing overnight security for the helibase on site and they were able to contact local LEO's for assistance.  The drone operator was located within an hour of the incursion.  Notification were made to the local dispatch and team air operations staff.  The helicopter that held to the south was the last aircraft returning to the helibase and operations had been completed for the evening."}
{"Tracking #":"21-0446","Mission Type":"Fire, Air Attack","Text":"Air Attack was up flying a fire the same time the UAS was going to launch for a mapping mission.  Prior to launching, notification was granted by air attack to make the Launch and Recovery Zone (LRZ) hot and launch. The working altitude was 14,000ft. Once the UAS was at 12,500 ft, it was communicated to make to the LRZ cold so helicopters doing bucket work could operate without having to go around the LRZ. Air Attack was orbiting the fire at a working altitude of 10,000 ft when the ATGS pilot saw the drone out his left window at approximately the same altitude approximately 1 mile away.  The UAS pilot estimated 10,300ft.The UAS pilot tried to communicate with air attack that the UAS was descending due to down drafts but their radio failed. A backup was in place approximately 20 seconds later and contact was established with air attack and the UAS pilot was instructed to make the LRZ hot.  After communication was established the UAS climbed to its working altitude and completed the mission without incident. Keep the LRZ hot until the drone establishes working altitude and leaves the LRZ before making it cold.  Have additional back up radios in case the primary radio malfunctions.  Notify air attack immediately if there is a loss of altitude.\r\n\r\n "}
{"Tracking #":"21-0462","Mission Type":"Fire, Air Attack","Text":"On 6\/26\/2021 at  approximately 1900 Lava Air Attack witnessed a UAS traveling from the left flank\/ heel of the fire north west towards the town of Weed, CA. The UAS was flying at 4500' AGL crossing in the direct path of helicopters doing bucket work working at or below 4500\" and air tankers dropping retardant on the right flank.   Air Attack notified operations, aerial asset, and local dispatch. The helicopters were held at the dip which was a safe distance. The airtankers were returning back to the tanker base for reload. Air Attack and the Charlie unit proceeded in the direction of travel trying to identify the location of the UAS launch point. After we could not locate the location and we felt it was safe we resumed fire fighting efforts. Local law enforcement was notified and they made made contact with the individual. "}
{"Tracking #":"21-0544","Mission Type":"Fire, Reconnaissance","Text":"July 11th at 20:30, Helicopter Nxxxxx was returning from a recon flight of the xx Fire. xxx contacted the helispot six minutes out from final approach. The helicopter crew member on the ground at the helispot informed that there was a drone (UAS) in the vicinity; he stated that he could hear the UAS but did not have a visual. Helispot attempted to locate the UAS operator but was unsuccessful. xxx held its position to the north of the helispot and attempted to obtain a visual on the UAS. Helispot obtained a visual on the UAS and informed xxx that the UAS was located to the south of the helispot and approximate AGL. xxx proceeded towards the helispot with caution. Helispot maintained frequent communication with xxx throughout the approach with updates on the UAS position. xxx landed with no issues.  Once xxx ​landed, dispatch and the duty officer were informed of the situation. Helicopter crew conducted an after action review. Further discussions were conducted during the crews briefing the proceeding day.\r\n\r\nUAS - Did everything correct and once they had visual on the drone, the proceeded cautiously to land the helicopter. Appropriate action with communication with helispot and helicopter to identify the hazard and work through a safe process forward. \r\n\r\nRASM - Follow the Intrusion Protocols from Appendix A of the NWCG Unmanned Aircraft Systems Operations, fill out the Intrusion Report and file a Safecom. It is important to record these events for the national office to track incursion numbers. "}
{"Tracking #":"21-0566","Mission Type":"Fire, Infrared Imagery","Text":"I was flying the IR mission for the afternoon, when the mishap occurred.  I had taken off and landed two times previously while completing the requested IR missions for the fire we were on.  Upon landing for the third time, I brought the M600 down onto the landing platform.  After the M600 was solidly on the platform, I brought the left stick down and in to disarm the motors.  As I did that, I also brought the right stick down and in.  This caused the UAS to tip backwards off of the platform and into the grass and shrubs.  One of the six propellers broke when this happened.  Additionally, two of the red tabs that lock the arms into the frame of the UAS body broke off.  We replaced the propellers and red tabs and closely inspected the rest of the UAS for any other damage.  Finding none, we called the AFS UAS Specialist and reported what had just happened.  After conferring with the UAS Specialist, all agreed that we should connect the controller to the UAS and make sure that everything seemed to be working correctly.  We did that, and went through the start up sequence to the point of arming the motors.  Everything appeared to functioning normally.  We disarmed the motors and shut the UAS down.   There are two parts to this Safecom.  The first is the actual event where the UAS tipped over, and the second is a discussion on the BLM guidance for UAS training on new platforms.  My intent with submitting this Safecom is that we may learn from both parts.\r\n\r\nThe tip over:\r\n\r\nWhen I got back to my computer the following day, I reviewed the M600 manual to see what I had done wrong, since I didn’t feel like I had changed anything in my landing and disarming procedure from the first two flights, to the third, where the tip over occurred.  \r\nWhile pulling both controller sticks down and in is an approved method for disarming the M600 as stated in the M600 manual, it is a much riskier procedure, as was evidenced by the tip over.  If the motors are not at full idle prior to bring the right stick down and in, there is still enough power in the propellers to provide pitch and roll to the aircraft.  So while I felt like I did the same maneuver for disarming each time, I must have been a little quicker with the right controller stick input on the third landing, than on the first two landings.  This has a very simple remedy.\r\nThe M600 manual also recommends that the UAS be disarmed by using the left control stick only in the down position.  The motors take 3 seconds to power down using this method, but there is no chance for any additional pitch or roll inputs when using the left stick down method.  So, this was a good learning moment for me, and hopefully, others can learn from it as well without having to an M600 over.  \r\n\r\nAdd-on training guidance:\r\n\r\nAfter the events of the day, and after numerous phone calls were made to discuss what had happened, it became clear to me that there was a lack of clarity regarding the UAS guidance for this particular situation that we were in.  One of the questions that came up was whether or not the fully qualified UAS pilot I was flying with on the fire was able to train me on the M600 platform.  Below is an excerpt from the OAS Sharepoint site that provides guidance for training UAS pilots on new platforms. (Since OPM-11 doesn’t directly address Add-on training, and I don’t think there is any specific BLM guidance, I believe the OAS Sharepoint site is the most current language for how the Bureaus intend to operate).\r\n“Bureau Instructors will be able to provide A-454 Aircraft Add-on training to carded DOI remote pilots that need a specific “make and model” added to their OAS-30U card. Remote pilots on the Master Instructor List with an endorsement for A-454 Add-On Training and for the aircraft being evaluated may train and recommend additional aircraft qualifications.”\r\nAfter reading the above statement, I believed that Bureau Instructors were one group of people, and that Remote pilots on the Master Instructor List were another group of people, and it made sense to me.  It seemed very analogous to the manned aviation process for add-on training.  Last summer I did some add-on training for my private pilot’s license when I took a 3 day course to get my float rating.  I was trained each day by a CFI (certified flight instructor), and she taught me how to fly on floats.  She could not however, sign me off as being certified for my float rating.  The DPE (designated pilot examiner) had to do that.  So, when I read the above referenced OAS language, I saw the parallel within that language to how manned aviation worked.  Bureau instructors (CFI’s on the manned aviation side) could train pilots how to fly a new aircraft, and Remote pilots on the Master Instructor List were the ones who could certify that those pilots learning to fly a new aircraft were indeed good to go (the role of the DPE on the manned aviation side).  This also fit nicely with how the Position Task Book system is set up.  Individuals who are Qualified in a position are the ones who train trainees for that position.  \r\nAfter many conversations with a number of folks, I came to understand that this wasn’t the interpretation of the guidance that the Bureau was operating under.  Some folks at the national program level were unclear about how the guidance should be interpreted, but it seemed the majority believed that “Bureau instructors” and “Remote pilots on the Master Instructor List” were the same group of people, not two separate groups.\r\nWhat this shows me is that we have an opportunity to clarify the guidance.  Anytime there is enough uncertainty in policy language or bureau guidance, there lies an opportunity to help fix it for everyone in the future.  The intent may be clear to those who are immersed in the program, but if I was able to misinterpret it, others will likely do so as well.  \r\n\r\n"}
{"Tracking #":"21-0571","Mission Type":"Fire, Air Attack","Text":"While flying the Dixie incident on the Jarbo Gap a drone was Identified by the Air Attack Pilot.  Upon recognizing the drone, fixed wing assets where held out of the area and rotary wing where moved down river from the drone location.  The drone made one pass over the fire and then proceeded east up the feather river drainage.  Air Attack was able to follow the drone from 4000 feet above it.  Rotary wing operations continued at the far end of the fire.  The IC was notified of the drone and ground resources attempted to locate the operator.  Eventually visual contact with the drone was lost when it descended into the rock creek drainage.  When visual contact was lost all aerial assets where released as Air Attack could not confirm its location.  The IC was informed that aerial assets would no longer be available and Air Attack returned to Chico.       Aviation Safety Comments: Nice work by the crew on clearing the area and making the proper and timely notifications to ground crews. For review, attached to this SAFECOM is the NWCG Unmanned Aircraft System Incursion Protocol for Wildland Firefighters"}
{"Tracking #":"21-0591","Mission Type":"Fire, Water Drop (Fixed Wing)","Text":"Video footage collected from a UAS of the Radar fire was seen on the local evening news channel. The footage was recorded while aerial fire suppression operations were actively engaged on the fire. The drone was not noticed by any flight crews nor fire line personnel. The news footage credited the individual responsible for the drone footage. This name was shared with the local law enforcement and they agreed to make contact with the person.  \r\n\r\nAn Aircraft Conflict Initial Report was submitted.  Although no TFR was in place, we must continue to put efforts into informing the public of the negative consequences to UAS flights adjacent to our aerial  fire fighting activities.  Recommend informing the public by increasing public service announcements on local media outlets."}
{"Tracking #":"21-0595","Mission Type":"Fire, Initial Attack","Text":"Just after transitioning with morning air attack, IC Trainee advised a UAS was operating along the highway.  There were 2 fires on opposite sides of the canyon, both up a ways, mid to upper slopes.   Highway 20 traffic was being stopped in 30 minute increments for fire suppression activities.  It is suspected someone in the long traffic stop wait pulled out a UAS to play with.  Jump, rappel, bucket, tanker and fire boss scoopers were all active at the time.  A Task Force Leader immediately went up by the stopped traffic and the UAS was put away when he got there, nobody would admit who it was.  After a brief hold, aircraft resumed operations.  An incursion report was filed later that afternoon through Wenatchee Dispatch.\r\nRASM - As these type events become more common, it is important to submit the Intrusion\/Incursion reports with as much information and as quickly as possible. "}
{"Tracking #":"21-0596","Mission Type":"Fire, Air Attack","Text":"While supervising retardant operations on the Dixie fire a drone was observed making right hand turns near the exit pattern of fixed wing operations.  Fixed wing and rotary wing operations where suspended in the area and aircraft where held out.  Air attack was able to follow the drone from a safe distance as it made right hand turns into the fire interior.  As it moved into the interior C- 2 finished its last two tanker drops as Air Attack watched the drone.  Once C-2 had finished its drops all fixed wing other than Air Attack where released from the fire.  Eventually the drone descended into a drainage 3 ridges over from aerial operations and disappeared into drift smoke.  Air attack escorted one helicopter into a sling load site for a critical sling load of water.  Once completed all aircraft where released from the incident.   Tactical Aviation Operations (TAO) Comments: This was the second UAS incursion in the same area near Rock Creek. The first was 3-5 days earlier during the IA period (SAFECOM 21-0571). Known FAA 107 Violations: Flying in a TFR, above 400 AGL, beyond visual line of sight (BVLOS) and without a visual observer. Agency violations: Not in compliance with interagency UAS incident operational standards. More on this incident: Unknown color, size, or type as it was small; the giveaway identification was the strobe flashing on top. ATGS estimated the UAS at 1000 AGL. Ops and AOBD were notified and the Branch supervising the geographic area made a radio announcement to resources that no UAS missions were authorized. The notification process was followed appropriately. There was a rumor on the incident that it was possible that the UAS was being operated, unauthorized, by an incident resource. (There were authorized USFS UAS flight approved for night ops on the fire). To mitigate future possibilities of unauthorized use a \"no UAS operations are to occur without AOBD approval\" reminder will be included in the daily incident briefing. During this incident all aircraft had good separation from the UAS while it was being monitored.  To further mitigate the source, the air attack dedicated a short available period of time to attempting to locate the UAS operator. They orbited over the area of Rock Creek (at a safe altitude) with the intention to indicate to the remote pilot that they were aware of their activity, while also attempting to identify them. (A good tip is to look for parked vehicles with two or more stationary individuals staring down at a screen instead of watching firefighting operations).  Attached is an updated NWCG UAS Incursion Protocol, which expands on the reporting items to add: known location of operators, type\/details of UAS (rotor\/fixed wing, shape, size, color(s)).  Additionally, here are the guidelines from the FAA on the reporting of illegal UAS operations: If you witness a drone operation that appears dangerous or is being used to commit a crime please report it immediately to your local law enforcement first responders. They can protect public safety and can help discourage dangerous or illegal activities.  If you witness a drone not following FAA rules, you may reach out to your local FAA flight standards district office. The FAA's investigators may be able to investigate your report and follow up with the drone operator. Unauthorized drone operators may be subject to penalties and criminal charges.\r\n"}
{"Tracking #":"21-0614","Mission Type":"Fire, Air Attack","Text":"At  1710 PST we had a drone intrusion on the Chuweah Creek Fire, Colville Indian Reservation.\r\n\r\nDrone was spotted by 4 different aircraft. Air attack 1SA, Bravo 75, T912, & T162. B75 observed drone over SE part of fire, we saw it 2 minutes later and followed it at a high rate of speed. At 4,500 MSL, same altitude as B75, maintaining and maneuvering with them. Lost sight of drone at 1725, we decided to do cargo run at 1730. \r\nSpotted drone again at 1730 direct flight and altitude of B75. Aborted drop and sent B75 and both tankers to cub creek fire. Drone reappeared and followed AA for about 10 minutes. Lost contact with it, but it disappeared. \r\nB75 attempted to follow the drone, estimated its speed over 100mph.\r\n\r\nOn 7\/19\/21 an engine crew reported a drone over a lake at 0945. AA launched soon after and attempted to fine drone with no results. Engine crew stated it was a positive sighting. \r\n\r\nDrone was not sighted on 7\/20\/21 Change location for aircraft.\r\nInitially aircraft were diverted from the incident location and the activities assigned, F\/W were sent from the area and rotor wing were moved to a different part of the fire. Intrusion negatively affected fire suppression actions and hampered the efforts of fire fighters both in the air those they support on the ground.\r\nNotifications have been made to Airspace coordinators the FAA and is being elevated for further investigation."}
{"Tracking #":"21-0661","Mission Type":"Fire, Infrared Imagery","Text":"Incident occurred on Beckwourth Complex on 7\/17\/21 night shift in DIV A\/C.  During an IR\/mapping mission utilizing DJI Mautrice 600 pilot was unable to return aircraft to primary landing site. M600 was forced to land at a secondary landing site causing damage to all six pairs of propellers.  Prior to this flight, PIC had flown mission with a different aircraft and had successfully mapped location. Environmental and line of sight (LOS) was known. The aircraft utilized for this mission had a known deficiency that caused an uncontrolled yaw. This issue was discussed with PIC and pilot in charge and PIC decided to proceed with mission.  After launch, pilot verified controls and proceeded to fly IR\/mapping mission. Pilot rechecked control inputs and battery at 1 mile our from GCS. No issues. PIC proceeded to fly to 2-mile mark. At 35% Battery, pilot started return. Single input with stick at full deflection for return flight.  Aircraft responded with uncontrolled yaw. PIC mentioned the issue to Aircraft’s primary pilot. Primary pilot took control and attempted to bring aircraft back, but controlled yaw persisted, and was forced to choose secondary landing site due to limited battery.  Aircraft lost connection to controller at 150 ft while descending to secondary landing site.  Recovered aircraft at secondary landing site. Aircraft sustained damage to all 6 pairs of props.  Discussion with pilot on utilizing equipment that had not been previously flown and understanding each aircraft is slightly different. Ensuring sufficient battery life is maintained for the intangibles. Review of BVLOS operations with all members of module.  If another aircraft is available, choose one that functions without issues for the mission. "}
{"Tracking #":"21-0706","Mission Type":"Fire, Infrared Imagery","Text":"DURING THE 3RD AND FINAL IR FLIGHT OF THE EVENING THE UAS WAS MOVING OVER AN IDENIFIED HOT SPOT TO TAKE A PHOTO WHEN THE RETURN TO HOME LOW BATTERY WARNING CAME ON. I HAD JUST LOOKED AT MY BATTERY LIFE AND IT WAS IN THE 55% RANGE. AFTER HEARING THE ALARM I LOOKED DOWN AT MY TABLET AND NOTICED THAT THE BATTERY LEVEL STATUS FOR EACH OF THE 6 BATTERIES WAS SHOWING, AND THEY RANGED IN SEVERAL DIFFERENT PERCENTAGES. SOME WERE 28%, OTHERS WERE IN THE 30'S AND ONE IN THE LOW 40'S. I IMEDIATLEY BROUGHT THE AIRCRAFT BACK AND LANDED AT THE LZ. LOOKED THINGS OVER AND COULDNT FIND ANYTHING OUT OF THE ORDINARY. WE PULLED THE BATTERIES AND SET THEM ASSIDE TO FULLY DRAIN. \r\nTHINGS TO NOTE: BATTERIES WERE BRAND NEW, THIS WAS THE FIRST FLIGHT FOR THEM.\r\n I PLAN TO RECHARGE THE BATTERIES AND RUN A DIAGNOSTICS REPORT.  IF EVERYTHING LOOKS OK I WILL DO SOME TEST FLIGHTS WITH THEM BEFORE PUTTING BACK INTO SERVICE. \r\nUAS PROG MGR Comments:  I believe this is the appropriate action according to the manual. As it states.\r\n“Charge and discharge the battery completely once every 10 to 15 charge\/discharge cycles. Discharge the battery until there is 0% power or until it can no longer be turned on, then recharge it to maximum capacity. This cycling procedure will optimize the battery life and help calibrate the battery gauge.”\r\n-Hopefully it is a battery gauge issue with this particular set of batteries.\r\nRASM Comments:  Nothing more to follow."}
{"Tracking #":"21-0707","Mission Type":"Fire, Infrared Imagery","Text":"On 2021-07-23 while assigned to the Dixie Fire the RPIC and VO conducting a recon\/IR flight of the fire perimeter from Chucks Rock on Div W using a DJI M600. The aircraft was inspected prior to takeoff at which time a small amount of vertical play\/looseness was noted in one of the prop shafts. The prop fasteners were secure and the A\/C was deemed safe for flight. Controllability checks were conducted immediately after takeoff and no abnormalities were noted. The flight lasted approx. 15 minutes and was uneventful. During landing the RPIC noted that the aircraft was having difficulty maintain a stable hover and required constant control inputs to maintain a vertical decent. The aircraft was landed successfully and the flight was terminated. Upon approaching the a\/c the RPIC and VO noticed that a single prop blade was missing. Inspection revealed that the prop “hub” was still screwed tightly to the motor casing, and the shaft\/pin was still in place, but had been sheared off on the bottom and was sitting loosely in the hub. The entire blade, including the base\/hub was missing. The other prop blade was still intact and secured to the hub. The remaining props were all inspected and no issues were found. The prop that failed is believed to have been the one that was loose prior to the flight. The damaged prop assembly was replaced with a new part, a thorough inspection of the entire aircraft was conducted, and the A\/C was returned to service. The crew discussed the incident and came to a consensus that the best practice is to replace prop assemblies immediately if any play is noticed in the blades."}
{"Tracking #":"21-0761","Mission Type":"Fire, Infrared Imagery","Text":"On the last IR flight of the day the pilot was landing on the landing pad. The right rear portion of the skid landed on the black trim where there was a slight (2”) rise under the landing pad. Both pilot and observer witnessed the drone tilt forward the observer told the pilot to lift. The PIC corrected by moving both sticks to forward position instead of only climbing with left stick. Drone continued pitching forward, landing gear caught the pad and the drone pitched over landing upside down on the ground. Observed minor damage to rotors, GPS units and locks for 2-3 arms. \r\n\r\n Pilot and observer talked about taking more time to level out uneven surfaces. We talked about abort landing procedures. Taking more time to land in the center of the pad with a slower decent. "}
{"Tracking #":"21-0764","Mission Type":"Fire, Reconnaissance","Text":"After completing 3 IR flights the PIC noticed that 4 of the spacer pins on the M600 Ignis Motor Bracket spacer pins had vibrated loose and were no longer in place. Pilots checked other pins and found even though thread lock was used they were still vibrating loose.  Be vigilant with preflights and aircraft walk arounds. Use index lines to show loosening. \r\n\r\nRASM:  Good catch!  "}
{"Tracking #":"21-0774","Mission Type":"Fire, Infrared Imagery","Text":"South Yaak Fire.  July 29th 2021\r\nUAS was on Div U to assist with aerial ignitions and gridding\/patrolling for spot fires during a burnout operation.  Prior to this incident, UAS had conducted 22 flights from this location.  \r\nThe crews started burning at approximately 10:30. The burnout was progressing from the DP132 area to the Div U\/T break.  Div U had requested UAS to provide IR flights to assist the holding resources with identifying spot fires.  The UAS was being flown from a large meadow approximately 2000ft from the fire line. UAS was given clearance to operate 5,500ft and below on altimeter 30.12 from DP 132 to the Div U\/T break.  AA also informed UAS that there was a Type 2 helicopter working to the south in Div T and a Type 1 working in Div W.  UAS was requesting clearance before each flight.  This flight occurred at 16:27.   \r\nApproximately 12 minutes into the flight I heard a helicopter coming in from the north.  I told the UASP(t) to descend to the treetops and return to the launch area.  From my location the helicopter seemed to be moving along the fire edge to the east of DP-162 and not in the direction of the UAS.  Once the UAS was over the meadow and below the treetops (approximately 2 min), I contacted AA on air to ground primary.  I let AA know that we are still conducting UAS operations and the helicopter seemed close to our area of operations and asked if we needed to set down to allow the helicopter to work.   AA reply was that the helicopter “wandered a bit too far” and to standby.  The UASP(t) landed the UAS (approximately another 2 min), I then let AA know we were on the ground and we were told to stay on the ground.   The UAS remained on the ground the remainder of the shift.  \r\nThe image below is of the track log of the UAS during the flight overlaid on the ops map of the fire.  The green icon is where the UAS was launched from.    \r\n\r\n National UAS Operations Specialist:\r\n1. The UASL attended a meeting at the helibase the following day.  Although at the conclusion of the meeting everyone was able to say what they needed and end on a positive note, there were some comments that may need to be discussed further.  \r\n2. Both helicopters were unaware that a UAS was in the air during their missions.  \r\n3.  The UAS was repeatedly called a toy and it was stated that the UAS pilots “don’t have any skin in the game” and that if we crash a drone we just get another one where as if we crash into a helicopter they would be taking a “dirt nap”.   Although I completely agree with the pilots frustrations and concerns with UAS better communication preseason with the helicopter community as a whole might help with integration.  Use cases and examples of how UAS is utilized usually helps to understand why the demand for UAS is growing so rapidly.  \r\n4. The UASL was asked why we didn't call the helicopter on the victor freq.  The use of hand held VHF radios from the ground has proven to be unreliable for communication.  \r\n5. PMS-515 states For Type 3 and Type 4 UAS Communications are maintained with the UAS crew only on assigned FM frequencies.                           Region 1 UAS Aviation Specialist: \r\n1.\tThe UAS crew followed all their and the Aerial Supervision procedures. But as is not uncommon, things slip through the cracks. When the UAS crew had concerns about the proximity of the helicopter they made a smart and safe decision to descend out of the way and establish communication to check everyone’s situational awareness. This is good decision making on their part. \r\n2.\tCommunication on the air-to-air frequencies is a problem that needs to be solved. A UAS is an aircraft and therefore should have reliable communication on those frequencies. I don’t know how to solve it except to go to radio experts with our issues. A vehicle radio seems impractical, so the solution seems to lie in some sort of booster or antenna. \r\n3.\tSituational awareness enhancement could also be achieved by petitioning the FAA to allow ADS-B output on our UAS. This is again an issue that is probably not easy to accomplish, but worth pursuing. \r\n4.\tManned aircraft pilots having the opinion that UAS has no “skin in the game” in regards to a collision is not unreasonable. To alleviate this, I think the suggestions already discussed would help. To reiterate: More reliable communication and situational awareness may make the manned aircraft pilots and crews feel better about sharing the airspace with UAS. If the manned aircraft pilots believe that they will be able to talk to and see where the UAS is when they need to, their concerns should be diminished. Also, continuing the communication procedures by the UAS pilots as was done in this instance should also be a mitigation for a mishap. \r\n"}
{"Tracking #":"21-0789","Mission Type":"Fire, Infrared Imagery","Text":"On the evening of August 10th, 2021, while flying night operation missions with a CWN UAS, a vendor provided and operated FireEye, on the Monument Fire, the unmanned aerial vehicle experienced a hard landing. This was the initial start of the tour with the plan for a single 2 hour flight for the first night after site selection and setup during daylight hours.  Operation were being conducted between Division U and Division W at 2,700’ MSL with a density altitude at the time of 6,332’.  Take off occurred after a crew briefing, notification to dispatch, helibase, and ASGS verifying all manned aviation flights in the TFR were completed for the day along with the SOP blind radio calls.  After a successful approximate 2 hour flight while returning to the home location, the aircraft transitioned to vertical landing and began descent. The transition overshot the landing area but recovered to directly above the pad by pilot manual input.  Once over the landing pad the aircraft began descending at an increasing rate of speed until rapidly impacting the pad at approximately 2226 hours. The vertical motors appeared operational during descent and although the aircraft appeared stable could not slow the rate of descent. The aircraft fuselage, gimbal, wings, and feet with multiple rotor strikes from the vertical motors were all damaged by the impact with the ground. No personnel were near the aircraft, no other equipment was damaged, and no injuries occurred. Sequence of Events per the Vendor's Mishap Report:\r\nAfter the aircraft overshot the Launch and Recovery Zone (LRZ), it transitioned from forward flight to hover at 200 ft. AGL, 70 ft. above the planned 130 ft. AGL. The overshoot and higher than expected transition altitude were a result of the tailwind. With a tailwind the aircraft final altitude will be higher. The transition process, as expected, flared the aircraft upward by an additional 50 ft. With the aircraft in AUTO mode, the autopilot moved the aircraft in reverse to position over the LRZ. As the aircraft did this, the telemetry logs (tlogs) show that the aircraft autopilot sought to maintain attitude before rapidly descending to land. Once the rapid rate of descent was noted QHOVER was commanded to manually take control of the aircraft for landing. The decent rate was too great to overcome despite the throttle increase command to prevent a hard landing.\r\n\r\nCorrective Actions per the Vendor's Mishap Report:\r\n1) Update crew resource training materials to address the need to ensure checks lists are being followed and to assess unexpected conditions during flight (e.g., no challenge on the aircraft overshot the landing zone at a much higher altitude than expected or whether prolonger operations in reverse made sense vs. QHOVER). \r\n2) The RPIC and RSO were disqualified from piloting duties subject to successful completion of remediation training on the proper operation of aircraft during landing, including when QHOVER is selected during positioning, as well as the identification of standard and non-standard conditions and operations that are communicated \r\namongst crew members to identify potential issues regarding wind direction, velocity, aircraft altitude, and flight characteristics. Pilots can be reinstated once remediation training is successfully completed. \r\nc) Conduct mishap debrief for all vendor pilots. The debrief which included lessons learned \/ flight documentation changes was completed on 26 August 21. "}
{"Tracking #":"21-0838","Mission Type":"Fire, Reconnaissance","Text":"While conducting IR Flights on the xxx Complex in Oregon loss of control and damage to aircraft rotors occurred\r\n.Pilot, VO were conducting a recon utilizing IR to assist the Division in confirming if fire had crossed the proposed containment lines and where the fire was. On the third flight from this location at approximately 8000 feet distance from the launch site the aircraft started to lose video. The pilot started to fly home when the aircraft lost full video and entered “return to home mode”. The pilot retook control of the aircraft and continued to fly home via the map with no video. At approximately 5000 feet from home the Aircraft once again entered “return to home mode” at this juncture despite following procedures to return the Aircraft to “Fly modes” was unable to retake control of the aircraft. At approximately 3000 feet from home all Telemetry was lost. Pilot disconnected and reconnected the tablet twice as well as restarted the flight app. With no telemetry pilot allowed aircraft to return home until visual contact was established again. With the Aircraft in sight the Pilot again attempted to return the aircraft to “fly mode”. The aircraft was unresponsive to any input from the controller. As the aircraft self landed it was missing the landing pad by approximately 3 ft. This created a situation where the aircraft was going to land partially off the road and the cut bank was a extremely steep drop off for a hundred feet or so. As it touched down it immediately started to rock back to fall off the cut bank, the pilot in anticipation of this happening had moved in closer to the aircraft and was able to place his foot on the aircrafts right skid to prevent it from completely flipping over and dropping off the edge. The aircraft rolled to the left with the skid not being held down by the pilots foot falling off the road. This caused to rotors to impact the ground completely breaking 2 rotor blades and cracking the third.\r\nThe Pilot, VO and Regional UAS Specialist (who was on scene) conducted an AAR. The only potential thing that was not attempted was to restart the controller. The pilots did state that he considered it but chose not to take that action because the aircraft was returning home and did not want to add another potential failure point in the return home process.\r\n Aircraft will be returned to BLM for further diagnostics before being returned to service.\r\n\r\nRASM: Good attempts to correct the issue and then anticipate the impending landing that was going to end poorly. \r\n\r\nRUAS:  Pilots made the right decisions to get the aircraft back to the launch site and followed correct procedures during a loss of link situation.  Although it is an option, it is not recommended to power down the controller during a loss link situation and then try to power back up to reconnect.  That decision could only exacerbate further complications when trying to regain connection and control of the UAS.   "}
{"Tracking #":"21-0859","Mission Type":"Fire, Infrared Imagery","Text":"nan nan"}
{"Tracking #":"21-0876","Mission Type":"Fire, Infrared Imagery","Text":"During pre-flight inspection, we found the motor mount  reinforcement, installed by drone amplified, had a crack. The crack was on the outside of the motor mount where the reinforcement rests against the bottom of the case during transport. Inspection of the case revealed areas where the reinforcement had cut through the foam padding causing the reinforcement to rest against the hard plastic of the case.  Aircraft is removed from full-payload service until a replacement reinforcement can be installed. "}
{"Tracking #":"21-0894","Mission Type":"Fire, Other","Text":"On August 21, 2021 at approximately 1500, aerial supervision (HLCO) and URXX came within 300-350 ft of each other during operational missions for both aircraft. URXX was located in Division Uniform, 1.33 miles to the south, southwest of the K\/U break. Take off and landing location for URXX was in Division Uniform,  on the south side shoulder of Cecilville road.\r\nPrior to URXX launch, the visual observer (V.O.) contacted HLCO, and received permission for URXX to fly in Division Uniform, with altimeter and altitude established. HLCO added, that they would be far  past the area where URXX was operating. Approximately 8-9 minutes into the flight, HLCO contacted URXX and stated they would be flying near DIV U, but would stay out of Div U. HLCO called again, and said they would stay to the north of Cecilville road, UXX acknowledged and advised they would be landing in 5 minutes. Roughly 1-2 minutes later, the pilot for URXX heard a helicopter approaching URXX’s location. Five seconds later, the URXX pilot had a visual on the helicopter. From the URXX pilot perspective, both aircraft were heading directly at each other at indistinguishable altitudes. URXX made a 90 degree turn south to avoid the approaching path of the helicopter. The helicopter flew directly over the landing pad for URXX(located on the south shoulder of Cecilville road). VO contacted HLCO and advised that they just flew over URXX landing location and stated that they were not North of Cecilville road as previously stated. HLCO acknowledged he was close but thought he would be clear of the airspace. VO called HLCO again to let them know how close they actually were. HCLO acknowledged again and stated they would do better next time. URXX pilot landed UAS with no further incident.\r\nURXX pilot pulled the flight log from URXX to get an accurate measurement of distance between the 2 aircraft (300-350 ft).\r\nURXX pilot and VO immediately drove to a cell phone location to inform AOBD and ASGS and discuss further with HLCO of the event. HLCO mentioned they were North of Cecilville RD after passing Cecilville spike, however they slid south to Cecilville road sighting visual concerns due to smoke. HLCO stated this one got away from him and his pilot and they would do better next time.\r\n\r\n After discussion with HLCO, it was determined utilizing specific section numbers on the Incident Operational map where the UAS was specifically operating in Div U, could have been helpful for additional situational awareness.\r\n\r\nHLCO and UAS operators agree that conversations between them need more complete and specific information. Both parties agreed to be more specific moving forward"}
{"Tracking #":"21-0899","Mission Type":"Fire, Infrared Imagery","Text":"After conducting PSD operations on DIV RR, near Grizzly Dip, on the Dixie Fire, the UAS module went into IR operations to look for spots across the line. During one of the IR flights almost immediately after taking off, flying in a NE direction, Visual Observer (VO) noticed the LED light on the rear of the aircraft turn solid red. The aircraft then started flying in the complete opposite direction it was being piloted (SW). Remote Pilot Trainee, was still able to climb and yaw the aircraft however, was unable to pitch forward or backwards to stop the aircraft from flying in the SW direction it was heading. VO called out \"fly away\" at which point pilot trainee immediately hit the return to home button. I noticed that the light on the controller was still green. The aircraft still kept its SW heading. Qualified Remote Pilot took control of the aircraft and after approximately 30 seconds was able to regain control, at which point the LED light on the rear of the aircraft turned solid Green again. The aircraft was piloted back to its \"home location\" and safely landed. Suspected GPS Interference \r\n\r\nOAS, USGS, and BLM SMEs will review the data.\r\n\r\nR5 AMS will follow up on data review for any possible information bulletin needs."}
{"Tracking #":"21-0934","Mission Type":"Fire, Infrared Imagery","Text":"As UASP (T) I began a UAS flight from DP 47 on DIV Zulu of the Monument Fire headed West along indirect fire line.  The mission was spot fire detection using an Infrared Camera.  No spot fires were detected from  IHC’s firing operation.  Upon completion of the mission I returned to DP 47 and proceeded to land.\r\n\r\nUpon landing the aircraft I powered it down, pulling both toggles down and in.  This is one of the options in the manual but I do not recommend it. The aircraft did not completely power off and tipped back, 4 props were damaged.  No personnel were injured.  The corrective action is to stick to powering down the aircraft using only the left toggle, pulling straight down and back.\r\nI believe I chose to power down the aircraft the way I did because of muscle memory (The correct way to power the aircraft on is to pull both toggles back and in.)\r\n I plan on using the left toggle to power off the aircraft in the future."}
{"Tracking #":"21-0965","Mission Type":"Fire, Infrared Imagery","Text":"Scenario: Loss of UAS while conducting thermal IR recon on River Complex, Klamath NF\r\n\r\nPreflight checklist was routine and unremarkable. Mission plan on launch was to monitor UAS aerial ignition groundwork directly adjacent to LZ. This mission objective was met quickly and unremarkably. On scene incident personnel then requested IR recon approx. one mile east (Carter Meadows Summit aka H1, see figure). Slopes around H1 had been experiencing rapid fire growth, and several recon missions had been successfully completed prior to this request. As such, this repeat request was heeded given the proximity of H1, known hazards, and remaining battery reserves.\r\n\r\nThis recon around H1 revealed substantial new growth below and on ridges further east, and an add’l direction was given to scout further eastward to gauge fire extent and holding lines. Pilot in command noted remaining battery life (65.5% average across six) and proceed NE then E, gaining ground rapidly due to strong tailwind. This tailwind was not present in recent prior recon flights around H1.\r\n\r\nApprox 1.5mi east of LZ the video feed became unstable. Pilot briefly halted for recon then began navigating home to the west. Notably, video feed did not stabilize despite closing the distance to the LZ – intermittent\/broken feed, and frozen screen required VO to disconnect and reconnect tablet cable to GCS. At this point VO noted speed of ~16mph despite full deflection pitch forward. This is a known indicator of severe headwind. GCS remained connected (“green”) throughout with PIC in control.\r\n\r\nAt approx. 1mi east of LZ the craft crossed a large valley that rises steeply up to H1. This was very near the location of a known spot from earlier in the day. As the aircraft approached the westward valley slopes rising up to H1, feed was lost followed by loss of link to GCS. Remaining battery was 24% (average across six), distance to LZ was ~4900ft. Connection was not reestablished. After 10 minutes monitoring airspace for autonomous return to home, the aircraft was presumed lost and airspace authority notifications were made. Due to loss of link and remaining battery life, the incident was reported as a UAS flyaway.\r\n\r\nFollowing notifications and airspace re-clearance, the UAS module regrouped and resumed filling incident recon requests using backup aircraft until end of shift. *Be aware of mission creep* The mission plan on launch was expanded with two subsequent in-flight requests. Completing these requests brought UAS endurance factors into play that were potentially manageable, but not considered in advance to identify and mitigate risks before they arose. If multiple destinations had been considered before launch, range and battery management would have been scrutinized. Returning to LZ from this flight with standard 35% battery reserves would have been in question.\r\n\r\n*Gauge winds throughout flight* Wind amplifies fire behavior and diminishes aircraft endurance. Winds at LZ were no factor, but were substantial in adjacent area where the majority of flight took place. Variable winds led to bad aircraft position, and drove convective fire behavior along the path home to LZ.\r\n\r\n*Be aware of rapidly changing environmental factors when performing repeat flights with the same mission profile* Repeated flights of the same mission profiles can cause complacency. Complacency is not limited to times of slow activity. An increase in operational tempo is commonly an indicator of changing conditions but may not be recognized as such because of tunnel vision at crucial time. Tactical pause may be warranted and is ultimately the responsibility of the pilot in command."}
{"Tracking #":"21-0992","Mission Type":"Fire, Infrared Imagery","Text":"Sept 12th 2021 10:43 - 11:03\r\nUAS was ordered for IR and recon on DIV UU on the Dixie \"East\" Fire. \r\nTake off and Landing area was identified at H-60 Alta X \r\n\"blue\" was the aircraft chosen for the mission. \r\n10:43 failed to connect GPS and Camera\r\nRecycled aircraft received connection and 24 satellites. \r\nMidway through the flight noticed a beeping noise. The second time I was able to determine that it was notifying it was losing satellites. I was at 8 satellites and told the Visual Observer that I was returning to home.\r\nOnce within the landing area the aircraft was not responding well to the inputs. I noticed more drift than normal and once the aircraft was under 20ft it would move horizontally, and the motors would rev. I preformed a \"go around\" and attempted a second landing. The same thing happened so we decided to auto-land the aircraft.\r\nIt Started to respond as it was supposed to and climbed to 240ft and started to descend. \r\nAbout 100ft up it was yawing and \"searching\" for a landing area. The aircraft made maneuvers that were not desirable and I tried to cancel the return to launch. Instinctively, I tried to correct the aircraft with small stick inputs. Before the cancellation was made the aircraft flew into a nearby tree. Crash was recorded at 11:03.\r\nThe aircraft seemed to be rolling right as the crash occurred and not climbing or descending.\r\nPG&E was working on a nearby powerline about 50ft to the south near the crash site. \r\nGPS jamming was communicated before the flight but that we would be outside of the jamming area. \r\nUpon further review we could have been within the cone of the jamming site.      During this incident, coordination through the National Airspace Coordinator was a successful corrective action.  Current UAS fleet is dependent on a strong GPS signal for position location and flight safety.  In situations where firefighting UAS aircraft are operating on the fringe of a known VIP TFR restriction (e.g., a Presidential TFR), it is recommended that incident and regional leadership work through the National Airspace Coordinator for deconfliction and clarification.  Additionally, it may be advisable to increase the safety distance from the pre-identified area and consider grounding aircraft until cleared by the National Airspace Coordinator and Dispatch Center.   "}
{"Tracking #":"21-1026","Mission Type":"Fire, Air Attack","Text":"Air Attack was orbiting area to north of fire area (1-2 miles) looing at access and dip sites for the fire. ATGS observed an unmanned aircraft at 12500' MSL which was the same altitude as platform and they were able to avoid a near collision. RASM Comments:  This is a duplicate for more information see Safecom 21-1025."}
{"Tracking #":"21-1028","Mission Type":"Fire, Air Attack","Text":"AA-BBB was orbiting 12,500' offset 3 miles NE of the fire for reduced turbulence when the UAS was spotted approx. 1000' below in a similar right-hand orbit. It remained in-sight for three full orbits. During this time,  J-CC was completing the last run of low level cargo, but didn't see the UAS. Helicopter HHH was at Taylor dip site on Taylor Creek when they saw the the UAS. They also saw some people near the dip site and reported it to AA. During the duration of the incident, the UAS flew over both AC in the orbit. H-AAA and H-FFF were working out of the dip on the North flank of the fire on top of the ridgeline and were not impacted. Shortly after confirming the UAS siting, AA-BBB informed all incident aviation of the UAS and instructed them to exit the fire area.   Notified dispatch and immediately grounded all air resources. Advised dispatch to call local law enforcement with suspect description. After a hour, reassessed flying the fire with air attack only but after doing a risk assessment, pilot declined due to previous days UAS incursion. After 3 hours, reassessed again and sent aircraft back to their respective bases for the remainder of the shift. All aircraft were grounded and did not fly the rest of the day, as this was the second incursion with a UAS in two days.  "}
{"Tracking #":"22-0004","Mission Type":"Fire, Other","Text":"Sighting of a UAS in the area of the Black Mountain Lookout in Division PP of the Dixie East Zone.  Fire personnel heard then saw a UAS circling them at an estimated altitude of 300' AGL.  When they started pointing at the UAS it immediately departed the area to the east-northeast.  The operator was not located but was believed to be in the Hwy 395 area due to the exit route of the UAS.  No incident aircraft were in flight or in the area of the intrusion at the time of the sighting. Helibase and Susanville Dispatch notified of intrusion.  AOBD will request PIO's to push information on UAS use near wildfires and within TFR's."}
{"Tracking #":"22-0006","Mission Type":"Fire, Air Attack","Text":"From ATGS: To whom it concerns, today while AAxx was flying the Dixie east zone recon, we noticed a UAS intrusion. This was a fixed winged looking device that was NOT a quad copter but 2 winged machine much like a remote controlled airplane, about 2-3 feet wide, whiteish orange color with some reflections. It was operating about 50-100’ AGL and we orbited overhead for about 5 minutes to confirm but unable to locate the operator. We departed as the UAS was staying above a ridgetop, circling the same location and felt it best to exit the area, we notified Quincy helibase and Div QQ. This took place at 1035 in Div QQ\/ NE side of Dixie valley, lat long:\r\n\r\n39 57.956\/ 120 19.237, Township 25N 15E S05. Reported intrusion to helibase and dispatch.  Team PIO's continue to push warnings ref UAS ops within TFR.  AOBD will bring up issue at morning brief to warn those on the incident not to fly drones if they possess them on the incident."}
