{
  "_name_or_path": "models\\Pre-trained-BERT\\checkpoint-318766",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-MOD",
    "2": "I-MOD",
    "3": "L-MOD",
    "4": "B-EFF",
    "5": "I-EFF",
    "6": "L-EFF",
    "7": "B-CAU",
    "8": "I-CAU",
    "9": "L-CAU",
    "10": "B-REC",
    "11": "I-REC",
    "12": "L-REC",
    "13": "B-CON",
    "14": "I-CON",
    "15": "L-CON",
    "16": "U-REC",
    "17": "U-CAU",
    "18": "U-EFF",
    "19": "U-MOD",
    "20": "U-CON"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CAU": 7,
    "B-CON": 13,
    "B-EFF": 4,
    "B-MOD": 1,
    "B-REC": 10,
    "I-CAU": 8,
    "I-CON": 14,
    "I-EFF": 5,
    "I-MOD": 2,
    "I-REC": 11,
    "L-CAU": 9,
    "L-CON": 15,
    "L-EFF": 6,
    "L-MOD": 3,
    "L-REC": 12,
    "O": 0,
    "U-CAU": 17,
    "U-CON": 20,
    "U-EFF": 18,
    "U-MOD": 19,
    "U-REC": 16
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.17.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
